-- faculty テーブルへのデータ挿入
INSERT INTO faculty (
    faculty_name, created_at
) VALUES
    ('先端理工学研究科', '2025-07-02T12:27:06.422934'),
    ('先端理工学部', '2025-07-02T12:27:06.422934'),
    ('応用化学課程', '2025-07-02T12:27:06.422934'),
    ('数理·情報科学課程', '2025-07-02T12:27:06.422934'),
    ('機械工学·ロボティクス課程', '2025-07-02T12:27:06.422934'),
    ('環境生態工学課程', '2025-07-02T12:27:06.422934'),
    ('環境科学課程', '2025-07-02T12:27:06.422934'),
    ('知能情報メディア課程', '2025-07-02T12:27:06.422934'),
    ('電子情報通信課程', '2025-07-02T12:27:06.422934')
ON CONFLICT (faculty_name) DO UPDATE SET faculty_name = EXCLUDED.faculty_name;
