-- subclass テーブルへのデータ挿入
INSERT INTO subclass (
    subclass_name, created_at
) VALUES
    ('スポーツ科学系科目', '2025-05-31T07:59:38.809746'),
    ('人文科学系科目', '2025-05-31T07:59:38.809746'),
    ('仏教の思想', '2025-05-31T07:59:38.809746'),
    ('専門基礎科目', '2025-05-31T07:59:38.809746'),
    ('専門応用科目', '2025-05-31T07:59:38.809746'),
    ('教養教育科目特別講義', '2025-05-31T07:59:38.809746'),
    ('社会科学系科目', '2025-05-31T07:59:38.809746'),
    ('自然科学系科目', '2025-05-31T07:59:38.809746'),
    ('言語科目', '2025-05-31T07:59:38.809746')
ON CONFLICT (subclass_name) DO UPDATE SET subclass_name = EXCLUDED.subclass_name;
