-- syllabus テーブルへのデータ挿入
INSERT INTO syllabus (
    subject_code, year, subtitle, term, grade_b1, grade_b2, grade_b3, grade_b4, grade_m1, grade_m2, grade_d1, grade_d2, grade_d3, campus, credits, lecture_code, summary, goals, methods, outside_study, notes, remarks, created_at, updated_at
) VALUES
    ('G250110001', 4, '', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 2, 'G111', '', '', '', '', '【オープン登録科目】
1-1 仏教必修
【対象】T:電子情報学科・機械システム工学科、Y:電子情報通信課程・機械工学ロボティクス課程', '', '2025-05-19T02:21:06.453307', NULL),
    ('G250110002', 4, '', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 2, 'G112', '', '', '', '', '【オープン登録科目】
1-1 仏教必修
【対象】T:電子情報学科・機械システム工学科、Y:電子情報通信課程・機械工学ロボティクス課程', '', '2025-05-19T02:21:06.473614', NULL),
    ('G250110003', 4, '', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 2, 'G113', '', '', '', '', '【オープン登録科目】
1-1 仏教必修
【対象】T:電子情報学科・機械システム工学科、Y:電子情報通信課程・機械工学ロボティクス課程', '', '2025-05-19T02:21:06.495621', NULL),
    ('G250110004', 4, '', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 2, 'G111', '', '', '', '', '【オープン登録科目】
1-1 仏教必修
【対象】T:情報メディア学科、Y:知能情報メディア課程', '', '2025-05-19T02:21:06.518032', NULL),
    ('G250110005', 4, '', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 2, 'G112', '', '', '', '', '【オープン登録科目】
1-1 仏教必修
【対象】T:情報メディア学科、Y:知能情報メディア課程', '', '2025-05-19T02:21:06.543028', NULL),
    ('G250110006', 4, '', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 2, 'G111', '', '', '', '', '【オープン登録科目】
1-1 仏教必修
【対象】T:物質化学科・環境ソリューション工学科、Y:応用化学課程・環境生態工学課程・環境科学課程', '', '2025-05-19T02:21:06.563032', NULL),
    ('G250110007', 4, '', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 2, 'G112', '', '', '', '', '【オープン登録科目】
1-1 仏教必修
【対象】T:物質化学科・環境ソリューション工学科、Y:応用化学課程・環境生態工学課程・環境科学課程', '', '2025-05-19T02:21:06.580544', NULL),
    ('G250110008', 4, '', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 2, 'G113', '', '', '', '', '【オープン登録科目】
1-1 仏教必修
【対象】T:物質化学科・環境ソリューション工学科、Y:応用化学課程・環境生態工学課程・環境科学課程', '', '2025-05-19T02:21:06.599054', NULL),
    ('G250110012', 4, '', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 2, 'G111', '', '', '', '', '【オープン登録科目】
1-1 仏教必修
【対象】T:数理情報学科、Y:数理情報科学課程', '', '2025-05-19T02:21:06.618477', NULL),
    ('G250110013', 4, '', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 2, 'G112', '', '', '', '', '【オープン登録科目】
1-1 仏教必修
【対象】T:数理情報学科、Y:数理情報科学課程', '', '2025-05-19T02:21:06.638480', NULL),
    ('G250110017', 4, '', '後期', False, False, True, True, False, False, False, False, False, '瀬田', 2, 'G161', '', '', '', '', '【オープン登録科目】
1-1 仏教必修
【注意】再履修科目（３年次以上）', '', '2025-05-19T02:21:06.658490', NULL),
    ('G250110018', 4, '', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 2, 'G161', '', '', '', '', '【オープン登録科目】
1-1 仏教必修
【対象】T:電子情報学科・機械システム工学科、Y:電子情報通信課程・機械工学ロボティクス課程', '', '2025-05-19T02:21:06.684998', NULL),
    ('G250110019', 4, '', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 2, 'G162', '', '', '', '', '【オープン登録科目】
1-1 仏教必修
【対象】T:電子情報学科・機械システム工学科、Y:電子情報通信課程・機械工学ロボティクス課程', '', '2025-05-19T02:21:06.707515', NULL),
    ('G250110020', 4, '', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 2, 'G163', '', '', '', '', '【オープン登録科目】
1-1 仏教必修
【対象】T:電子情報学科・機械システム工学科、Y:電子情報通信課程・機械工学ロボティクス課程', '', '2025-05-19T02:21:06.727069', NULL),
    ('G250110021', 4, '', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 2, 'G161', '', '', '', '', '【オープン登録科目】
1-1 仏教必修
【対象】T:情報メディア学科、Y:知能情報メディア課程', '', '2025-05-19T02:21:06.747136', NULL),
    ('G250110022', 4, '', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 2, 'G162', '', '', '', '', '【オープン登録科目】
1-1 仏教必修
【対象】T:情報メディア学科、Y:知能情報メディア課程', '', '2025-05-19T02:21:06.765136', NULL),
    ('G250110023', 4, '', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 2, 'G161', '', '', '', '', '【オープン登録科目】
1-1 仏教必修
【対象】T:物質化学科・環境ソリューション工学科、Y:応用化学課程・環境生態工学課程、環境科学課程', '', '2025-05-19T02:21:06.783657', NULL),
    ('G250110024', 4, '', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 2, 'G162', '', '', '', '', '【オープン登録科目】
1-1 仏教必修
【対象】T:物質化学科・環境ソリューション工学科、Y:応用化学課程・環境生態工学課程・環境科学課程', '', '2025-05-19T02:21:06.802176', NULL),
    ('G250110025', 4, '', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 2, 'G163', '', '', '', '', '【オープン登録科目】
1-1 仏教必修
【対象】T:物質化学科・環境ソリューション工学科、Y:応用化学課程・環境生態工学課程・環境科学課程', '', '2025-05-19T02:21:06.822043', NULL),
    ('G250110029', 4, '', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 2, 'G161', '', '', '', '', '【オープン登録科目】
1-1 仏教必修
【対象】T:数理情報学科、Y:数理情報科学課程', '', '2025-05-19T02:21:06.841037', NULL),
    ('G250110030', 4, '', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 2, 'G162', '', '', '', '', '【オープン登録科目】
1-1 仏教必修
【対象】T:数理情報学科、Y:数理情報科学課程', '', '2025-05-19T02:21:06.859047', NULL),
    ('G250110034', 4, '', '前期', False, False, True, True, False, False, False, False, False, '瀬田', 2, 'G111', '', '', '', '', '【オープン登録科目】
1-1 仏教必修
【注意】再履修科目（３年次以上）', '', '2025-05-19T02:21:06.878566', NULL),
    ('G250190001', 4, '親鸞の思想・言葉・人格に学ぶ', '前期', False, True, True, True, False, False, False, False, False, '瀬田', 2, 'G141', '', '', '', '', '【抽選登録科目】
1-2 仏教選択
Y:ALL
T:ALL
N:ALL', '', '2025-05-19T02:21:06.907080', NULL),
    ('G250190002', 4, '親鸞の思想・言葉・人格に学ぶ', '後期', False, True, True, True, False, False, False, False, False, '瀬田', 2, 'G191', '', '', '', '', '【抽選登録科目】
1-2 仏教選択
Y:ALL
T:ALL
N:ALL', '', '2025-05-19T02:21:06.933803', NULL),
    ('G250200001', 4, '', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G201', '', '', '', '', '【オープン登録科目】
2-1 英語必修
2020年度～
【対象】Y:数理情報科学課程・電子情報通信課程・機械工学ロボティクス課程', '', '2025-05-19T02:21:06.954810', NULL),
    ('G250200002', 4, '', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G202', '', '', '', '', '【オープン登録科目】
2-1 英語必修
2020年度～
【対象】Y:数理情報科学課程・電子情報通信課程・機械工学ロボティクス課程', '', '2025-05-19T02:21:06.975654', NULL),
    ('G250200003', 4, '', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G203', '', '', '', '', '【オープン登録科目】
2-1 英語必修
2020年度～
【対象】Y:数理情報科学課程・電子情報通信課程・機械工学ロボティクス課程', '', '2025-05-19T02:21:07.000171', NULL),
    ('G250200004', 4, '', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G204', '', '', '', '', '【オープン登録科目】
2-1 英語必修
2020年度～
【対象】Y:数理情報科学課程・電子情報通信課程・機械工学ロボティクス課程', '', '2025-05-19T02:21:07.023506', NULL),
    ('G250200005', 4, '', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G205', '', '', '', '', '【オープン登録科目】
2-1 英語必修
2020年度～
【対象】Y:数理情報科学課程・電子情報通信課程・機械工学ロボティクス課程', '', '2025-05-19T02:21:07.059518', NULL),
    ('G250200006', 4, '', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G206', '', '', '', '', '【オープン登録科目】
2-1 英語必修
2020年度～
【対象】Y:数理情報科学課程・電子情報通信課程・機械工学ロボティクス課程', '', '2025-05-19T02:21:07.079033', NULL),
    ('G250200007', 4, '', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G207', '', '', '', '', '【オープン登録科目】
2-1 英語必修
2020年度～
【対象】Y:数理情報科学課程・電子情報通信課程・機械工学ロボティクス課程', '', '2025-05-19T02:21:07.102038', NULL),
    ('G250200008', 4, '', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G208', '', '', '', '', '【オープン登録科目】
2-1 英語必修
2020年度～
【対象】Y:数理情報科学課程・電子情報通信課程・機械工学ロボティクス課程', '', '2025-05-19T02:21:07.123317', NULL),
    ('G250200009', 4, '', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G210', '', '', '', '', '【オープン登録科目】
2-1 英語必修
2020年度～
【対象】Y:数理情報科学課程・電子情報通信課程・機械工学ロボティクス課程', '', '2025-05-19T02:21:07.142317', NULL),
    ('G250200010', 4, '', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G209', '', '', '', '', '【オープン登録科目】
2-1 英語必修
2020年度～
【対象】Y:数理情報科学課程・電子情報通信課程・機械工学ロボティクス課程', '', '2025-05-19T02:21:07.163323', NULL),
    ('G250200011', 4, '', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G211', '', '', '', '', '【オープン登録科目】
2-1 英語必修
2020年度～
【対象】Y:数理情報科学課程・電子情報通信課程・機械工学ロボティクス課程', '', '2025-05-19T02:21:07.184871', NULL),
    ('G250200020', 4, '', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G201', '', '', '', '', '【オープン登録科目】
2-1 英語必修
2020年度～
【対象】Y:応用化学課程・知能情報メディア課程・環境生態工学課程・環境科学課程', '', '2025-05-19T02:21:07.204892', NULL),
    ('G250200021', 4, '', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G202', '', '', '', '', '【オープン登録科目】
2-1 英語必修
2020年度～
【対象】Y:応用化学課程・知能情報メディア課程・環境生態工学課程・環境科学課程', '', '2025-05-19T02:21:07.225889', NULL),
    ('G250200022', 4, '', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G203', '', '', '', '', '【オープン登録科目】
2-1 英語必修
2020年度～
【対象】Y:応用化学課程・知能情報メディア課程・環境生態工学課程・環境科学課程', '', '2025-05-19T02:21:07.251899', NULL),
    ('G250200023', 4, '時事英語の特徴をつかみながらその読解に慣れよう！', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G204', '', '', '', '', '【オープン登録科目】
2-1 英語必修
2020年度～
【対象】Y:応用化学課程・知能情報メディア課程・環境生態工学課程・環境科学課程', '', '2025-05-19T02:21:07.273415', NULL),
    ('G250200024', 4, '', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G205', '', '', '', '', '【オープン登録科目】
2-1 英語必修
2020年度～
【対象】Y:応用化学課程・知能情報メディア課程・環境生態工学課程・環境科学課程', '', '2025-05-19T02:21:07.295422', NULL),
    ('G250200025', 4, '', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G206', '', '', '', '', '【オープン登録科目】
2-1 英語必修
2020年度～
【対象】Y:応用化学課程・知能情報メディア課程・環境生態工学課程・環境科学課程', '', '2025-05-19T02:21:07.320983', NULL),
    ('G250200026', 4, '', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G207', '', '', '', '', '【オープン登録科目】
2-1 英語必修
2020年度～
【対象】Y:応用化学課程・知能情報メディア課程・環境生態工学課程・環境科学課程', '', '2025-05-19T02:21:07.335985', NULL),
    ('G250200027', 4, '', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G208', '', '', '', '', '【オープン登録科目】
2-1 英語必修
2020年度～
【対象】Y:応用化学課程・知能情報メディア課程・環境生態工学課程・環境科学課程', '', '2025-05-19T02:21:07.357988', NULL),
    ('G250200028', 4, '', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G209', '', '', '', '', '【オープン登録科目】
2-1 英語必修
2020年度～
【対象】Y:応用化学課程・知能情報メディア課程・環境生態工学課程・環境科学課程', '', '2025-05-19T02:21:07.376500', NULL),
    ('G250200029', 4, '', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G210', '', '', '', '', '【オープン登録科目】
2-1 英語必修
2020年度～
【対象】Y:応用化学課程・知能情報メディア課程・環境生態工学課程・環境科学課程', '', '2025-05-19T02:21:07.396512', NULL),
    ('G250200030', 4, '', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G211', '', '', '', '', '【オープン登録科目】
2-1 英語必修
2020年度～
【対象】Y:応用化学課程・知能情報メディア課程・環境生態工学課程・環境科学課程', '', '2025-05-19T02:21:07.433136', NULL),
    ('G250200039', 4, '', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G201', '', '', '', '', '【オープン登録科目】
2-1 英語必修
2020年度～
【対象】Y:応用化学課程・知能情報メディア課程・環境生態工学課程・環境科学課程', '', '2025-05-19T02:21:07.454140', NULL),
    ('G250200040', 4, '', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G202', '', '', '', '', '【オープン登録科目】
2-1 英語必修
2020年度～
【対象】Y:応用化学課程・知能情報メディア課程・環境生態工学課程・環境科学課程', '', '2025-05-19T02:21:07.474659', NULL),
    ('G250200041', 4, '', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G203', '', '', '', '', '【オープン登録科目】
2-1 英語必修
2020年度～
【対象】Y:応用化学課程・知能情報メディア課程・環境生態工学課程・環境科学課程', '', '2025-05-19T02:21:07.496662', NULL),
    ('G250200042', 4, '', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G204', '', '', '', '', '【オープン登録科目】
2-1 英語必修
2020年度～
【対象】Y:応用化学課程・知能情報メディア課程・環境生態工学課程・環境科学課程', '', '2025-05-19T02:21:07.517676', NULL),
    ('G250200043', 4, '', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G205', '', '', '', '', '【オープン登録科目】
2-1 英語必修
2020年度～
【対象】Y:応用化学課程・知能情報メディア課程・環境生態工学課程・環境科学課程', '', '2025-05-19T02:21:07.536672', NULL),
    ('G250200044', 4, '', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G206', '', '', '', '', '【オープン登録科目】
2-1 英語必修
2020年度～
【対象】Y:応用化学課程・知能情報メディア課程・環境生態工学課程・環境科学課程', '', '2025-05-19T02:21:07.557683', NULL),
    ('G250200045', 4, '', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G207', '', '', '', '', '【オープン登録科目】
2-1 英語必修
2020年度～
【対象】Y:応用化学課程・知能情報メディア課程・環境生態工学課程・環境科学課程', '', '2025-05-19T02:21:07.579196', NULL),
    ('G250200046', 4, '', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G208', '', '', '', '', '【オープン登録科目】
2-1 英語必修
2020年度～
【対象】Y:応用化学課程・知能情報メディア課程・環境生態工学課程・環境科学課程', '', '2025-05-19T02:21:07.600717', NULL),
    ('G250200047', 4, '', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G209', '', '', '', '', '【オープン登録科目】
2-1 英語必修
2020年度～
【対象】Y:応用化学課程・知能情報メディア課程・環境生態工学課程・環境科学課程', '', '2025-05-19T02:21:07.623983', NULL),
    ('G250200048', 4, '', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G210', '', '', '', '', '【オープン登録科目】
2-1 英語必修
2020年度～
【対象】Y:応用化学課程・知能情報メディア課程・環境生態工学課程・環境科学課程', '', '2025-05-19T02:21:07.645978', NULL),
    ('G250200049', 4, '', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G211', '', '', '', '', '【オープン登録科目】
2-1 英語必修
2020年度～
【対象】Y:応用化学課程・知能情報メディア課程・環境生態工学課程・環境科学課程', '', '2025-05-19T02:21:07.666983', NULL),
    ('G250200058', 4, '', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G201', '', '', '', '', '【オープン登録科目】
2-1 英語必修
2020年度～
【対象】Y:数理情報科学課程・電子情報通信課程・機械工学ロボティクス課程', '', '2025-05-19T02:21:07.688494', NULL),
    ('G250200059', 4, '', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G202', '', '', '', '', '【オープン登録科目】
2-1 英語必修
2020年度～
【対象】Y:数理情報科学課程・電子情報通信課程・機械工学ロボティクス課程', '', '2025-05-19T02:21:07.709003', NULL),
    ('G250200060', 4, '', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G203', '', '', '', '', '【オープン登録科目】
2-1 英語必修
2020年度～
【対象】Y:数理情報科学課程・電子情報通信課程・機械工学ロボティクス課程', '', '2025-05-19T02:21:07.728990', NULL),
    ('G250200061', 4, '', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G204', '', '', '', '', '【オープン登録科目】
2-1 英語必修
2020年度～
【対象】Y:数理情報科学課程・電子情報通信課程・機械工学ロボティクス課程', '', '2025-05-19T02:21:07.751988', NULL),
    ('G250200062', 4, '', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G205', '', '', '', '', '【オープン登録科目】
2-1 英語必修
2020年度～
【対象】Y:数理情報科学課程・電子情報通信課程・機械工学ロボティクス課程', '', '2025-05-19T02:21:07.774067', NULL),
    ('G250200063', 4, '', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G206', '', '', '', '', '【オープン登録科目】
2-1 英語必修
2020年度～
【対象】Y:数理情報科学課程・電子情報通信課程・機械工学ロボティクス課程', '', '2025-05-19T02:21:07.812302', NULL),
    ('G250200064', 4, '', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G207', '', '', '', '', '【オープン登録科目】
2-1 英語必修
2020年度～
【対象】Y:数理情報科学課程・電子情報通信課程・機械工学ロボティクス課程', '', '2025-05-19T02:21:07.835129', NULL),
    ('G250200065', 4, '', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G208', '', '', '', '', '【オープン登録科目】
2-1 英語必修
2020年度～
【対象】Y:数理情報科学課程・電子情報通信課程・機械工学ロボティクス課程', '', '2025-05-19T02:21:07.854138', NULL),
    ('G250200066', 4, '', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G209', '', '', '', '', '【オープン登録科目】
2-1 英語必修
2020年度～
【対象】Y:数理情報科学課程・電子情報通信課程・機械工学ロボティクス課程', '', '2025-05-19T02:21:07.876479', NULL),
    ('G250200067', 4, '', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G210', '', '', '', '', '【オープン登録科目】
2-1 英語必修
2020年度～
【対象】Y:数理情報科学課程・電子情報通信課程・機械工学ロボティクス課程', '', '2025-05-19T02:21:07.897983', NULL),
    ('G250200068', 4, '', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G211', '', '', '', '', '【オープン登録科目】
2-1 英語必修
2020年度～
【対象】Y:数理情報科学課程・電子情報通信課程・機械工学ロボティクス課程', '', '2025-05-19T02:21:07.924168', NULL),
    ('G250200077', 4, '', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G251', '', '', '', '', '【オープン登録科目】
2-1 英語必修
2020年度～
【対象】Y:数理情報科学課程・電子情報通信課程・機械工学ロボティクス課程', '', '2025-05-19T02:21:07.946171', NULL),
    ('G250200078', 4, '', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G252', '', '', '', '', '【オープン登録科目】
2-1 英語必修
2020年度～
【対象】Y:数理情報科学課程・電子情報通信課程・機械工学ロボティクス課程', '', '2025-05-19T02:21:07.969694', NULL),
    ('G250200079', 4, '', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G253', '', '', '', '', '【オープン登録科目】
2-1 英語必修
2020年度～
【対象】Y:数理情報科学課程・電子情報通信課程・機械工学ロボティクス課程', '', '2025-05-19T02:21:07.989708', NULL),
    ('G250200080', 4, '', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G254', '', '', '', '', '【オープン登録科目】
2-1 英語必修
2020年度～
【対象】Y:数理情報科学課程・電子情報通信課程・機械工学ロボティクス課程', '', '2025-05-19T02:21:08.009130', NULL),
    ('G250200081', 4, '', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G255', '', '', '', '', '【オープン登録科目】
2-1 英語必修
2020年度～
【対象】Y:数理情報科学課程・電子情報通信課程・機械工学ロボティクス課程', '', '2025-05-19T02:21:08.053654', NULL),
    ('G250200082', 4, '', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G256', '', '', '', '', '【オープン登録科目】
2-1 英語必修
2020年度～
【対象】Y:数理情報科学課程・電子情報通信課程・機械工学ロボティクス課程', '', '2025-05-19T02:21:08.074524', NULL),
    ('G250200083', 4, '', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G257', '', '', '', '', '【オープン登録科目】
2-1 英語必修
2020年度～
【対象】Y:数理情報科学課程・電子情報通信課程・機械工学ロボティクス課程', '', '2025-05-19T02:21:08.094533', NULL),
    ('G250200084', 4, '', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G258', '', '', '', '', '【オープン登録科目】
2-1 英語必修
2020年度～
【対象】Y:数理情報科学課程・電子情報通信課程・機械工学ロボティクス課程', '', '2025-05-19T02:21:08.116054', NULL),
    ('G250200085', 4, '', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G260', '', '', '', '', '【オープン登録科目】
2-1 英語必修
2020年度～
【対象】Y:数理情報科学課程・電子情報通信課程・機械工学ロボティクス課程', '', '2025-05-19T02:21:08.135838', NULL),
    ('G250200086', 4, '', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G259', '', '', '', '', '【オープン登録科目】
2-1 英語必修
2020年度～
【対象】Y:数理情報科学課程・電子情報通信課程・機械工学ロボティクス課程', '', '2025-05-19T02:21:08.158843', NULL),
    ('G250200087', 4, '', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G261', '', '', '', '', '【オープン登録科目】
2-1 英語必修
2020年度～
【対象】Y:数理情報科学課程・電子情報通信課程・機械工学ロボティクス課程', '', '2025-05-19T02:21:08.193361', NULL),
    ('G250200096', 4, '', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G251', '', '', '', '', '【オープン登録科目】
2-1 英語必修
2020年度～
【対象】Y:応用化学課程・知能情報メディア課程・環境生態工学課程・環境科学課程', '', '2025-05-19T02:21:08.214437', NULL),
    ('G250200097', 4, '', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G252', '', '', '', '', '【オープン登録科目】
2-1 英語必修
2020年度～
【対象】Y:応用化学課程・知能情報メディア課程・環境生態工学課程・環境科学課程', '', '2025-05-19T02:21:08.234440', NULL),
    ('G250200098', 4, '', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G253', '', '', '', '', '【オープン登録科目】
2-1 英語必修
2020年度～
【対象】Y:応用化学課程・知能情報メディア課程・環境生態工学課程・環境科学課程', '', '2025-05-19T02:21:08.256441', NULL),
    ('G250200099', 4, '時事英語の特徴をつかみながらその読解に慣れよう！', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G254', '', '', '', '', '【オープン登録科目】
2-1 英語必修
2020年度～
【対象】Y:応用化学課程・知能情報メディア課程・環境生態工学課程・環境科学課程', '', '2025-05-19T02:21:08.277247', NULL),
    ('G250200100', 4, '', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G255', '', '', '', '', '【オープン登録科目】
2-1 英語必修
2020年度～
【対象】Y:応用化学課程・知能情報メディア課程・環境生態工学課程・環境科学課程', '', '2025-05-19T02:21:08.296251', NULL),
    ('G250200101', 4, '', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G256', '', '', '', '', '【オープン登録科目】
2-1 英語必修
2020年度～
【対象】Y:応用化学課程・知能情報メディア課程・環境生態工学課程・環境科学課程', '', '2025-05-19T02:21:08.319763', NULL),
    ('G250200102', 4, '', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G257', '', '', '', '', '【オープン登録科目】
2-1 英語必修
2020年度～
【対象】Y:応用化学課程・知能情報メディア課程・環境生態工学課程・環境科学課程', '', '2025-05-19T02:21:08.334352', NULL),
    ('G250200103', 4, '', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G258', '', '', '', '', '【オープン登録科目】
2-1 英語必修
2020年度～
【対象】Y:応用化学課程・知能情報メディア課程・環境生態工学課程・環境科学課程', '', '2025-05-19T02:21:08.356355', NULL),
    ('G250200104', 4, '', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G259', '', '', '', '', '【オープン登録科目】
2-1 英語必修
2020年度～
【対象】Y:応用化学課程・知能情報メディア課程・環境生態工学課程・環境科学課程', '', '2025-05-19T02:21:08.372862', NULL),
    ('G250200105', 4, '', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G260', '', '', '', '', '【オープン登録科目】
2-1 英語必修
2020年度～
【対象】Y:応用化学課程・知能情報メディア課程・環境生態工学課程・環境科学課程', '', '2025-05-19T02:21:08.394869', NULL),
    ('G250200106', 4, '', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G261', '', '', '', '', '【オープン登録科目】
2-1 英語必修
2020年度～
【対象】Y:応用化学課程・知能情報メディア課程・環境生態工学課程・環境科学課程', '', '2025-05-19T02:21:08.419911', NULL),
    ('G250200115', 4, '', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G251', '', '', '', '', '【オープン登録科目】
2-1 英語必修
2020年度～
【対象】Y:応用化学課程・知能情報メディア課程・環境生態工学課程・環境科学課程', '', '2025-05-19T02:21:08.439922', NULL),
    ('G250200116', 4, '', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G252', '', '', '', '', '【オープン登録科目】
2-1 英語必修
2020年度～
【対象】Y:応用化学課程・知能情報メディア課程・環境生態工学課程・環境科学課程', '', '2025-05-19T02:21:08.460926', NULL),
    ('G250200117', 4, '', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G253', '', '', '', '', '【オープン登録科目】
2-1 英語必修
2020年度～
【対象】Y:応用化学課程・知能情報メディア課程・環境生態工学課程・環境科学課程', '', '2025-05-19T02:21:08.481435', NULL),
    ('G250200118', 4, '', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G254', '', '', '', '', '【オープン登録科目】
2-1 英語必修
2020年度～
【対象】Y:応用化学課程・知能情報メディア課程・環境生態工学課程・環境科学課程', '', '2025-05-19T02:21:08.503445', NULL),
    ('G250200119', 4, '', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G255', '', '', '', '', '【オープン登録科目】
2-1 英語必修
2020年度～
【対象】Y:応用化学課程・知能情報メディア課程・環境生態工学課程・環境科学課程', '', '2025-05-19T02:21:08.524210', NULL),
    ('G250200120', 4, '', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G256', '', '', '', '', '【オープン登録科目】
2-1 英語必修
2020年度～
【対象】Y:応用化学課程・知能情報メディア課程・環境生態工学課程・環境科学課程', '', '2025-05-19T02:21:08.559218', NULL),
    ('G250200121', 4, '', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G257', '', '', '', '', '【オープン登録科目】
2-1 英語必修
2020年度～
【対象】Y:応用化学課程・知能情報メディア課程・環境生態工学課程・環境科学課程', '', '2025-05-19T02:21:08.579732', NULL),
    ('G250200122', 4, '', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G258', '', '', '', '', '【オープン登録科目】
2-1 英語必修
2020年度～
【対象】Y:応用化学課程・知能情報メディア課程・環境生態工学課程・環境科学課程', '', '2025-05-19T02:21:08.601840', NULL),
    ('G250200123', 4, '', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G259', '', '', '', '', '【オープン登録科目】
2-1 英語必修
2020年度～
【対象】Y:応用化学課程・知能情報メディア課程・環境生態工学課程・環境科学課程', '', '2025-05-19T02:21:08.627024', NULL),
    ('G250200124', 4, '', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G260', '', '', '', '', '【オープン登録科目】
2-1 英語必修
2020年度～
【対象】Y:応用化学課程・知能情報メディア課程・環境生態工学課程・環境科学課程', '', '2025-05-19T02:21:08.648364', NULL),
    ('G250200125', 4, '', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G261', '', '', '', '', '【オープン登録科目】
2-1 英語必修
2020年度～
【対象】Y:応用化学課程・知能情報メディア課程・環境生態工学課程・環境科学課程', '', '2025-05-19T02:21:08.668002', NULL),
    ('G250200134', 4, '', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G251', '', '', '', '', '【オープン登録科目】
2-1 英語必修
2020年度～
【対象】Y:数理情報科学課程・電子情報通信課程・機械工学ロボティクス課程', '', '2025-05-19T02:21:08.692209', NULL),
    ('G250200135', 4, '', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G252', '', '', '', '', '【オープン登録科目】
2-1 英語必修
2020年度～
【対象】Y:数理情報科学課程・電子情報通信課程・機械工学ロボティクス課程', '', '2025-05-19T02:21:08.715186', NULL),
    ('G250200136', 4, '', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G253', '', '', '', '', '【オープン登録科目】
2-1 英語必修
2020年度～
【対象】Y:数理情報科学課程・電子情報通信課程・機械工学ロボティクス課程', '', '2025-05-19T02:21:08.736351', NULL),
    ('G250200137', 4, '', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G254', '', '', '', '', '【オープン登録科目】
2-1 英語必修
2020年度～
【対象】Y:数理情報科学課程・電子情報通信課程・機械工学ロボティクス課程', '', '2025-05-19T02:21:08.756358', NULL),
    ('G250200138', 4, '', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G255', '', '', '', '', '【オープン登録科目】
2-1 英語必修
2020年度～
【対象】Y:数理情報科学課程・電子情報通信課程・機械工学ロボティクス課程', '', '2025-05-19T02:21:08.777154', NULL),
    ('G250200139', 4, '', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G256', '', '', '', '', '【オープン登録科目】
2-1 英語必修
2020年度～
【対象】Y:数理情報科学課程・電子情報通信課程・機械工学ロボティクス課程', '', '2025-05-19T02:21:08.799125', NULL),
    ('G250200140', 4, '', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G257', '', '', '', '', '【オープン登録科目】
2-1 英語必修
2020年度～
【対象】Y:数理情報科学課程・電子情報通信課程・機械工学ロボティクス課程', '', '2025-05-19T02:21:08.822187', NULL),
    ('G250200141', 4, '', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G258', '', '', '', '', '【オープン登録科目】
2-1 英語必修
2020年度～
【対象】Y:数理情報科学課程・電子情報通信課程・機械工学ロボティクス課程', '', '2025-05-19T02:21:08.844239', NULL),
    ('G250200142', 4, '', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G259', '', '', '', '', '【オープン登録科目】
2-1 英語必修
2020年度～
【対象】Y:数理情報科学課程・電子情報通信課程・機械工学ロボティクス課程', '', '2025-05-19T02:21:08.865023', NULL),
    ('G250200143', 4, '', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G260', '', '', '', '', '【オープン登録科目】
2-1 英語必修
2020年度～
【対象】Y:数理情報科学課程・電子情報通信課程・機械工学ロボティクス課程', '', '2025-05-19T02:21:08.887830', NULL),
    ('G250200144', 4, '', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G261', '', '', '', '', '【オープン登録科目】
2-1 英語必修
2020年度～
【対象】Y:数理情報科学課程・電子情報通信課程・機械工学ロボティクス課程', '', '2025-05-19T02:21:08.913268', NULL),
    ('G250200153', 4, '', '前期', False, True, True, True, False, False, False, False, False, '瀬田', 1, 'G201', '', '', '', '', '【オープン登録科目】
2-1 英語必修
2019年度～
【対象】Y:応用化学課程・知能情報メディア課程・環境生態工学課程', '', '2025-05-19T02:21:08.950318', NULL),
    ('G250200154', 4, '', '前期', False, True, True, True, False, False, False, False, False, '瀬田', 1, 'G202', '', '', '', '', '【オープン登録科目】
2-1 英語必修
2019年度～
【対象】Y:応用化学課程・知能情報メディア課程・環境生態工学課程', '', '2025-05-19T02:21:08.971837', NULL),
    ('G250200155', 4, '', '前期', False, True, True, True, False, False, False, False, False, '瀬田', 1, 'G203', '', '', '', '', '【オープン登録科目】
2-1 英語必修
2019年度～
【対象】Y:応用化学課程・知能情報メディア課程・環境生態工学課程', '', '2025-05-19T02:21:08.992235', NULL),
    ('G250200156', 4, '', '前期', False, True, True, True, False, False, False, False, False, '瀬田', 1, 'G204', '', '', '', '', '【オープン登録科目】
2-1 英語必修
2019年度～
【対象】Y:応用化学課程・知能情報メディア課程・環境生態工学課程', '', '2025-05-19T02:21:09.014193', NULL),
    ('G250200157', 4, '', '前期', False, True, True, True, False, False, False, False, False, '瀬田', 1, 'G205', '', '', '', '', '【オープン登録科目】
2-1 英語必修
2019年度～
【対象】Y:応用化学課程・知能情報メディア課程・環境生態工学課程', '', '2025-05-19T02:21:09.036166', NULL),
    ('G250200158', 4, 'Reading focus plus vocabulary building in English', '前期', False, True, True, True, False, False, False, False, False, '瀬田', 1, 'G206', '', '', '', '', '【オープン登録科目】
2-1 英語必修
2019年度～
【対象】Y:応用化学課程・知能情報メディア課程・環境生態工学課程', '', '2025-05-19T02:21:09.056556', NULL),
    ('G250200159', 4, '', '前期', False, True, True, True, False, False, False, False, False, '瀬田', 1, 'G207', '', '', '', '', '【オープン登録科目】
2-1 英語必修
2019年度～
【対象】Y:応用化学課程・知能情報メディア課程・環境生態工学課程', '', '2025-05-19T02:21:09.076927', NULL),
    ('G250200160', 4, '', '前期', False, True, True, True, False, False, False, False, False, '瀬田', 1, 'G208', '', '', '', '', '【オープン登録科目】
2-1 英語必修
2019年度～
【対象】Y:応用化学課程・知能情報メディア課程・環境生態工学課程', '', '2025-05-19T02:21:09.099535', NULL),
    ('G250200161', 4, '時事英語の特徴をつかみながらその読解に慣れよう！', '前期', False, True, True, True, False, False, False, False, False, '瀬田', 1, 'G209', '', '', '', '', '【オープン登録科目】
2-1 英語必修
2019年度～
【対象】Y:応用化学課程・知能情報メディア課程・環境生態工学課程', '', '2025-05-19T02:21:09.121795', NULL),
    ('G250200162', 4, '', '前期', False, True, True, True, False, False, False, False, False, '瀬田', 1, 'G210', '', '', '', '', '【オープン登録科目】
2-1 英語必修
2019年度～
【対象】Y:応用化学課程・知能情報メディア課程・環境生態工学課程', '', '2025-05-19T02:21:09.142954', NULL),
    ('G250200163', 4, '', '前期', False, True, True, True, False, False, False, False, False, '瀬田', 1, 'G211', '', '', '', '', '【オープン登録科目】
2-1 英語必修
2019年度～
【対象】Y:応用化学課程・知能情報メディア課程・環境生態工学課程', '', '2025-05-19T02:21:09.164879', NULL),
    ('G250200172', 4, '', '前期', False, True, True, True, False, False, False, False, False, '瀬田', 1, 'G201', '', '', '', '', '【オープン登録科目】
2-1 英語必修
2019年度～
【対象】Y:数理情報科学課程・電子情報通信課程・機械工学ロボティクス課程', '', '2025-05-19T02:21:09.186994', NULL),
    ('G250200173', 4, '', '前期', False, True, True, True, False, False, False, False, False, '瀬田', 1, 'G202', '', '', '', '', '【オープン登録科目】
2-1 英語必修
2019年度～
【対象】Y:数理情報科学課程・電子情報通信課程・機械工学ロボティクス課程', '', '2025-05-19T02:21:09.209781', NULL),
    ('G250200174', 4, '', '前期', False, True, True, True, False, False, False, False, False, '瀬田', 1, 'G203', '', '', '', '', '【オープン登録科目】
2-1 英語必修
2019年度～
【対象】Y:数理情報科学課程・電子情報通信課程・機械工学ロボティクス課程', '', '2025-05-19T02:21:09.232961', NULL),
    ('G250200175', 4, '', '前期', False, True, True, True, False, False, False, False, False, '瀬田', 1, 'G204', '', '', '', '', '【オープン登録科目】
2-1 英語必修
2019年度～
【対象】Y:数理情報科学課程・電子情報通信課程・機械工学ロボティクス課程', '', '2025-05-19T02:21:09.255145', NULL),
    ('G250200176', 4, '', '前期', False, True, True, True, False, False, False, False, False, '瀬田', 1, 'G205', '', '', '', '', '【オープン登録科目】
2-1 英語必修
2019年度～
【対象】Y:数理情報科学課程・電子情報通信課程・機械工学ロボティクス課程', '', '2025-05-19T02:21:09.277196', NULL),
    ('G250200177', 4, '', '前期', False, True, True, True, False, False, False, False, False, '瀬田', 1, 'G206', '', '', '', '', '【オープン登録科目】
2-1 英語必修
2019年度～
【対象】Y:数理情報科学課程・電子情報通信課程・機械工学ロボティクス課程', '', '2025-05-19T02:21:09.316880', NULL),
    ('G250200178', 4, '', '前期', False, True, True, True, False, False, False, False, False, '瀬田', 1, 'G207', '', '', '', '', '【オープン登録科目】
2-1 英語必修
2019年度～
【対象】Y:数理情報科学課程・電子情報通信課程・機械工学ロボティクス課程', '', '2025-05-19T02:21:09.340603', NULL),
    ('G250200179', 4, '', '前期', False, True, True, True, False, False, False, False, False, '瀬田', 1, 'G208', '', '', '', '', '【オープン登録科目】
2-1 英語必修
2019年度～
【対象】Y:数理情報科学課程・電子情報通信課程・機械工学ロボティクス課程', '', '2025-05-19T02:21:09.361600', NULL),
    ('G250200180', 4, '', '前期', False, True, True, True, False, False, False, False, False, '瀬田', 1, 'G209', '', '', '', '', '【オープン登録科目】
2-1 英語必修
2019年度～
【対象】Y:数理情報科学課程・電子情報通信課程・機械工学ロボティクス課程', '', '2025-05-19T02:21:09.382470', NULL),
    ('G250200181', 4, '', '前期', False, True, True, True, False, False, False, False, False, '瀬田', 1, 'G210', '', '', '', '', '【オープン登録科目】
2-1 英語必修
2019年度～
【対象】Y:数理情報科学課程・電子情報通信課程・機械工学ロボティクス課程', '', '2025-05-19T02:21:09.399897', NULL),
    ('G250200182', 4, '', '前期', False, True, True, True, False, False, False, False, False, '瀬田', 1, 'G211', '', '', '', '', '【オープン登録科目】
2-1 英語必修
2019年度～
【対象】Y:数理情報科学課程・電子情報通信課程・機械工学ロボティクス課程', '', '2025-05-19T02:21:09.420926', NULL),
    ('G250200191', 4, '', '後期', False, True, True, True, False, False, False, False, False, '瀬田', 1, 'G251', '', '', '', '', '【オープン登録科目】
2-1 英語必修
2019年度～
【対象】Y:応用化学課程・知能情報メディア課程・環境生態工学課程', '', '2025-05-19T02:21:09.440350', NULL),
    ('G250200192', 4, '', '後期', False, True, True, True, False, False, False, False, False, '瀬田', 1, 'G252', '', '', '', '', '【オープン登録科目】
2-1 英語必修
2019年度～
【対象】Y:応用化学課程・知能情報メディア課程・環境生態工学課程', '', '2025-05-19T02:21:09.461849', NULL),
    ('G250200193', 4, '', '後期', False, True, True, True, False, False, False, False, False, '瀬田', 1, 'G253', '', '', '', '', '【オープン登録科目】
2-1 英語必修
2019年度～
【対象】Y:応用化学課程・知能情報メディア課程・環境生態工学課程', '', '2025-05-19T02:21:09.483359', NULL),
    ('G250200194', 4, '', '後期', False, True, True, True, False, False, False, False, False, '瀬田', 1, 'G254', '', '', '', '', '【オープン登録科目】
2-1 英語必修
2019年度～
【対象】Y:応用化学課程・知能情報メディア課程・環境生態工学課程', '', '2025-05-19T02:21:09.503181', NULL),
    ('G250200195', 4, '', '後期', False, True, True, True, False, False, False, False, False, '瀬田', 1, 'G255', '', '', '', '', '【オープン登録科目】
2-1 英語必修
2019年度～
【対象】Y:応用化学課程・知能情報メディア課程・環境生態工学課程', '', '2025-05-19T02:21:09.524186', NULL),
    ('G250200196', 4, 'Reading focus continued', '後期', False, True, True, True, False, False, False, False, False, '瀬田', 1, 'G256', '', '', '', '', '【オープン登録科目】
2-1 英語必修
2019年度～
【対象】Y:応用化学課程・知能情報メディア課程・環境生態工学課程', '', '2025-05-19T02:21:09.546678', NULL),
    ('G250200197', 4, '', '後期', False, True, True, True, False, False, False, False, False, '瀬田', 1, 'G257', '', '', '', '', '【オープン登録科目】
2-1 英語必修
2019年度～
【対象】Y:応用化学課程・知能情報メディア課程・環境生態工学課程', '', '2025-05-19T02:21:09.568562', NULL),
    ('G250200198', 4, '', '後期', False, True, True, True, False, False, False, False, False, '瀬田', 1, 'G258', '', '', '', '', '【オープン登録科目】
2-1 英語必修
2019年度～
【対象】Y:応用化学課程・知能情報メディア課程・環境生態工学課程', '', '2025-05-19T02:21:09.590168', NULL),
    ('G250200199', 4, '', '後期', False, True, True, True, False, False, False, False, False, '瀬田', 1, 'G259', '', '', '', '', '【オープン登録科目】
2-1 英語必修
2019年度～
【対象】Y:応用化学課程・知能情報メディア課程・環境生態工学課程', '', '2025-05-19T02:21:09.611371', NULL),
    ('G250200200', 4, '', '後期', False, True, True, True, False, False, False, False, False, '瀬田', 1, 'G260', '', '', '', '', '【オープン登録科目】
2-1 英語必修
2019年度～
【対象】Y:応用化学課程・知能情報メディア課程・環境生態工学課程', '', '2025-05-19T02:21:09.638379', NULL),
    ('G250200201', 4, '', '後期', False, True, True, True, False, False, False, False, False, '瀬田', 1, 'G261', '', '', '', '', '【オープン登録科目】
2-1 英語必修
2019年度～
【対象】Y:応用化学課程・知能情報メディア課程・環境生態工学課程', '', '2025-05-19T02:21:09.669390', NULL),
    ('G250200210', 4, '', '後期', False, True, True, True, False, False, False, False, False, '瀬田', 1, 'G251', '', '', '', '', '【オープン登録科目】
2-1 英語必修
2019年度～
【対象】Y:数理情報科学課程・電子情報通信課程・機械工学ロボティクス課程', '', '2025-05-19T02:21:09.702906', NULL),
    ('G250200211', 4, '', '後期', False, True, True, True, False, False, False, False, False, '瀬田', 1, 'G252', '', '', '', '', '【オープン登録科目】
2-1 英語必修
2019年度～
【対象】Y:数理情報科学課程・電子情報通信課程・機械工学ロボティクス課程', '', '2025-05-19T02:21:09.724184', NULL),
    ('G250200212', 4, '', '後期', False, True, True, True, False, False, False, False, False, '瀬田', 1, 'G253', '', '', '', '', '【オープン登録科目】
2-1 英語必修
2019年度～
【対象】Y:数理情報科学課程・電子情報通信課程・機械工学ロボティクス課程', '', '2025-05-19T02:21:09.746331', NULL),
    ('G250200213', 4, '', '後期', False, True, True, True, False, False, False, False, False, '瀬田', 1, 'G254', '', '', '', '', '【オープン登録科目】
2-1 英語必修
2019年度～
【対象】Y:数理情報科学課程・電子情報通信課程・機械工学ロボティクス課程', '', '2025-05-19T02:21:09.767959', NULL),
    ('G250200214', 4, '', '後期', False, True, True, True, False, False, False, False, False, '瀬田', 1, 'G255', '', '', '', '', '【オープン登録科目】
2-1 英語必修
2019年度～
【対象】Y:数理情報科学課程・電子情報通信課程・機械工学ロボティクス課程', '', '2025-05-19T02:21:09.788467', NULL),
    ('G250200215', 4, '', '後期', False, True, True, True, False, False, False, False, False, '瀬田', 1, 'G256', '', '', '', '', '【オープン登録科目】
2-1 英語必修
2019年度～
【対象】Y:数理情報科学課程・電子情報通信課程・機械工学ロボティクス課程', '', '2025-05-19T02:21:09.814039', NULL),
    ('G250200216', 4, '', '後期', False, True, True, True, False, False, False, False, False, '瀬田', 1, 'G257', '', '', '', '', '【オープン登録科目】
2-1 英語必修
2019年度～
【対象】Y:数理情報科学課程・電子情報通信課程・機械工学ロボティクス課程', '', '2025-05-19T02:21:09.834930', NULL),
    ('G250200217', 4, '', '後期', False, True, True, True, False, False, False, False, False, '瀬田', 1, 'G258', '', '', '', '', '【オープン登録科目】
2-1 英語必修
2019年度～
【対象】Y:数理情報科学課程・電子情報通信課程・機械工学ロボティクス課程', '', '2025-05-19T02:21:09.862021', NULL),
    ('G250200218', 4, '', '後期', False, True, True, True, False, False, False, False, False, '瀬田', 1, 'G259', '', '', '', '', '【オープン登録科目】
2-1 英語必修
2019年度～
【対象】Y:数理情報科学課程・電子情報通信課程・機械工学ロボティクス課程', '', '2025-05-19T02:21:09.883252', NULL),
    ('G250200219', 4, '', '後期', False, True, True, True, False, False, False, False, False, '瀬田', 1, 'G260', '', '', '', '', '【オープン登録科目】
2-1 英語必修
2019年度～
【対象】Y:数理情報科学課程・電子情報通信課程・機械工学ロボティクス課程', '', '2025-05-19T02:21:09.899173', NULL),
    ('G250200220', 4, '', '後期', False, True, True, True, False, False, False, False, False, '瀬田', 1, 'G261', '', '', '', '', '【オープン登録科目】
2-1 英語必修
2019年度～
【対象】Y:数理情報科学課程・電子情報通信課程・機械工学ロボティクス課程', '', '2025-05-19T02:21:09.920760', NULL),
    ('G250200229', 4, '', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G209', '', '', '', '', '【抽選登録科目】
2-2 英語必修（再）
2019年度～', '', '2025-05-19T02:21:09.942577', NULL),
    ('G250200231', 4, '', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G201', '', '', '', '', '【抽選登録科目】
2-2 英語必修（再）
2019年度～', '', '2025-05-19T02:21:09.965153', NULL),
    ('G250200233', 4, '', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G203', '', '', '', '', '【抽選登録科目】
2-2 英語必修（再）
2019年度～', '', '2025-05-19T02:21:09.986584', NULL),
    ('G250200235', 4, '', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G205', '', '', '', '', '【抽選登録科目】
2-2 英語必修（再）
2019年度～', '', '2025-05-19T02:21:10.006613', NULL),
    ('G250200239', 4, '', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G201', '', '', '', '', '【抽選登録科目】
2-2 英語必修（再）
2019年度～', '', '2025-05-19T02:21:10.028412', NULL),
    ('G250200241', 4, '', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G203', '', '', '', '', '【抽選登録科目】
2-2 英語必修（再）
2019年度～', '', '2025-05-19T02:21:10.049605', NULL),
    ('G250200243', 4, '', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G205', '', '', '', '', '【抽選登録科目】
2-2 英語必修（再）
2019年度～', '', '2025-05-19T02:21:10.088207', NULL),
    ('G250200247', 4, '', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G209', '', '', '', '', '【抽選登録科目】
2-2 英語必修（再）
2019年度～', '', '2025-05-19T02:21:10.109894', NULL),
    ('G250200249', 4, '', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G259', '', '', '', '', '【抽選登録科目】
2-2 英語必修（再）
2019年度～', '', '2025-05-19T02:21:10.129607', NULL),
    ('G250200251', 4, '', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G251', '', '', '', '', '【抽選登録科目】
2-2 英語必修（再）
2019年度～', '', '2025-05-19T02:21:10.150605', NULL),
    ('G250200253', 4, '', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G253', '', '', '', '', '【抽選登録科目】
2-2 英語必修（再）
2019年度～', '', '2025-05-19T02:21:10.172947', NULL),
    ('G250200255', 4, '', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G255', '', '', '', '', '【抽選登録科目】
2-2 英語必修（再）
2019年度～', '', '2025-05-19T02:21:10.192205', NULL),
    ('G250200259', 4, '', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G251', '', '', '', '', '【抽選登録科目】
2-2 英語必修（再）
2019年度～', '', '2025-05-19T02:21:10.211055', NULL),
    ('G250200261', 4, '', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G253', '', '', '', '', '【抽選登録科目】
2-2 英語必修（再）
2019年度～', '', '2025-05-19T02:21:10.234371', NULL),
    ('G250200263', 4, '', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G255', '', '', '', '', '【抽選登録科目】
2-2 英語必修（再）
2019年度～', '', '2025-05-19T02:21:10.253900', NULL),
    ('G250200267', 4, '', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G259', '', '', '', '', '【抽選登録科目】
2-2 英語必修（再）
2019年度～', '', '2025-05-19T02:21:10.276174', NULL),
    ('G250500001', 4, 'TOEFLを学ぼう', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 2, 'G502', '', '', '', '', '【抽選登録科目】
2-3 英語選択
2022年度～
Y:2022～
N:2022～', '', '2025-05-19T02:21:10.297596', NULL),
    ('G250500004', 4, 'TOEFLを学ぼう', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 2, 'G552', '', '', '', '', '【抽選登録科目】
2-3 英語選択
2022年度～
Y:2022～
N:2022～', '', '2025-05-19T02:21:10.313930', NULL),
    ('G250500007', 4, 'TOEIC 演習', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 2, 'G502', '', '', '', '', '【抽選登録科目】
2-3 英語選択', '', '2025-05-19T02:21:10.338931', NULL),
    ('G250500010', 4, 'TOEIC 演習', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 2, 'G502', '', '', '', '', '【抽選登録科目】
2-3 英語選択', '', '2025-05-19T02:21:10.361426', NULL),
    ('G250500013', 4, '', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 2, 'G504', '', '', '', '', '【抽選登録科目】
2-3 英語選択', '', '2025-05-19T02:21:10.382679', NULL),
    ('G250500016', 4, '', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 2, 'G502', '', '', '', '', '【抽選登録科目】
2-3 英語選択', '', '2025-05-19T02:21:10.404564', NULL),
    ('G250500019', 4, 'TOEIC 演習', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 2, 'G552', '', '', '', '', '【抽選登録科目】
2-3 英語選択', '', '2025-05-19T02:21:10.441955', NULL),
    ('G250500022', 4, 'TOEIC 演習', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 2, 'G552', '', '', '', '', '【抽選登録科目】
2-3 英語選択', '', '2025-05-19T02:21:10.464967', NULL),
    ('G250500025', 4, '', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 2, 'G554', '', '', '', '', '【抽選登録科目】
2-3 英語選択', '', '2025-05-19T02:21:10.489329', NULL),
    ('G250500028', 4, '', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 2, 'G552', '', '', '', '', '【抽選登録科目】
2-3 英語選択', '', '2025-05-19T02:21:10.513800', NULL),
    ('G250500031', 4, '', '前期', False, True, True, True, False, False, False, False, False, '瀬田', 2, 'G501', '', '', '', '', '【抽選登録科目】
2-3 英語選択', '', '2025-05-19T02:21:10.534649', NULL),
    ('G250500032', 4, '', '後期', False, True, True, True, False, False, False, False, False, '瀬田', 2, 'G551', '', '', '', '', '【抽選登録科目】
2-3 英語選択', '', '2025-05-19T02:21:10.556938', NULL),
    ('G250500033', 4, 'Contemporary Cummunication Seminar', '前期', False, True, True, True, False, False, False, False, False, '瀬田', 2, 'G501', '', '', '', '', '【抽選登録科目】
2-3 英語選択', '', '2025-05-19T02:21:10.577281', NULL),
    ('G250500034', 4, 'Contemporary Cummunication Seminar', '後期', False, True, True, True, False, False, False, False, False, '瀬田', 2, 'G551', '', '', '', '', '【抽選登録科目】
2-3 英語選択', '', '2025-05-19T02:21:10.597284', NULL),
    ('G250500035', 4, '小説Draculaを英語で読もう', '前期', False, True, True, True, False, False, False, False, False, '瀬田', 2, 'G502', '', '', '', '', '【抽選登録科目】
2-3 英語選択', '', '2025-05-19T02:21:10.618494', NULL),
    ('G250500036', 4, '英語で『ねじの回転』を読もう', '後期', False, True, True, True, False, False, False, False, False, '瀬田', 2, 'G552', '', '', '', '', '【抽選登録科目】
2-3 英語選択', '', '2025-05-19T02:21:10.636486', NULL),
    ('G250500037', 4, '英語らしい音と表現を身につける', '前期', False, True, True, True, False, False, False, False, False, '瀬田', 2, 'G501', '', '', '', '', '【抽選登録科目】
2-3 英語選択', '', '2025-05-19T02:21:10.660499', NULL),
    ('G250500038', 4, '英語らしい音と表現を身につける', '後期', False, True, True, True, False, False, False, False, False, '瀬田', 2, 'G551', '', '', '', '', '【抽選登録科目】
2-3 英語選択', '', '2025-05-19T02:21:10.679995', NULL),
    ('G250500039', 4, '', '前期', False, True, True, True, False, False, False, False, False, '瀬田', 2, 'G503', '', '', '', '', '【抽選登録科目】
2-3 英語選択', '', '2025-05-19T02:21:10.702006', NULL),
    ('G250500040', 4, '', '後期', False, True, True, True, False, False, False, False, False, '瀬田', 2, 'G553', '', '', '', '', '【抽選登録科目】
2-3 英語選択', '', '2025-05-19T02:21:10.723083', NULL),
    ('G250500041', 2, '自然豊かな環境のシドニーで英語を学ぶ', '前期', True, True, False, False, False, False, False, False, False, '深草', 2, 'G531', '', '', '', '', '【オープン登録科目】
2-3 英語選択
履修登録不要（研修説明会の出席要）', '', '2025-05-19T02:21:10.738768', NULL),
    ('G250500042', 2, '自然豊かな環境のシドニーで英語を学ぶ', '後期', True, True, False, False, False, False, False, False, False, '深草', 2, 'G581', '', '', '', '', '【オープン登録科目】
2-3 英語選択
英語：履修登録不要（研修説明会の出席要）', '', '2025-05-19T02:21:10.754363', NULL),
    ('G250510001', 4, 'ウェブサイトやテキストや映像を使って多角的に学習するドイツ語', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G511', '', '', '', '', '【抽選登録科目】
3-4 外国語選択
2015年度～', '', '2025-05-19T02:21:10.777438', NULL),
    ('G250510002', 4, 'ウェブサイトやテキストや映像を使って多角的に学習するドイツ語', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G511', '', '', '', '', '【抽選登録科目】
3-4 外国語選択
2015年度～', '', '2025-05-19T02:21:10.797444', NULL),
    ('G250510003', 4, 'ドイツ語への架け橋', '前期', False, True, True, True, False, False, False, False, False, '瀬田', 2, 'G511', '', '', '', '', '【抽選登録科目】
3-4 外国語選択
2019年度～
ドイツ語（ＩＡ・ⅠＢ）のうちいずれか１単位を修得していること', '', '2025-05-19T02:21:10.833254', NULL),
    ('G250510004', 4, 'ドイツ語への架け橋', '前期', False, True, True, True, False, False, False, False, False, '瀬田', 2, 'G512', '', '', '', '', '【抽選登録科目】
3-4 外国語選択
～2018年度
ドイツ語（ＩＡ・ⅡＡ・ⅠＢ・ⅡＢ）のうちいずれか１単位を修得していること', '', '2025-05-19T02:21:10.857055', NULL),
    ('G250510005', 4, 'ドイツ語中級への架け橋', '後期', False, True, True, True, False, False, False, False, False, '瀬田', 2, 'G561', '', '', '', '', '【抽選登録科目】
3-4 外国語選択
2019年度～
ドイツ語（ＩＡ・ⅠＢ）のうちいずれか１単位を修得していること', '', '2025-05-19T02:21:10.877332', NULL),
    ('G250510006', 4, 'ドイツ語中級への架け橋', '後期', False, True, True, True, False, False, False, False, False, '瀬田', 2, 'G562', '', '', '', '', '【抽選登録科目】
3-4 外国語選択
～2018年度
ドイツ語（ＩＡ・ⅡＡ・ⅠＢ・ⅡＢ）のうちいずれか１単位を修得していること', '', '2025-05-19T02:21:10.899565', NULL),
    ('G250510007', 4, '', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G512', '', '', '', '', '【抽選登録科目】
3-4 外国語選択', '', '2025-05-19T02:21:10.918828', NULL),
    ('G250510008', 4, '', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G512', '', '', '', '', '【抽選登録科目】
3-4 外国語選択', '', '2025-05-19T02:21:10.938382', NULL),
    ('G250510009', 4, '', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G562', '', '', '', '', '【抽選登録科目】
3-4 外国語選択
2015年度～', '', '2025-05-19T02:21:10.959329', NULL),
    ('G250510010', 4, '', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G562', '', '', '', '', '【抽選登録科目】
3-4 外国語選択
2015年度～', '', '2025-05-19T02:21:10.981208', NULL),
    ('G250510011', 4, 'ウェブサイトやテキストや映像を使って多角的に学習するドイツ語', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G566', '', '', '', '', '【抽選登録科目】
3-4 外国語選択
2015年度～', '', '2025-05-19T02:21:10.999946', NULL),
    ('G250510012', 4, 'ウェブサイトやテキストや映像を使って多角的に学習するドイツ語', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G567', '', '', '', '', '【抽選登録科目】
3-4 外国語選択
2015年度～', '', '2025-05-19T02:21:11.023969', NULL),
    ('G250520001', 4, 'フランス語初級会話', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G512', '', '', '', '', '【抽選登録科目】
3-4 外国語選択
2015年度～', '', '2025-05-19T02:21:11.044146', NULL),
    ('G250520002', 4, '', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G512', '', '', '', '', '【抽選登録科目】
3-4 外国語選択
2015年度～', '', '2025-05-19T02:21:11.065506', NULL),
    ('G250520003', 4, 'フランス語初級会話', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G561', '', '', '', '', '【抽選登録科目】
3-4 外国語選択
2015年度～', '', '2025-05-19T02:21:11.085996', NULL),
    ('G250520004', 4, '', '前期', False, True, True, True, False, False, False, False, False, '瀬田', 2, 'G511', '', '', '', '', '【抽選登録科目】
3-4 外国語選択
2019年度～
フランス語（ＩＡ・ⅠＢ）のうちいずれか１単位を修得していること', '', '2025-05-19T02:21:11.107479', NULL),
    ('G250520005', 4, '', '前期', False, True, True, True, False, False, False, False, False, '瀬田', 2, 'G512', '', '', '', '', '【抽選登録科目】
3-4 外国語選択
～2018年度
フランス語（ＩＡ・ⅡＡ・ⅠＢ・ⅡＢ）のうちいずれか１単位を修得していること', '', '2025-05-19T02:21:11.129159', NULL),
    ('G250520006', 4, '', '後期', False, True, True, True, False, False, False, False, False, '瀬田', 2, 'G561', '', '', '', '', '【抽選登録科目】
3-4 外国語選択
2019年度～
フランス語（ＩＡ・ⅠＢ）のうちいずれか１単位を修得していること', '', '2025-05-19T02:21:11.152156', NULL),
    ('G250520007', 4, '', '後期', False, True, True, True, False, False, False, False, False, '瀬田', 2, 'G562', '', '', '', '', '【抽選登録科目】
3-4 外国語選択
～2018年度
フランス語（ＩＡ・ⅡＡ・ⅠＢ・ⅡＢ）のうちいずれか１単位を修得していること', '', '2025-05-19T02:21:11.187674', NULL),
    ('G250520008', 4, '', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G519', '', '', '', '', '【抽選登録科目】
3-4 外国語選択', '', '2025-05-19T02:21:11.207686', NULL),
    ('G250520009', 4, 'すぐに使えるフランス語', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G518', '', '', '', '', '【抽選登録科目】
3-4 外国語選択', '', '2025-05-19T02:21:11.228683', NULL),
    ('G250520010', 4, 'すぐに使えるフランス語', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G567', '', '', '', '', '【抽選登録科目】
3-4 外国語選択', '', '2025-05-19T02:21:11.250680', NULL),
    ('G250520011', 4, '', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G568', '', '', '', '', '【抽選登録科目】
3-4 外国語選択
2015年度～', '', '2025-05-19T02:21:11.277026', NULL),
    ('G250520012', 4, '', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G568', '', '', '', '', '【抽選登録科目】
3-4 外国語選択
2015年度～', '', '2025-05-19T02:21:11.298820', NULL),
    ('G250530001', 4, '諺から学ぶ中国語', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G511', '', '', '', '', '【抽選登録科目】
3-4 外国語選択
2015年度～', '', '2025-05-19T02:21:11.321453', NULL),
    ('G250530002', 4, '諺から学ぶ中国語', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G511', '', '', '', '', '【抽選登録科目】
3-4 外国語選択
2015年度～', '', '2025-05-19T02:21:11.342451', NULL),
    ('G250530003', 4, '', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G561', '', '', '', '', '【抽選登録科目】
3-4 外国語選択
2015年度～', '', '2025-05-19T02:21:11.362770', NULL),
    ('G250530004', 4, '', '前期', False, True, True, True, False, False, False, False, False, '瀬田', 2, 'G513', '', '', '', '', '【抽選登録科目】
3-4 外国語選択
2019年度～
中国語（ＩＡ・ⅠＢ）のうちいずれか１単位を修得していること', '', '2025-05-19T02:21:11.385497', NULL),
    ('G250530006', 4, '', '後期', False, True, True, True, False, False, False, False, False, '瀬田', 2, 'G563', '', '', '', '', '【抽選登録科目】
3-4 外国語選択
2019年度～
中国語（ＩＡ・ⅠＢ）のうちいずれか１単位を修得していること', '', '2025-05-19T02:21:11.406504', NULL),
    ('G250530008', 4, '', '後期', False, True, True, True, False, False, False, False, False, '瀬田', 2, 'G561', '', '', '', '', '【抽選登録科目】
3-4 外国語選択
2019年度～
中国語（ＩＡ・ⅠＢ）のうちいずれか１単位を修得していること', '', '2025-05-19T02:21:11.427808', NULL),
    ('G250530010', 4, '', '前期', False, True, True, True, False, False, False, False, False, '瀬田', 2, 'G511', '', '', '', '', '【抽選登録科目】
3-4 外国語選択
2019年度～
中国語（ＩＡ・ⅠＢ）のうちいずれか１単位を修得していること', '', '2025-05-19T02:21:11.449609', NULL),
    ('G250530012', 4, '', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G515', '', '', '', '', '【抽選登録科目】
3-4 外国語選択', '', '2025-05-19T02:21:11.469434', NULL),
    ('G250530013', 4, '楽しく学ぶ中国語', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G516', '', '', '', '', '【抽選登録科目】
3-4 外国語選択', '', '2025-05-19T02:21:11.490805', NULL),
    ('G250530014', 4, '', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G515', '', '', '', '', '【抽選登録科目】
3-4 外国語選択', '', '2025-05-19T02:21:11.510813', NULL),
    ('G250530015', 4, '', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G516', '', '', '', '', '【抽選登録科目】
3-4 外国語選択', '', '2025-05-19T02:21:11.529990', NULL),
    ('G250530016', 4, '楽しく学ぶ中国語', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G564', '', '', '', '', '【抽選登録科目】
3-4 外国語選択', '', '2025-05-19T02:21:11.569806', NULL),
    ('G250530018', 4, '楽しく学ぶ中国語', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G517', '', '', '', '', '【抽選登録科目】
3-4 外国語選択
2015年度～', '', '2025-05-19T02:21:11.590754', NULL),
    ('G250530019', 4, '', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G564', '', '', '', '', '【抽選登録科目】
3-4 外国語選択
2015年度～', '', '2025-05-19T02:21:11.611173', NULL),
    ('G250530020', 4, '', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G565', '', '', '', '', '【抽選登録科目】
3-4 外国語選択
2015年度～', '', '2025-05-19T02:21:11.630894', NULL),
    ('G250530021', 4, '', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G565', '', '', '', '', '【抽選登録科目】
3-4 外国語選択
2015年度～', '', '2025-05-19T02:21:11.651061', NULL),
    ('G250530022', 4, '', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G566', '', '', '', '', '【抽選登録科目】
3-4 外国語選択
2015年度～', '', '2025-05-19T02:21:11.675071', NULL),
    ('G250530023', 4, '諺から学ぶ中国語', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G561', '', '', '', '', '【抽選登録科目】
3-4 外国語選択
2015年度～', '', '2025-05-19T02:21:11.697834', NULL),
    ('G250530024', 4, '諺から学ぶ中国語', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G561', '', '', '', '', '【抽選登録科目】
3-4 外国語選択
2015年度～', '', '2025-05-19T02:21:11.725980', NULL),
    ('G250530025', 4, '', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G518', '', '', '', '', '【抽選登録科目】
3-4 外国語選択
2015年度～', '', '2025-05-19T02:21:11.753683', NULL),
    ('G250550001', 4, '', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G562', '', '', '', '', '【抽選登録科目】
3-4 外国語選択
2015年度～', '', '2025-05-19T02:21:11.775977', NULL),
    ('G250550002', 4, '', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G562', '', '', '', '', '【抽選登録科目】
3-4 外国語選択
2015年度～', '', '2025-05-19T02:21:11.796500', NULL),
    ('G250550003', 4, '', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G513', '', '', '', '', '【抽選登録科目】
3-4 外国語選択
2015年度～', '', '2025-05-19T02:21:11.815022', NULL),
    ('G250550004', 4, 'コリア語ⅠB', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G514', '', '', '', '', '【抽選登録科目】
3-4 外国語選択', '', '2025-05-19T02:21:11.830978', NULL),
    ('G250550005', 4, 'コリア語ⅠB', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G563', '', '', '', '', '【抽選登録科目】
3-4 外国語選択', '', '2025-05-19T02:21:11.849051', NULL),
    ('G250550006', 4, '', '前期', False, True, True, True, False, False, False, False, False, '瀬田', 2, 'G515', '', '', '', '', '【抽選登録科目】
3-4 外国語選択
2019年度～
コリア語（ＩＡ・ⅠＢ）のうちいずれか１単位を修得していること', '', '2025-05-19T02:21:11.866359', NULL),
    ('G250550007', 4, '', '前期', False, True, True, True, False, False, False, False, False, '瀬田', 2, 'G516', '', '', '', '', '【抽選登録科目】
3-4 外国語選択
～2018年度
コリア語（ＩＡ・ⅡＡ・ⅠＢ・ⅡＢ）のうちいずれか１単位を修得していること', '', '2025-05-19T02:21:11.884869', NULL),
    ('G250550008', 4, '', '後期', False, True, True, True, False, False, False, False, False, '瀬田', 2, 'G565', '', '', '', '', '【抽選登録科目】
3-4 外国語選択
2019年度～
コリア語（ＩＡ・ⅠＢ）のうちいずれか１単位を修得していること', '', '2025-05-19T02:21:11.899870', NULL),
    ('G250550009', 4, '', '後期', False, True, True, True, False, False, False, False, False, '瀬田', 2, 'G566', '', '', '', '', '【抽選登録科目】
3-4 外国語選択
～2018年度
コリア語（ＩＡ・ⅡＡ・ⅠＢ・ⅡＢ）のうちいずれか１単位を修得していること', '', '2025-05-19T02:21:11.917879', NULL),
    ('G250550010', 4, '', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G513', '', '', '', '', '【抽選登録科目】
3-4 外国語選択', '', '2025-05-19T02:21:11.934855', NULL),
    ('G250550011', 4, 'コリア語ⅠA', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G514', '', '', '', '', '【抽選登録科目】
3-4 外国語選択', '', '2025-05-19T02:21:11.971970', NULL),
    ('G250550012', 4, 'コリア語ⅠA', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G563', '', '', '', '', '【抽選登録科目】
3-4 外国語選択', '', '2025-05-19T02:21:11.991818', NULL),
    ('G250610001', 4, '医療における自己決定の尊重はどこまで可能か', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 2, 'G601', '', '', '', '', '【抽選登録科目】
5 人文科学系
Y:ALL
T:2015～
N:2019～', '', '2025-05-19T02:21:12.016915', NULL),
    ('G250610003', 4, '環境資源の分配から考える未来世代への責任', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 2, 'G651', '', '', '', '', '【抽選登録科目】
5 人文科学系
Y:ALL
T:2015～
N:2019～', '', '2025-05-19T02:21:12.041779', NULL),
    ('G250610005', 4, '論理的・批判的な思考法', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 2, 'G601', '', '', '', '', '【抽選登録科目】
5 人文科学系
Y:ALL
T:2015～
N:2019～', '', '2025-05-19T02:21:12.061270', NULL),
    ('G250610006', 4, '論理的・批判的な思考法', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 2, 'G651', '', '', '', '', '【抽選登録科目】
5 人文科学系
Y:ALL
T:2015～
N:2019～', '', '2025-05-19T02:21:12.083926', NULL),
    ('G250610007', 4, '現代人は何を宗教に求めているのか', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 2, 'G601', '', '', '', '', '【抽選登録科目】
5 人文科学系
Y:ALL
T:2015～
N:2019～', '', '2025-05-19T02:21:12.104776', NULL),
    ('G250610008', 4, '現代人は何を宗教に求めているのか', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 2, 'G651', '', '', '', '', '【抽選登録科目】
5 人文科学系
Y:ALL
T:2015～
N:2019～', '', '2025-05-19T02:21:12.134335', NULL),
    ('G250610010', 4, '宗教の必要性と問題点について考察する', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 2, 'G601', '', '', '', '', '【抽選登録科目】
5 人文科学系
Y:ALL
T:2015～
N:2019～', '', '2025-05-19T02:21:12.159660', NULL),
    ('G250610012', 4, '宗教の必要性と問題点について考察する', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 2, 'G651', '', '', '', '', '【抽選登録科目】
5 人文科学系
Y:ALL
T:2015～
N:2019～', '', '2025-05-19T02:21:12.178173', NULL),
    ('G250610013', 4, '「文学」の役割と旅／旅行を描く小説', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 2, 'G602', '', '', '', '', '【抽選登録科目】
5 人文科学系
Y:ALL
T:2015～
N:2019～', '', '2025-05-19T02:21:12.200450', NULL),
    ('G250610015', 4, '小説の読み方・考え方と現代社会', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 2, 'G651', '', '', '', '', '【抽選登録科目】
5 人文科学系
Y:ALL
T:2015～
N:2019～', '', '2025-05-19T02:21:12.224147', NULL),
    ('G250610016', 4, '文学でフランスを旅してみよう', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 2, 'G601', '', '', '', '', '【抽選登録科目】
【基礎教養】ベーシック教養科目群
5 人文科学系
Y:ALL
T:2015～
N:2019～', '', '2025-05-19T02:21:12.247122', NULL),
    ('G250610020', 4, '文学でめぐるヨーロッパ', '後期', False, True, True, True, False, False, False, False, False, '瀬田', 2, 'G651', '', '', '', '', '【抽選登録科目】
【基礎教養】ベーシック教養科目群
5 人文科学系
Y:ALL
T:2015～
N:2019～', '', '2025-05-19T02:21:12.268331', NULL),
    ('G250610021', 4, '文学でめぐるヨーロッパ', '後期', False, True, True, True, False, False, False, False, False, '瀬田', 2, 'G652', '', '', '', '', '【抽選登録科目】
5 人文科学系
T:～2014
N:2016～2018', '', '2025-05-19T02:21:12.286874', NULL),
    ('G250610022', 4, '日本史の見方と見え方', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 2, 'G602', '', '', '', '', '【抽選登録科目】
5 人文科学系
Y:ALL
T:2015～
N:2019～', '', '2025-05-19T02:21:12.305110', NULL),
    ('G250610024', 4, '日本の歴史と神仏', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 2, 'G651', '', '', '', '', '【抽選登録科目】
5 人文科学系
Y:ALL
T:2015～
N:2019～', '', '2025-05-19T02:21:12.325625', NULL),
    ('G250610025', 4, '中央ユーラシアの歴史と文化', '前期', True, True, True, True, False, False, False, False, False, 'オンライン', 2, 'G602', '', '', '', '', '【抽選登録科目】
5 人文科学系
Y:ALL
T:2015～
N:2019～', '', '2025-05-19T02:21:12.361884', NULL),
    ('G250610027', 4, 'イスラームと西アジアの歴史', '後期', True, True, True, True, False, False, False, False, False, 'オンライン', 2, 'G651', '', '', '', '', '【抽選登録科目】
5 人文科学系
Y:ALL
T:2015～
N:2019～', '', '2025-05-19T02:21:12.383904', NULL),
    ('G250610028', 4, '西洋史入門', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 2, 'G604', '', '', '', '', '【抽選登録科目】
5 人文科学系
Y:ALL
T:2015～
N:2019～', '', '2025-05-19T02:21:12.405237', NULL),
    ('G250610030', 4, '西洋の歴史（近世～現代）', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 2, 'G652', '', '', '', '', '【抽選登録科目】
5 人文科学系
Y:ALL
T:2015～
N:2019～', '', '2025-05-19T02:21:12.425637', NULL),
    ('G250610031', 4, '', '前期', False, True, True, True, False, False, False, False, False, '瀬田', 2, 'G601', '', '', '', '', '【抽選登録科目】
5 人文科学系
Y:ALL
T:2015～
N:2019～', '', '2025-05-19T02:21:12.446890', NULL),
    ('G250610033', 4, '', '後期', False, True, True, True, False, False, False, False, False, '瀬田', 2, 'G651', '', '', '', '', '【抽選登録科目】
5 人文科学系
Y:ALL
T:2015～
N:2019～', '', '2025-05-19T02:21:12.467284', NULL),
    ('G250610035', 4, '', '前期', False, True, True, True, False, False, False, False, False, '瀬田', 2, 'G603', '', '', '', '', '【抽選登録科目】
5 人文科学系
Y:ALL
T:2015～
N:ALL', '', '2025-05-19T02:21:12.488058', NULL),
    ('G250610037', 4, '', '後期', False, True, True, True, False, False, False, False, False, '瀬田', 2, 'G653', '', '', '', '', '【抽選登録科目】
5 人文科学系
Y:ALL
T:2015～
N:ALL', '', '2025-05-19T02:21:12.510206', NULL),
    ('G250610039', 4, '', '後期', False, True, True, True, False, False, False, False, False, 'オンライン', 2, 'G653', '', '', '', '', '【抽選登録科目】
【発展教養】アドバンスト教養科目群
5 人文科学系
Y:2021～
N:2021～', '', '2025-05-19T02:21:12.528934', NULL),
    ('G250610040', 4, '', '後期', False, True, True, True, False, False, False, False, False, 'オンライン', 2, 'G654', '', '', '', '', '【抽選登録科目】
5 人文科学系
T:～2014
N:2016～2018', '', '2025-05-19T02:21:12.548378', NULL),
    ('G250610041', 4, '', '前期', False, True, True, True, False, False, False, False, False, 'オンライン', 2, 'G603', '', '', '', '', '【抽選登録科目】
【発展教養】アドバンスト教養科目群
5 人文科学系
Y:2021～
N:2021～', '', '2025-05-19T02:21:12.568593', NULL),
    ('G250610042', 4, '', '前期', False, True, True, True, False, False, False, False, False, 'オンライン', 2, 'G604', '', '', '', '', '【抽選登録科目】
5 人文科学系
T:～2014
N:2016～2018', '', '2025-05-19T02:21:12.593362', NULL),
    ('G250610044', 4, '古典作品とその社会的・文化的影響', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 2, 'G603', '', '', '', '', '【抽選登録科目】
5 人文科学系
2021年度～
Y:2021～
N:2021～', '', '2025-05-19T02:21:12.617718', NULL),
    ('G250610045', 4, '近現代の文学', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 2, 'G652', '', '', '', '', '【抽選登録科目】
5 人文科学系
2021年度～
Y:2021～
N:2021～', '', '2025-05-19T02:21:12.642835', NULL),
    ('G250610046', 4, '「自然」のうちに生きる「われわれ」', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 2, 'G601', '', '', '', '', '【抽選登録科目】
5 人文科学系
Y:ALL
T:ALL
N:ALL', '', '2025-05-19T02:21:12.662228', NULL),
    ('G250610048', 4, '何をめざして生きるか', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 2, 'G651', '', '', '', '', '【抽選登録科目】
5 人文科学系
Y:ALL
T:ALL
N:ALL', '', '2025-05-19T02:21:12.681524', NULL),
    ('G250610050', 4, '', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 2, 'G605', '', '', '', '', '【抽選登録科目】
5 人文科学系
Y:ALL
T:ALL
N:ALL
履修可能学科は、カリキュラム分野科目設定にて制御', '', '2025-05-19T02:21:12.714969', NULL),
    ('G250610051', 4, '', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 2, 'G655', '', '', '', '', '【抽選登録科目】
5 人文科学系
Y:ALL
T:ALL
N:ALL
履修可能学科は、カリキュラム分野科目設定にて制御', '', '2025-05-19T02:21:12.732896', NULL),
    ('G250610054', 4, '', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 2, 'G602', '', '', '', '', '【抽選登録科目】
5 人文科学系
Y:ALL
T:ALL
N:ALL', '', '2025-05-19T02:21:12.753480', NULL),
    ('G250610055', 4, '', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 2, 'G602', '', '', '', '', '【抽選登録科目】
5 人文科学系
Y:ALL
T:ALL
N:ALL', '', '2025-05-19T02:21:12.772668', NULL),
    ('G250610058', 4, '', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 2, 'G652', '', '', '', '', '【抽選登録科目】
5 人文科学系
Y:ALL
T:ALL
N:ALL', '', '2025-05-19T02:21:12.795263', NULL),
    ('G250610059', 4, '', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 2, 'G652', '', '', '', '', '【抽選登録科目】
5 人文科学系
Y:ALL
T:ALL
N:ALL', '', '2025-05-19T02:21:12.816018', NULL),
    ('G250610060', 4, '', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 2, 'G602', '', '', '', '', '【抽選登録科目】
5 人文科学系
Y:ALL
T:ALL
N:ALL', '', '2025-05-19T02:21:12.837961', NULL),
    ('G250610062', 4, '', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 2, 'G652', '', '', '', '', '【抽選登録科目】
5 人文科学系
Y:ALL
T:ALL
N:ALL', '', '2025-05-19T02:21:12.859837', NULL),
    ('G250610064', 4, 'どう生きるのが「よい」のか？', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 2, 'G605', '', '', '', '', '【抽選登録科目】
5 人文科学系
Y:ALL
T:ALL
N:ALL', '', '2025-05-19T02:21:12.883269', NULL),
    ('G250610066', 4, 'どう生きるのが「よい」のか？', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 2, 'G654', '', '', '', '', '【抽選登録科目】
5 人文科学系
Y:ALL
T:ALL
N:ALL', '', '2025-05-19T02:21:12.903892', NULL),
    ('G250610067', 4, '統語論を中心に', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 2, 'G602', '', '', '', '', '【抽選登録科目】
5 人文科学系
Y:ALL
T:ALL
N:ALL', '', '2025-05-19T02:21:12.925395', NULL),
    ('G250610068', 4, '京都四大行事と歳時記：京に学ぶ京を学ぶ京で学ぶ　　－京都を通して日本を学ぶ－', '後期', True, True, True, True, False, False, False, False, False, 'オンライン', 2, 'G651', '', '', '', '', '【抽選登録科目】
5 人文科学系
Y:ALL
T:ALL
N:ALL', '', '2025-05-19T02:21:12.946404', NULL),
    ('G250620001', 4, '日常生活と法', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 2, 'G621', '', '', '', '', '【抽選登録科目】
6 社会科学系
Y:ALL
T:2015～
N:2019～', '', '2025-05-19T02:21:12.969818', NULL),
    ('G250620003', 4, '日常生活と法', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 2, 'G671', '', '', '', '', '【抽選登録科目】
6 社会科学系
Y:ALL
T:2015～
N:2019～', '', '2025-05-19T02:21:12.990270', NULL),
    ('G250620005', 4, '政治学の基本概念', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 2, 'G671', '', '', '', '', '【抽選登録科目】
6 社会科学系
Y:ALL
T:2015～
N:2019～', '', '2025-05-19T02:21:13.011801', NULL),
    ('G250620007', 4, '確率から統計、そして社会統計を考える', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 2, 'G621', '', '', '', '', '【抽選登録科目】
6 社会科学系
Y:ALL
T:2015～
N:2019～', '', '2025-05-19T02:21:13.031901', NULL),
    ('G250620009', 4, '人生の社会学ー自己認識と社会の探求', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 2, 'G621', '', '', '', '', '【抽選登録科目】
6 社会科学系
Y:ALL
T:2015～
N:2019～', '', '2025-05-19T02:21:13.069411', NULL),
    ('G250620011', 4, '身近な地域や世界各地の諸問題を地理学的に考えてみよう', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 2, 'G621', '', '', '', '', '【抽選登録科目】
6 社会科学系
Y:ALL
T:2015～
N:2019～', '', '2025-05-19T02:21:13.113976', NULL),
    ('G250620012', 4, '経済思想史入門：経済学の古典から現在の問題を照射する', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 2, 'G622', '', '', '', '', '【抽選登録科目】
6 社会科学系
Y:ALL
T:2015～
N:2019～', '', '2025-05-19T02:21:13.135327', NULL),
    ('G250620014', 4, '高校の現代社会・政治経済から経済学へ、そして新しい経済を考える', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 2, 'G621', '', '', '', '', '【抽選登録科目】
6 社会科学系
Y:ALL
T:2015～
N:2019～', '', '2025-05-19T02:21:13.157325', NULL),
    ('G250620016', 4, '経済思想史入門：経済学の古典から現在の問題を照射する', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 2, 'G671', '', '', '', '', '【抽選登録科目】
6 社会科学系
Y:ALL
T:2015～
N:2019～', '', '2025-05-19T02:21:13.181588', NULL),
    ('G250620018', 4, '社会研究のデータ収集と分析', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 2, 'G623', '', '', '', '', '【抽選登録科目】
6 社会科学系
Y:ALL
T:2015～
N:2019～', '', '2025-05-19T02:21:13.201096', NULL),
    ('G250620019', 4, '地域創生と観光の経営', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 2, 'G621', '', '', '', '', '【抽選登録科目】
6 社会科学系
Y:ALL
T:2015～
N:2019～', '', '2025-05-19T02:21:13.222515', NULL),
    ('G250620020', 4, 'メディア・リテラシー、', '後期', False, True, True, True, False, False, False, False, False, '瀬田', 2, 'G671', '', '', '', '', '【抽選登録科目】
6 社会科学系
Y:ALL
T:2015～
N:2019～', '', '2025-05-19T02:21:13.244529', NULL),
    ('G250620022', 4, '現代日本における人権', '前期', False, True, True, True, False, False, False, False, False, '瀬田', 2, 'G621', '', '', '', '', '【抽選登録科目】
6 社会科学系
Y:ALL
T:2015～
N:2019～', '', '2025-05-19T02:21:13.266894', NULL),
    ('G250620024', 4, '働きがいのある人間らしい労働と生活をめざして', '後期', False, True, True, True, False, False, False, False, False, '瀬田', 2, 'G671', '', '', '', '', '【抽選登録科目】
6 社会科学系
Y:ALL
T:2015～
N:2019～', '', '2025-05-19T02:21:13.289323', NULL),
    ('G250620025', 4, '人生の社会学ー自己認識と社会の探求', '後期', False, True, True, True, False, False, False, False, False, '瀬田', 2, 'G671', '', '', '', '', '【抽選登録科目】
【発展教養】アクティブ・ラーニング科目群
6 社会科学系
Y:ALL
T:2015～
N:2019～', '', '2025-05-19T02:21:13.307333', NULL),
    ('G250620026', 4, '', '後期', False, True, True, True, False, False, False, False, False, '瀬田', 2, 'G671', '', '', '', '', '【抽選登録科目】
6 社会科学系
Y:ALL
T:2015～
N:2019～', '', '2025-05-19T02:21:13.326848', NULL),
    ('G250620027', 4, '様々な「暴力」を見抜くために', '後期', False, True, True, True, False, False, False, False, False, '瀬田', 2, 'G673', '', '', '', '', '【抽選登録科目】
6 社会科学系
Y:ALL
T:2015～
N:2019～', '', '2025-05-19T02:21:13.350294', NULL),
    ('G250620029', 4, '様々な「暴力」を見抜くために', '後期', False, True, True, True, False, False, False, False, False, '瀬田', 2, 'G671', '', '', '', '', '【抽選登録科目】
6 社会科学系
Y:ALL
T:2015～
N:2019～', '', '2025-05-19T02:21:13.370525', NULL),
    ('G250620031', 4, '国際関係論からみた日本外交の課題', '後期', False, True, True, True, False, False, False, False, False, '瀬田', 2, 'G671', '', '', '', '', '【抽選登録科目】
6 社会科学系
Y:ALL
T:2015～
N:2019～', '', '2025-05-19T02:21:13.398984', NULL),
    ('G250620033', 4, '国際関係論からみた日本外交の課題', '前期', False, True, True, True, False, False, False, False, False, '瀬田', 2, 'G621', '', '', '', '', '【抽選登録科目】
6 社会科学系
Y:ALL
T:2015～
N:2019～', '', '2025-05-19T02:21:13.423128', NULL),
    ('G250620035', 4, 'さまざまな統計情報から地域について理解する', '前期', False, True, True, True, False, False, False, False, False, '瀬田', 2, 'G621', '', '', '', '', '【抽選登録科目】
6 社会科学系
Y:ALL
T:2015～
N:2019～', '', '2025-05-19T02:21:13.458717', NULL),
    ('G250620036', 4, '企業の経営状態を知るための基本的な分析方法', '後期', False, True, True, True, False, False, False, False, False, '瀬田', 2, 'G671', '', '', '', '', '【抽選登録科目】
6 社会科学系
Y:ALL
T:2015～
N:2019～', '', '2025-05-19T02:21:13.481880', NULL),
    ('G250620037', 4, '現代社会を理解するための社会思想の歴史', '前期', False, True, True, True, False, False, False, False, False, '瀬田', 2, 'G621', '', '', '', '', '【抽選登録科目】
6 社会科学系
Y:ALL
T:2015～
N:2019～', '', '2025-05-19T02:21:13.504120', NULL),
    ('G250620039', 4, '異文化を学ぶ、異文化から学ぶ', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 2, 'G623', '', '', '', '', '【抽選登録科目】
6 社会科学系
Y:ALL
T:2019
N:2019～', '', '2025-05-19T02:21:13.527206', NULL),
    ('G250620041', 4, '', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 2, 'G624', '', '', '', '', '【抽選登録科目】
6 社会科学系
Y:ALL
T:2019
N:2019～', '', '2025-05-19T02:21:13.547363', NULL),
    ('G250620042', 4, '数理・データサイエンス・AI（リテラシーレベル）', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 2, 'G624', '', '', '', '', '【抽選登録科目】
【発展教養】/【基礎教養】全学共通教育科目群/ベーシック教育科目群
6 社会科学系
2022年度以降入学生対象', '', '2025-05-19T02:21:13.570273', NULL),
    ('G250620043', 4, '数理・データサイエンス・AI（リテラシーレベル）', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 2, 'G674', '', '', '', '', '【抽選登録科目】
【発展教養】／【基礎教養】全学共通教育科目群／ベーシック教養科目群
6 社会科学系
2022年度以降入学生対象', '', '2025-05-19T02:21:13.594262', NULL),
    ('G250620044', 4, '日本国憲法の規定する統治機構と人権', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 2, 'G623', '', '', '', '', '【抽選登録科目】
6 社会科学系
Y:ALL
T:ALL
N:ALL', '', '2025-05-19T02:21:13.616737', NULL),
    ('G250620045', 4, '日本国憲法の規定する統治機構と人権', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 2, 'G625', '', '', '', '', '【抽選登録科目】
6 社会科学系
Y:ALL
T:ALL
N:ALL', '', '2025-05-19T02:21:13.644070', NULL),
    ('G250620046', 4, '日本国憲法の規定する統治機構と人権', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 2, 'G673', '', '', '', '', '【抽選登録科目】
6 社会科学系
Y:ALL
T:ALL
N:ALL', '', '2025-05-19T02:21:13.664903', NULL),
    ('G250620047', 4, '日本国憲法の規定する統治機構と人権', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 2, 'G673', '', '', '', '', '【抽選登録科目】
6 社会科学系
Y:ALL
T:ALL
N:ALL', '', '2025-05-19T02:21:13.690610', NULL),
    ('G250620048', 4, '', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 2, 'G625', '', '', '', '', '【抽選登録科目】
6 社会科学系
【対象】T/Y
Y:ALL
T:ALL
N:2019～', '', '2025-05-19T02:21:13.712619', NULL),
    ('G250620049', 4, '', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 2, 'G626', '', '', '', '', '【抽選登録科目】
6 社会科学系
【対象】N
N:2019～', '', '2025-05-19T02:21:13.733220', NULL),
    ('G250620050', 4, '', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 2, 'G675', '', '', '', '', '【抽選登録科目】
6 社会科学系
【対象】T/Y
Y:ALL
T:ALL
N:2019～', '', '2025-05-19T02:21:13.756599', NULL),
    ('G250620052', 4, '情報社会における心理・技術・法', '前期', False, True, True, True, False, False, False, False, False, '瀬田', 2, 'G621', '', '', '', '', '【抽選登録科目】
6 社会科学系
Y:ALL
T:ALL
N:2019～', '', '2025-05-19T02:21:13.773137', NULL),
    ('G250620053', 4, '現代日本の社会問題と福祉を考える', '前期', False, True, True, True, False, False, False, False, False, '瀬田', 2, 'G625', '', '', '', '', '【抽選登録科目】
6 社会科学系
Y:ALL
T:ALL
N:ALL', '', '2025-05-19T02:21:13.795406', NULL),
    ('G250620054', 4, '身近なメディアから現代社会における福祉を感じる', '後期', False, True, True, True, False, False, False, False, False, '瀬田', 2, 'G673', '', '', '', '', '【抽選登録科目】
6 社会科学系
Y:ALL
T:ALL
N:ALL', '', '2025-05-19T02:21:13.815409', NULL),
    ('G250620056', 4, '現代の「格差と排除の社会」を生き延びる実践力を磨く', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 2, 'G626', '', '', '', '', '【抽選登録科目】
6 社会科学系
Y:ALL
T:ALL
N:ALL', '', '2025-05-19T02:21:13.855039', NULL),
    ('G250620057', 4, '戦後日本の「標準的」なライフコース', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 2, 'G624', '', '', '', '', '【抽選登録科目】
6 社会科学系
Y:ALL
T:ALL
N:ALL', '', '2025-05-19T02:21:13.877102', NULL),
    ('G250620058', 4, '戦後日本の「標準的」なライフコース', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 2, 'G627', '', '', '', '', '【抽選登録科目】
6 社会科学系
Y:ALL
T:ALL
N:ALL', '', '2025-05-19T02:21:13.898325', NULL),
    ('G250620059', 4, '現代の「格差と排除の社会」を生き延びる実践力を磨く', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 2, 'G621', '', '', '', '', '【抽選登録科目】
6 社会科学系
Y:ALL
T:ALL
N:ALL', '', '2025-05-19T02:21:13.920216', NULL),
    ('G250620060', 4, '私から始まるエンパワメント（生きる力）と人権', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 2, 'G674', '', '', '', '', '【抽選登録科目】
6 社会科学系
Y:ALL
T:ALL
N:ALL', '', '2025-05-19T02:21:13.942209', NULL),
    ('G250620061', 4, '日常生活から考える人権問題', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 2, 'G674', '', '', '', '', '【抽選登録科目】
6 社会科学系
Y:ALL
T:ALL
N:ALL', '', '2025-05-19T02:21:13.962695', NULL),
    ('G250620062', 4, '日常生活から考える人権問題', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 2, 'G672', '', '', '', '', '【抽選登録科目】
6 社会科学系
Y:ALL
T:ALL
N:ALL', '', '2025-05-19T02:21:13.984366', NULL),
    ('G250620063', 4, '私から始まるエンパワメント（生きる力）と人権', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 2, 'G671', '', '', '', '', '【抽選登録科目】
6 社会科学系
Y:ALL
T:ALL
N:ALL', '', '2025-05-19T02:21:14.005780', NULL),
    ('G250620064', 4, 'ジェンダー入門', '前期', False, True, True, True, False, False, False, False, False, '瀬田', 2, 'G621', '', '', '', '', '【抽選登録科目】
6 社会科学系
Y:ALL
T:ALL
N:ALL', '', '2025-05-19T02:21:14.028416', NULL),
    ('G250620066', 4, '', '前期', True, True, True, True, False, False, False, False, False, 'オンライン', 2, 'G623', '', '', '', '', '【抽選登録科目】
6 社会科学系
2022年度以降入学生対象
『RYUKOKUキャリア・スタート・プログラム「キャリア実習・実習指導」』の同時受講を推奨。　※『RYUKOKUキャリア・スタート・プログラム「キャリア実習・実習指導」』を受講するためには、本講義の受講が必要です。「キャリア実習・実習指導」を受講する際は、4月にインターンシップ支援オフィスが開催する説明会に参加し、出願書類を提出してください（4月末～5月上旬頃を予定）。', '', '2025-05-19T02:21:14.049752', NULL),
    ('G250620088', 4, '', '後期', True, True, True, True, False, False, False, False, False, 'オンライン', 2, 'G673', '', '', '', '', '【抽選登録科目】
6 社会科学系
2022年度以降入学生対象
『RYUKOKUキャリア・スタート・プログラム「キャリア実習・実習指導」』の同時受講を推奨。　※『RYUKOKUキャリア・スタート・プログラム「キャリア実習・実習指導」』を受講するためには、本講義の受講が必要です。「キャリア実習・実習指導」を受講する際は、4月にインターンシップ支援オフィスが開催する説明会に参加し、出願書類を提出してください（4月末～5月上旬頃を予定）。', '', '2025-05-19T02:21:14.072560', NULL),
    ('G250620131', 4, '数理・データサイエンス・AI(リテラシーレベル)の授業', '', True, True, True, True, False, False, False, False, False, '深草', 2, 'G621', '', '', '', '', '【抽選登録科目】
【発展教養】／【基礎教養】全学共通教育科目群／ベーシック教養科目群
6 社会科学系
2022年度以降入学生対象
【開講日（教室授業）】９月２日（火）３講時、３日（水）３講時、４日（木）３講時　教室での授業を実施
※先端理工・農学部は瀬田学舎で受講', '', '2025-05-19T02:21:14.095413', NULL),
    ('G250620132', 4, '東アジアの未来―龍谷大学から東アジアの平和を構想する', '前期', False, True, True, True, False, False, False, False, False, 'オンライン', 2, 'G628', '', '', '', '', '【抽選登録科目】
【発展教養】アクティブ・ラーニング科目群
6 社会科学系', '', '2025-05-19T02:21:14.119828', NULL),
    ('G250620136', 4, '数理・データサイエンス・AI（応用基礎）「データサイエンス基礎」・「データエンジニアリング基礎」', '前期', False, True, True, True, False, False, False, False, False, '深草', 2, 'G621', '', '', '', '', '【抽選登録科目】
6 社会科学系', '', '2025-05-19T02:21:14.142249', NULL),
    ('G250620137', 4, '数理・データサイエンス・AI（応用基礎）「AI基礎」', '後期', False, True, True, True, False, False, False, False, False, '深草', 2, 'G672', '', '', '', '', '【抽選登録科目】
6 社会科学系', '', '2025-05-19T02:21:14.167959', NULL),
    ('G250630001', 4, '湖と森のいまと歴史を通して知る滋賀', '', True, True, True, True, False, False, False, False, False, '瀬田', 2, 'G631', '', '', '', '', '【抽選登録科目】
7 自然科学系
Y:ALL
T:ALL
N:2019～
【開講日】８月２６日（火）～８月３０日（土）', '', '2025-05-19T02:21:14.190372', NULL),
    ('G250630002', 4, '', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 2, 'G681', '', '', '', '', '【抽選登録科目】
7 自然科学系
Y:ALL
T:2015～
N:2019～', '', '2025-05-19T02:21:14.230091', NULL),
    ('G250630003', 4, '里山学　　地域の自然と文化', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 2, 'G631', '', '', '', '', '【抽選登録科目】
7 自然科学系
【対象】2015年度以降入学生
Y:ALL
T:2015～
N:2019～', '', '2025-05-19T02:21:14.258465', NULL),
    ('G250630004', 4, '', '', True, True, True, True, False, False, False, False, False, '瀬田', 2, 'G632', '', '', '', '', '【抽選登録科目】
7 自然科学系
Y:ALL
T:2015～
【開講日】８月２６日（火）～２８日（木）：１～４講時、８月２９日（金）：１～３講時', '', '2025-05-19T02:21:14.283993', NULL),
    ('G250630005', 4, '現代の食を巡る諸問題を知り、健康な食生活を考える', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 2, 'G681', '', '', '', '', '【抽選登録科目】
7 自然科学系
【注意】N:食品栄養学科は履修不可
Y:ALL
T:2019
N:2019～', '', '2025-05-19T02:21:14.304476', NULL),
    ('G250630007', 4, '人類の多様な生き方への理解', '前期', False, True, True, True, False, False, False, False, False, '瀬田', 2, 'G631', '', '', '', '', '【抽選登録科目】
7 自然科学系
2020年度～
Y:ALL
T:2019
N:2019～', '', '2025-05-19T02:21:14.327496', NULL),
    ('G250630010', 4, '', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 2, 'G631', '', '', '', '', '【抽選登録科目】
7 自然科学系
Y:ALL
T:2019', '', '2025-05-19T02:21:14.347208', NULL),
    ('G250630012', 4, '地球規模の環境問題と琵琶湖の環境問題', '前期', False, True, True, True, False, False, False, False, False, '瀬田', 2, 'G631', '', '', '', '', '【抽選登録科目】
7 自然科学系
2020年度～
Y:ALL
T:2019
N:2019～', '', '2025-05-19T02:21:14.368217', NULL),
    ('G250630014', 4, '', '', True, True, True, True, False, False, False, False, False, '瀬田', 2, 'G633', '', '', '', '', '【抽選登録科目】
7 自然科学系
Y:ALL
T:ALL
N:2019～
【開講日】９月２日（火）～４日（木）：１～４講時、５日（金）：１～３講時', '', '2025-05-19T02:21:14.393096', NULL),
    ('G250630015', 4, '', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 2, 'G634', '', '', '', '', '【抽選登録科目】
7 自然科学系
Y:ALL
T:ALL
N:2019～', '', '2025-05-19T02:21:14.417822', NULL),
    ('G250630016', 4, '身の回りの物理と科学技術', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 2, 'G681', '', '', '', '', '【抽選登録科目】
7 自然科学系
Y:ALL
T:ALL
N:ALL', '', '2025-05-19T02:21:14.440999', NULL),
    ('G250630017', 4, '', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 2, 'G681', '', '', '', '', '【抽選登録科目】
7 自然科学系
【注意】T:物質化学科、Y:応用化学課程は履修不可。履修可能学科は、カリキュラム分野科目設定にて制御
Y:ALL
T:ALL
N:ALL', '', '2025-05-19T02:21:14.477077', NULL),
    ('G250630018', 4, '', '前期', False, True, True, True, False, False, False, False, False, '瀬田', 2, 'G631', '', '', '', '', '【抽選登録科目】
7 自然科学系
Y:ALL
T:ALL
N:2019～', '', '2025-05-19T02:21:14.502868', NULL),
    ('G250630019', 4, '', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 2, 'G682', '', '', '', '', '【抽選登録科目】
7 自然科学系
Y:ALL
T:ALL
N:2019～', '', '2025-05-19T02:21:14.527624', NULL),
    ('G250630020', 4, '', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 2, 'G631', '', '', '', '', '【抽選登録科目】
7 自然科学系
Y:ALL
T:ALL
N:2019～', '', '2025-05-19T02:21:14.551123', NULL),
    ('G250630022', 4, '現代社会を支える先進技術', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 2, 'G683', '', '', '', '', '【抽選登録科目】
7 自然科学系
Y:ALL
T:ALL
N:2019～', '', '2025-05-19T02:21:14.571582', NULL),
    ('G250630023', 4, '', '前期', False, True, True, True, False, False, False, False, False, '瀬田', 2, 'G631', '', '', '', '', '【抽選登録科目】
7 自然科学系
Y:ALL
T:ALL
N:2016～', '', '2025-05-19T02:21:14.591057', NULL),
    ('G250640001', 4, '', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G641', '', '', '', '', '【オープン登録科目】
4-1 スポーツ必修
【対象】T:数理情報学科、Y:数理情報科学課程
【種目】テニス', '', '2025-05-19T02:21:14.616421', NULL),
    ('G250640002', 4, '', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G645', '', '', '', '', '【オープン登録科目】
4-1 スポーツ必修
【対象】T:数理情報学科、Y:数理情報科学課程
【種目】テニス', '', '2025-05-19T02:21:14.660532', NULL),
    ('G250640003', 4, '', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G642', '', '', '', '', '【オープン登録科目】
4-1 スポーツ必修
【対象】T:数理情報学科、Y:数理情報科学課程
【種目】ソフト', '', '2025-05-19T02:21:14.681291', NULL),
    ('G250640004', 4, '', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G646', '', '', '', '', '【オープン登録科目】
4-1 スポーツ必修
【対象】T:数理情報学科、Y:数理情報科学課程
【種目】ソフト', '', '2025-05-19T02:21:14.701859', NULL),
    ('G250640005', 4, '', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G643', '', '', '', '', '【オープン登録科目】
4-1 スポーツ必修
【対象】T:数理情報学科、Y:数理情報科学課程
【種目】バレーボール', '', '2025-05-19T02:21:14.722713', NULL),
    ('G250640006', 4, '', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G647', '', '', '', '', '【オープン登録科目】
4-1 スポーツ必修
【対象】T:数理情報学科、Y:数理情報科学課程
【種目】バレーボール', '', '2025-05-19T02:21:14.748713', NULL),
    ('G250640007', 4, '', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G640', '', '', '', '', '【オープン登録科目】
4-1 スポーツ必修
【対象】T:物質化学科・環境ソリューション工学科、Y:応用化学課程・環境生態工学課程・環境科学課程
【種目】テニス', '', '2025-05-19T02:21:14.772110', NULL),
    ('G250640008', 4, '', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G645', '', '', '', '', '【オープン登録科目】
4-1 スポーツ必修
【対象】T:物質化学科・環境ソリューション工学科、Y:応用化学課程・環境生態工学課程・環境科学課程
【種目】テニス', '', '2025-05-19T02:21:14.799244', NULL),
    ('G250640009', 4, '', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G641', '', '', '', '', '【オープン登録科目】
4-1 スポーツ必修
【対象】T:物質化学科・環境ソリューション工学科、Y:応用化学課程・環境生態工学課程・環境科学課程
【種目】ソフト', '', '2025-05-19T02:21:14.821007', NULL),
    ('G250640010', 4, '', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G646', '', '', '', '', '【オープン登録科目】
4-1 スポーツ必修
【対象】T:物質化学科・環境ソリューション工学科、Y:応用化学課程・環境生態工学課程・環境科学課程
【種目】ソフト', '', '2025-05-19T02:21:14.842049', NULL),
    ('G250640011', 4, '', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G642', '', '', '', '', '【オープン登録科目】
4-1 スポーツ必修
【対象】T:物質化学科・環境ソリューション工学科、Y:応用化学課程・環境生態工学課程・環境科学課程
【種目】バレーボール', '', '2025-05-19T02:21:14.863054', NULL),
    ('G250640012', 4, '', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G647', '', '', '', '', '【オープン登録科目】
4-1 スポーツ必修
【対象】T:物質化学科・環境ソリューション工学科、Y:応用化学課程・環境生態工学課程・環境科学課程
【種目】バレーボール', '', '2025-05-19T02:21:14.888260', NULL),
    ('G250640013', 4, '', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G643', '', '', '', '', '【オープン登録科目】
4-1 スポーツ必修
【対象】T:物質化学科・環境ソリューション工学科、Y:応用化学課程・環境生態工学課程・環境科学課程
【種目】卓球', '', '2025-05-19T02:21:14.922592', NULL),
    ('G250640014', 4, '', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G648', '', '', '', '', '【オープン登録科目】
4-1 スポーツ必修
【対象】T:物質化学科・環境ソリューション工学科、Y:応用化学課程・環境生態工学課程・環境科学課程
【種目】卓球', '', '2025-05-19T02:21:14.945330', NULL),
    ('G250640015', 4, '', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G644', '', '', '', '', '【オープン登録科目】
4-1 スポーツ必修
【対象】T:物質化学科・環境ソリューション工学科、Y:応用化学課程・環境生態工学課程・環境科学課程
【種目】ニュースポーツ', '', '2025-05-19T02:21:14.966440', NULL),
    ('G250640016', 4, '', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G649', '', '', '', '', '【オープン登録科目】
4-1 スポーツ必修
【対象】T:物質化学科・環境ソリューション工学科、Y:応用化学課程・環境生態工学課程・環境科学課程
【種目】ニュースポーツ', '', '2025-05-19T02:21:14.988448', NULL),
    ('G250640017', 4, '', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G641', '', '', '', '', '【オープン登録科目】
4-1 スポーツ必修
【対象】T:機械システム工学科、Y:機械工学ロボティクス課程
【種目】ミニサッカー', '', '2025-05-19T02:21:15.012613', NULL),
    ('G250640018', 4, '', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G645', '', '', '', '', '【オープン登録科目】
4-1 スポーツ必修
【対象】T:機械システム工学科、Y:機械工学ロボティクス課程
【種目】ミニサッカー', '', '2025-05-19T02:21:15.053481', NULL),
    ('G250640019', 4, '', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G642', '', '', '', '', '【オープン登録科目】
4-1 スポーツ必修
【対象】T:機械システム工学科、Y:機械工学ロボティクス課程
【種目】ソフト', '', '2025-05-19T02:21:15.074502', NULL),
    ('G250640020', 4, '', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G646', '', '', '', '', '【オープン登録科目】
4-1 スポーツ必修
【対象】T:機械システム工学科、Y:機械工学ロボティクス課程
【種目】ソフト', '', '2025-05-19T02:21:15.099341', NULL),
    ('G250640021', 4, '', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G643', '', '', '', '', '【オープン登録科目】
4-1 スポーツ必修
【対象】T:機械システム工学科、Y:機械工学ロボティクス課程
【種目】バスケ', '', '2025-05-19T02:21:15.125597', NULL),
    ('G250640022', 4, '', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G647', '', '', '', '', '【オープン登録科目】
4-1 スポーツ必修
【対象】T:機械システム工学科、Y:機械工学ロボティクス課程
【種目】バスケ', '', '2025-05-19T02:21:15.147370', NULL),
    ('G250640023', 4, '', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G640', '', '', '', '', '【オープン登録科目】
4-1 スポーツ必修
【対象】T:電子情報学科・情報メディア学科、Y:電子情報通信課程・知能情報メディア課程
【種目】テニス', '', '2025-05-19T02:21:15.168718', NULL),
    ('G250640024', 4, '', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G645', '', '', '', '', '【オープン登録科目】
4-1 スポーツ必修
【対象】T:電子情報学科・情報メディア学科、Y:電子情報通信課程・知能情報メディア課程
【種目】テニス', '', '2025-05-19T02:21:15.195348', NULL),
    ('G250640025', 4, '', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G641', '', '', '', '', '【オープン登録科目】
4-1 スポーツ必修
【対象】T:電子情報学科・情報メディア学科、Y:電子情報通信課程・知能情報メディア課程
【種目】ソフト', '', '2025-05-19T02:21:15.219768', NULL),
    ('G250640026', 4, '', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G646', '', '', '', '', '【オープン登録科目】
4-1 スポーツ必修
【対象】T:電子情報学科・情報メディア学科、Y:電子情報通信課程・知能情報メディア課程
【種目】ソフト', '', '2025-05-19T02:21:15.243080', NULL),
    ('G250640027', 4, '', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G642', '', '', '', '', '【オープン登録科目】
4-1 スポーツ必修
【対象】T:電子情報学科・情報メディア学科、Y:電子情報通信課程・知能情報メディア課程
【種目】バスケ', '', '2025-05-19T02:21:15.263410', NULL),
    ('G250640028', 4, '', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G647', '', '', '', '', '【オープン登録科目】
4-1 スポーツ必修
【対象】T:電子情報学科・情報メディア学科、Y:電子情報通信課程・知能情報メディア課程
【種目】バスケ', '', '2025-05-19T02:21:15.293554', NULL),
    ('G250640029', 4, '', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G643', '', '', '', '', '【オープン登録科目】
4-1 スポーツ必修
【対象】T:電子情報学科・情報メディア学科、Y:電子情報通信課程・知能情報メディア課程
【種目】卓球', '', '2025-05-19T02:21:15.314617', NULL),
    ('G250640030', 4, '', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G648', '', '', '', '', '【オープン登録科目】
4-1 スポーツ必修
【対象】T:電子情報学科・情報メディア学科、Y:電子情報通信課程・知能情報メディア課程
【種目】卓球', '', '2025-05-19T02:21:15.335351', NULL),
    ('G250640031', 4, '', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G644', '', '', '', '', '【オープン登録科目】
4-1 スポーツ必修
【対象】T:電子情報学科・情報メディア学科、Y:電子情報通信課程・知能情報メディア課程
【種目】ミニサッカー', '', '2025-05-19T02:21:15.358517', NULL),
    ('G250640032', 4, '', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G649', '', '', '', '', '【オープン登録科目】
4-1 スポーツ必修
【対象】T:電子情報学科・情報メディア学科、Y:電子情報通信課程・知能情報メディア課程
【種目】ミニサッカー', '', '2025-05-19T02:21:15.379269', NULL),
    ('G250640036', 4, '', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G691', '', '', '', '', '【オープン登録科目】
4-1 スポーツ必修
【対象】T:数理情報学科、Y:数理情報科学課程
【種目】バスケ', '', '2025-05-19T02:21:15.412410', NULL),
    ('G250640037', 4, '', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G695', '', '', '', '', '【オープン登録科目】
4-1 スポーツ必修
【対象】T:数理情報学科、Y:数理情報科学課程
【種目】バスケ', '', '2025-05-19T02:21:15.444075', NULL),
    ('G250640038', 4, '', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G692', '', '', '', '', '【オープン登録科目】
4-1 スポーツ必修
【対象】T:数理情報学科、Y:数理情報科学課程
【種目】テニス', '', '2025-05-19T02:21:15.480597', NULL),
    ('G250640039', 4, '', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G696', '', '', '', '', '【オープン登録科目】
4-1 スポーツ必修
【対象】T:数理情報学科、Y:数理情報科学課程
【種目】テニス', '', '2025-05-19T02:21:15.503598', NULL),
    ('G250640040', 4, '', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G693', '', '', '', '', '【オープン登録科目】
4-1 スポーツ必修
【対象】T:数理情報学科、Y:数理情報科学課程
【種目】ミニサッカー', '', '2025-05-19T02:21:15.526014', NULL),
    ('G250640041', 4, '', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G697', '', '', '', '', '【オープン登録科目】
4-1 スポーツ必修
【対象】T:数理情報学科、Y:数理情報科学課程
【種目】ミニサッカー', '', '2025-05-19T02:21:15.545083', NULL),
    ('G250640042', 4, '', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G690', '', '', '', '', '【オープン登録科目】
4-1 スポーツ必修
【対象】T:物質化学科・環境ソリューション工学科、Y:応用化学課程・環境生態工学課程・環境科学課程
【種目】バスケ', '', '2025-05-19T02:21:15.566255', NULL),
    ('G250640043', 4, '', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G695', '', '', '', '', '【オープン登録科目】
4-1 スポーツ必修
【対象】T:物質化学科・環境ソリューション工学科、Y:応用化学課程・環境生態工学課程・環境科学課程
【種目】バスケ', '', '2025-05-19T02:21:15.592055', NULL),
    ('G250640044', 4, '', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G691', '', '', '', '', '【オープン登録科目】
4-1 スポーツ必修
【対象】T:物質化学科・環境ソリューション工学科、Y:応用化学課程・環境生態工学課程・環境科学課程
【種目】テニス', '', '2025-05-19T02:21:15.614700', NULL),
    ('G250640045', 4, '', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G696', '', '', '', '', '【オープン登録科目】
4-1 スポーツ必修
【対象】T:物質化学科・環境ソリューション工学科、Y:応用化学課程・環境生態工学課程・環境科学課程
【種目】テニス', '', '2025-05-19T02:21:15.635300', NULL),
    ('G250640046', 4, '', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G692', '', '', '', '', '【オープン登録科目】
4-1 スポーツ必修
【対象】T:物質化学科・環境ソリューション工学科、Y:応用化学課程・環境生態工学課程・環境科学課程
【種目】ミニサッカー', '', '2025-05-19T02:21:15.655506', NULL),
    ('G250640047', 4, '', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G697', '', '', '', '', '【オープン登録科目】
4-1 スポーツ必修
【対象】T:物質化学科・環境ソリューション工学科、Y:応用化学課程・環境生態工学課程・環境科学課程
【種目】ミニサッカー', '', '2025-05-19T02:21:15.681425', NULL),
    ('G250640048', 4, '', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G693', '', '', '', '', '【オープン登録科目】
4-1 スポーツ必修
【対象】T:物質化学科・環境ソリューション工学科、Y:応用化学課程・環境生態工学課程・環境科学課程
【種目】ニュースポーツ', '', '2025-05-19T02:21:15.700467', NULL),
    ('G250640049', 4, '', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G698', '', '', '', '', '【オープン登録科目】
4-1 スポーツ必修
【対象】T:物質化学科・環境ソリューション工学科、Y:応用化学課程・環境生態工学課程・環境科学課程
【種目】ニュースポーツ', '', '2025-05-19T02:21:15.733172', NULL),
    ('G250640050', 4, '', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G694', '', '', '', '', '【オープン登録科目】
4-1 スポーツ必修
【対象】T:物質化学科・環境ソリューション工学科、Y:応用化学課程・環境生態工学課程・環境科学課程
【種目】卓球', '', '2025-05-19T02:21:15.754382', NULL),
    ('G250640051', 4, '', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G699', '', '', '', '', '【オープン登録科目】
4-1 スポーツ必修
【対象】T:物質化学科・環境ソリューション工学科、Y:応用化学課程・環境生態工学課程・環境科学課程
【種目】卓球', '', '2025-05-19T02:21:15.776306', NULL),
    ('G250640052', 4, '', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G691', '', '', '', '', '【オープン登録科目】
4-1 スポーツ必修
【対象】T:機械システム工学科、Y:機械工学ロボティクス課程
【種目】テニス', '', '2025-05-19T02:21:15.796933', NULL),
    ('G250640053', 4, '', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G695', '', '', '', '', '【オープン登録科目】
4-1 スポーツ必修
【対象】T:機械システム工学科、Y:機械工学ロボティクス課程
【種目】テニス', '', '2025-05-19T02:21:15.817957', NULL),
    ('G250640054', 4, '', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G692', '', '', '', '', '【オープン登録科目】
4-1 スポーツ必修
【対象】T:機械システム工学科、Y:機械工学ロボティクス課程
【種目】卓球', '', '2025-05-19T02:21:15.837524', NULL),
    ('G250640055', 4, '', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G696', '', '', '', '', '【オープン登録科目】
4-1 スポーツ必修
【対象】T:機械システム工学科、Y:機械工学ロボティクス課程
【種目】卓球', '', '2025-05-19T02:21:15.872614', NULL),
    ('G250640056', 4, '', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G693', '', '', '', '', '【オープン登録科目】
4-1 スポーツ必修
【対象】T:機械システム工学科、Y:機械工学ロボティクス課程
【種目】ミニサッカー', '', '2025-05-19T02:21:15.897421', NULL),
    ('G250640057', 4, '', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G697', '', '', '', '', '【オープン登録科目】
4-1 スポーツ必修
【対象】T:機械システム工学科、Y:機械工学ロボティクス課程
【種目】ミニサッカー', '', '2025-05-19T02:21:15.916989', NULL),
    ('G250640058', 4, '', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G690', '', '', '', '', '【オープン登録科目】
4-1 スポーツ必修
【対象】T:電子情報学科・情報メディア学科、Y:電子情報通信課程・知能情報メディア課程
【種目】バスケ', '', '2025-05-19T02:21:15.938194', NULL),
    ('G250640059', 4, '', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G695', '', '', '', '', '【オープン登録科目】
4-1 スポーツ必修
【対象】T:電子情報学科・情報メディア学科、Y:電子情報通信課程・知能情報メディア課程
【種目】バスケ', '', '2025-05-19T02:21:15.957705', NULL),
    ('G250640060', 4, '', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G691', '', '', '', '', '【オープン登録科目】
4-1 スポーツ必修
【対象】T:電子情報学科・情報メディア学科、Y:電子情報通信課程・知能情報メディア課程
【種目】卓球', '', '2025-05-19T02:21:15.979909', NULL),
    ('G250640061', 4, '', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G696', '', '', '', '', '【オープン登録科目】
4-1 スポーツ必修
【対象】T:電子情報学科・情報メディア学科、Y:電子情報通信課程・知能情報メディア課程
【種目】卓球', '', '2025-05-19T02:21:16.004865', NULL),
    ('G250640062', 4, '', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G692', '', '', '', '', '【オープン登録科目】
4-1 スポーツ必修
【対象】T:電子情報学科・情報メディア学科、Y:電子情報通信課程・知能情報メディア課程
【種目】ミニサッカー', '', '2025-05-19T02:21:16.025611', NULL),
    ('G250640063', 4, '', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G697', '', '', '', '', '【オープン登録科目】
4-1 スポーツ必修
【対象】T:電子情報学科・情報メディア学科、Y:電子情報通信課程・知能情報メディア課程
【種目】ミニサッカー', '', '2025-05-19T02:21:16.046669', NULL),
    ('G250640064', 4, '', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G693', '', '', '', '', '【オープン登録科目】
4-1 スポーツ必修
【対象】T:電子情報学科・情報メディア学科、Y:電子情報通信課程・知能情報メディア課程
【種目】ニュースポーツ', '', '2025-05-19T02:21:16.070674', NULL),
    ('G250640065', 4, '', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G698', '', '', '', '', '【オープン登録科目】
4-1 スポーツ必修
【対象】T:電子情報学科・情報メディア学科、Y:電子情報通信課程・知能情報メディア課程
【種目】ニュースポーツ', '', '2025-05-19T02:21:16.090464', NULL),
    ('G250640066', 4, '', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G694', '', '', '', '', '【オープン登録科目】
4-1 スポーツ必修
【対象】T:電子情報学科・情報メディア学科、Y:電子情報通信課程・知能情報メディア課程
【種目】テニス', '', '2025-05-19T02:21:16.113714', NULL),
    ('G250640067', 4, '', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 1, 'G699', '', '', '', '', '【オープン登録科目】
4-1 スポーツ必修
【対象】T:電子情報学科・情報メディア学科、Y:電子情報通信課程・知能情報メディア課程
【種目】テニス', '', '2025-05-19T02:21:16.134541', NULL),
    ('G250640201', 4, '', '前期', False, True, True, True, False, False, False, False, False, '瀬田', 2, 'G644', '', '', '', '', '【抽選登録科目】
4-3 スポーツ科学系
Y:ALL
T:ALL
N:ALL', '', '2025-05-19T02:21:16.156151', NULL),
    ('G250640202', 4, '', '後期', False, True, True, True, False, False, False, False, False, '瀬田', 2, 'G694', '', '', '', '', '【抽選登録科目】
4-3 スポーツ科学系
Y:ALL
T:ALL
N:ALL', '', '2025-05-19T02:21:16.179123', NULL),
    ('G250640203', 4, '', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 2, 'G641', '', '', '', '', '【抽選登録科目】
4-3 スポーツ科学系
Y:ALL
T:ALL
N:2016～', '', '2025-05-19T02:21:16.200553', NULL),
    ('G250640204', 4, '', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 2, 'G691', '', '', '', '', '【抽選登録科目】
4-3 スポーツ科学系
Y:ALL
T:ALL
N:2016～', '', '2025-05-19T02:21:16.228742', NULL),
    ('G250640205', 4, 'テキスト「スポーツルールの論理」からスポーツの社会を再考する', '前期', False, True, True, True, False, False, False, False, False, '瀬田', 2, 'G642', '', '', '', '', '【抽選登録科目】
4-3 スポーツ科学系
Y:ALL
T:ALL
N:2016～', '', '2025-05-19T02:21:16.268500', NULL),
    ('G250640206', 4, 'テキスト「スポーツルールの論理」からスポーツの社会を再考する', '後期', False, True, True, True, False, False, False, False, False, '瀬田', 2, 'G692', '', '', '', '', '【抽選登録科目】
4-3 スポーツ科学系
Y:ALL
T:ALL
N:2016～', '', '2025-05-19T02:21:16.287798', NULL),
    ('G250640207', 4, '', '前期', False, True, True, True, False, False, False, False, False, '瀬田', 2, 'G641', '', '', '', '', '【抽選登録科目】
4-3 スポーツ科学系
【対象】「スポーツ技術学」修得者
Y:ALL
T:2015～
N:2019～', '', '2025-05-19T02:21:16.308819', NULL),
    ('G250640208', 4, '', '後期', False, True, True, True, False, False, False, False, False, '瀬田', 2, 'G691', '', '', '', '', '【抽選登録科目】
4-3 スポーツ科学系
【対象】「スポーツ技術学」修得者
Y:ALL
T:2015～
N:2019～', '', '2025-05-19T02:21:16.330574', NULL),
    ('G250680001', 4, '', '', True, True, True, True, False, False, False, False, False, '深草', 2, 'G732', '', '', '', '', '【抽選登録科目】
10 龍谷ＩＰ事業科目
2019年度以降入学生対象
開講期間　8月26日(火)～30日（土）、9月1日（月）（予定）調整中', '', '2025-05-19T02:21:16.353712', NULL),
    ('G250680003', 4, '', '', False, True, True, True, False, False, False, False, False, '深草', 2, 'G733', '', '', '', '', '【抽選登録科目】
10 龍谷ＩＰ事業科目
2022年度以降入学生対象
開講期間　8月26日(火)～30日（土）、9月1日（月）', '', '2025-05-19T02:21:16.377143', NULL),
    ('G251100002', 4, '教師という仕事は何か。教師の使命とは。教職の意義や役割を考える。', '前期', False, True, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', '【抽選登録科目】
8 教職', '', '2025-05-19T02:21:16.408094', NULL),
    ('G251100003', 4, '教師という仕事は何か。教師の使命とは。教職の意義や役割を考える。', '前期', False, True, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', '【抽選登録科目】
8 教職', '', '2025-05-19T02:21:16.432809', NULL),
    ('G251100004', 4, '', '後期', False, True, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', '【抽選登録科目】
8 教職', '', '2025-05-19T02:21:16.455808', NULL),
    ('G251100005', 4, '', '前期', False, True, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', '【抽選登録科目】
8 教職', '', '2025-05-19T02:21:16.478577', NULL),
    ('G251100006', 4, '', '後期', False, True, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', '【抽選登録科目】
8 教職', '', '2025-05-19T02:21:16.502424', NULL),
    ('G251100007', 4, '', '前期', False, False, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', '【抽選登録科目】
8 教職
【対象】2010年度以降入学生', '', '2025-05-19T02:21:16.522188', NULL),
    ('G251100008', 4, '', '後期', False, False, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', '【抽選登録科目】
8 教職
【対象】2010年度以降入学生', '', '2025-05-19T02:21:16.544952', NULL),
    ('G251100009', 4, '', '前期', False, True, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', '【抽選登録科目】
8 教職
【対象】2019年度入学生～', '', '2025-05-19T02:21:16.565965', NULL),
    ('G251100010', 4, '', '後期', False, True, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', '【抽選登録科目】
8 教職
【対象】2019年度入学生～', '', '2025-05-19T02:21:16.586592', NULL),
    ('G251100011', 4, '', '前期', False, False, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', '【抽選登録科目】
8 教職
【対象】2010年度以降入学生', '', '2025-05-19T02:21:16.612172', NULL),
    ('G251100012', 4, '', '後期', False, False, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', '【抽選登録科目】
8 教職
【対象】2010年度以降入学生', '', '2025-05-19T02:21:16.649445', NULL),
    ('G251100013', 4, '', '前期', False, False, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', '【抽選登録科目】
8 教職
【対象】2010年度以降入学生', '', '2025-05-19T02:21:16.670613', NULL),
    ('G251100014', 4, '', '後期', False, False, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', '【抽選登録科目】
8 教職
【対象】2010年度以降入学生', '', '2025-05-19T02:21:16.692510', NULL),
    ('G251100015', 4, '生徒に興味を持たせ主体的に学ぶ力を育む理科教育法', '前期', False, False, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', '【抽選登録科目】
8 教職
【対象】2010年度以降入学生
教職課程登録者（履修料納入者）のみ履修可能。', '', '2025-05-19T02:21:16.713865', NULL),
    ('G251100017', 4, '実践に活かす理科教育法（実践的指導力を高める）', '後期', False, False, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', '【抽選登録科目】
8 教職
【対象】2010年度以降入学生
教職課程登録者（履修料納入者）のみ履修可能。', '', '2025-05-19T02:21:16.735707', NULL),
    ('G251100019', 4, '', '前期', False, True, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', '【抽選登録科目】
8 教職
【対象】2019年度入学生～
教職課程登録者（履修料納入者）のみ履修可能。', '', '2025-05-19T02:21:16.765561', NULL),
    ('G251100021', 4, '', '後期', False, True, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', '【抽選登録科目】
8 教職
【対象】2019年度入学生～
教職課程登録者（履修料納入者）のみ履修可能。', '', '2025-05-19T02:21:16.790424', NULL),
    ('G251100023', 4, '考え、議論する道徳', '後期', False, False, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', '【抽選登録科目】
8 教職', '', '2025-05-19T02:21:16.811834', NULL),
    ('G251100024', 4, '', '前期', False, False, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', '【抽選登録科目】
8 教職', '', '2025-05-19T02:21:16.836066', NULL),
    ('G251100025', 4, '', '前期', False, False, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', '【抽選登録科目】
8 教職
2022度年～
【注意】2022年度から名称変更（旧名称：教育の方法と技術）', '', '2025-05-19T02:21:16.859426', NULL),
    ('G251100026', 4, '', '前期', False, False, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', '【抽選登録科目】
8 教職
～2021年度', '', '2025-05-19T02:21:16.880958', NULL),
    ('G251100027', 4, '', '後期', False, True, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', '【抽選登録科目】
8 教職
【対象】2019年度入学生～
【注意】N:食品栄養学科は履修不可', '', '2025-05-19T02:21:16.903431', NULL),
    ('G251100028', 4, '', '後期', False, False, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', '【抽選登録科目】
8 教職', '', '2025-05-19T02:21:16.921939', NULL),
    ('G251100029', 4, '心豊かな教師を目指して～「介護等体験」への参加～', '通年', False, True, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', '【抽選登録科目】
8 教職', '', '2025-05-19T02:21:16.945126', NULL),
    ('G251100030', 2511, '教育実習に向けて', '前期', False, False, False, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', '【抽選登録科目】
8 教職', '', '2025-05-19T02:21:16.961402', NULL),
    ('G251100031', 2511, '教えられる立場から教える立場へ', '通年', False, False, False, True, False, False, False, False, False, '瀬田', 4, '', '', '', '', '', '【抽選登録科目】
8 教職
【対象】中学校免許取得希望者必修', '', '2025-05-19T02:21:16.982234', NULL),
    ('G251100032', 2511, '教えられる立場から教える立場へ', '通年', False, False, False, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', '【抽選登録科目】
8 教職
【対象】高等学校免許のみ取得希望者必修', '', '2025-05-19T02:21:17.016726', NULL),
    ('G251100033', 2511, '4年間の総仕上げとして教職への適性を省察する', '後期', False, False, False, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', '【抽選登録科目】
8 教職
【登録方法】教職センターからの指示を確認すること', '', '2025-05-19T02:21:17.044571', NULL),
    ('G251100034', 2511, '4年間の総仕上げとして教職への適性を省察する', '後期', False, False, False, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', '【抽選登録科目】
8 教職
【登録方法】教職センターからの指示を確認すること', '', '2025-05-19T02:21:17.071483', NULL),
    ('G251100035', 2511, '4年間の総仕上げとして教職への適性を省察する', '後期', False, False, False, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', '【抽選登録科目】
8 教職
【登録方法】教職センターからの指示を確認すること', '', '2025-05-19T02:21:17.091231', NULL),
    ('G251100044', 4, '', '通年', False, False, True, True, False, False, False, False, False, '瀬田', 4, '', '', '', '', '', '【抽選登録科目】
8 教職', '', '2025-05-19T02:21:17.117560', NULL),
    ('G251200001', 4, '真宗教義の基礎', '通年', False, True, True, True, False, False, False, False, False, '瀬田', 4, '', '', '', '', '', '【抽選登録科目】
9 本願寺科目
Y:ALL
T:ALL
N:ALL', '', '2025-05-19T02:21:17.145243', NULL),
    ('G251200002', 4, '', '通年', False, True, True, True, False, False, False, False, False, '瀬田', 4, '', '', '', '', '', '【抽選登録科目】
9 本願寺科目
Y:ALL
T:ALL
N:ALL', '', '2025-05-19T02:21:17.163461', NULL),
    ('G251200003', 4, '', '通年', True, True, True, True, False, False, False, False, False, '瀬田', 4, '', '', '', '', '', '【抽選登録科目】
9 本願寺科目', '', '2025-05-19T02:21:17.184378', NULL),
    ('G251200004', 4, '浄土真宗本願寺派の諸規則と組織機構について', '', True, True, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', '【抽選登録科目】
9 本願寺科目
【開講日】９月３日（水）～５日（金）：各日１講時～５講時で実施', '', '2025-05-19T02:21:17.205563', NULL),
    ('LU9325Z060', 4, '諸宗教を学び、諸宗教に学ぶ', '', True, True, True, True, False, False, False, False, False, '大宮', 1, '', '', '', '', '', '【開講日程】2025年度：8/26（火）～27（水）1～４講時　（※大宮キャンパス開講）', '', '2025-05-19T02:21:17.223386', NULL),
    ('LU9325Z070', 4, '仏教の歴史的展開', '', True, True, True, True, False, False, False, False, False, '大宮', 1, '', '', '', '', '', '【開講日程】2025年度：9/2（火）～3（水）1～４講時　（※大宮キャンパス開講）', '', '2025-05-19T02:21:17.242361', NULL),
    ('Y000001010', 4, '', '', True, True, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y1000
◎', '', '2025-05-19T02:21:17.262963', NULL),
    ('Y000001020', 4, '', '', True, True, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y2000
◎', '', '2025-05-19T02:21:17.282501', NULL),
    ('Y000001030', 4, '理工系としての情報リテラシー', '', True, True, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y3000
◎', '', '2025-05-19T02:21:17.312253', NULL),
    ('Y000001040', 4, '', '', True, True, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y4000
◎', '', '2025-05-19T02:21:17.335311', NULL),
    ('Y000001050', 4, '', '', True, True, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y5000
◎', '', '2025-05-19T02:21:17.354465', NULL),
    ('Y000001060', 4, '理工系としての情報リテラシー', '', True, True, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y6000
◎', '', '2025-05-19T02:21:17.372669', NULL),
    ('Y000002010', 4, '', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y1000
*
キャリア啓発科目：進路動機付け科目（キャリア意識を醸成する教育）です。', '', '2025-05-19T02:21:17.411015', NULL),
    ('Y000002020', 4, '', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y2000
*
キャリア啓発科目：進路動機付け科目（キャリア意識を醸成する教育）です。', '', '2025-05-19T02:21:17.437997', NULL),
    ('Y000002030', 4, '', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y3000
*
キャリア啓発科目：進路動機付け科目（キャリア意識を醸成する教育）です。', '', '2025-05-19T02:21:17.468431', NULL),
    ('Y000002040', 2, '', '前期', True, True, False, False, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y4000
*
キャリア啓発科目：進路動機付け科目（キャリア意識を醸成する教育）です。', '', '2025-05-19T02:21:17.498117', NULL),
    ('Y000002050', 4, '', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y5000
*
キャリア啓発科目：進路動機付け科目（キャリア意識を醸成する教育）です。', '', '2025-05-19T02:21:17.516516', NULL),
    ('Y000002060', 4, '', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y6000
*
キャリア啓発科目：進路動機付け科目（キャリア意識を醸成する教育）です。', '', '2025-05-19T02:21:17.540570', NULL),
    ('Y000004010', 2025, '科学技術を学ぶ面白さを知る', '後期', True, False, False, False, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y
*
キャリア啓発科目：進路動機付け科目（キャリア意識を醸成する教育）です。', '', '2025-05-19T02:21:17.570022', NULL),
    ('Y000005010', 4, 'グローバル人材入門', '前期', False, True, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y
○
キャリア形成科目：進路選択支援科目（進路選択を支援する教育）です。', '', '2025-05-19T02:21:17.589527', NULL),
    ('Y000006010', 4, '', '後期', False, True, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y
○
キャリア啓発科目：進路動機付け科目（キャリア意識を醸成する教育）です。', '', '2025-05-19T02:21:17.609534', NULL),
    ('Y000007010', 4, '海外での実習（感染症蔓延下においてはオンライン実施）', '前期', False, False, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'キャリア形成科目：進路選択支援科目（進路選択を支援する教育）です。
Y
○', '', '2025-05-19T02:21:17.637660', NULL),
    ('Y000008010', 4, '', '前期', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'キャリア啓発科目：進路動機付け科目（キャリア意識を醸成する教育）です。
Y
○', '', '2025-05-19T02:21:17.654388', NULL),
    ('Y000009010', 4, '', '前期', False, False, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'キャリア啓発科目：進路動機付け科目（キャリア意識を醸成する教育）です。
Y
○', '', '2025-05-19T02:21:17.673399', NULL),
    ('Y000010010', 4, '', '前期', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'キャリア形成科目：進路選択支援科目（進路選択を支援する教育）です。
Y1000
○', '', '2025-05-19T02:21:17.691903', NULL),
    ('Y000010020', 4, '', '前期', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'キャリア形成科目：進路選択支援科目（進路選択を支援する教育）です。
Y2000
○', '', '2025-05-19T02:21:17.707906', NULL),
    ('Y000010030', 4, '', '前期', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'キャリア形成科目：進路選択支援科目（進路選択を支援する教育）です。
Y3000
○', '', '2025-05-19T02:21:17.726917', NULL),
    ('Y000010040', 4, '', '前期', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'キャリア形成科目：進路選択支援科目（進路選択を支援する教育）です。
Y4000
○', '', '2025-05-19T02:21:17.743904', NULL),
    ('Y000010050', 4, '', '前期', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'キャリア形成科目：進路選択支援科目（進路選択を支援する教育）です。
Y5000
○', '', '2025-05-19T02:21:17.769919', NULL),
    ('Y000010060', 4, '', '前期', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'キャリア形成科目：進路選択支援科目（進路選択を支援する教育）です。
Y6000
○', '', '2025-05-19T02:21:17.788005', NULL),
    ('Y000011010', 4, '', '前期', False, False, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'キャリア形成科目：進路選択支援科目（進路選択を支援する教育）です。
Y1000
○', '', '2025-05-19T02:21:17.824508', NULL),
    ('Y000011020', 4, '', '前期', False, False, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'キャリア形成科目：進路選択支援科目（進路選択を支援する教育）です。
Y2000
○', '', '2025-05-19T02:21:17.843066', NULL),
    ('Y000011030', 4, '', '前期', False, False, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'キャリア形成科目：進路選択支援科目（進路選択を支援する教育）です。
Y3000
○', '', '2025-05-19T02:21:17.865067', NULL),
    ('Y000011040', 4, '', '前期', False, False, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'キャリア形成科目：進路選択支援科目（進路選択を支援する教育）です。
Y4000
○', '', '2025-05-19T02:21:17.885584', NULL),
    ('Y000011050', 4, '', '前期', False, False, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'キャリア形成科目：進路選択支援科目（進路選択を支援する教育）です。
Y5000
○', '', '2025-05-19T02:21:17.908782', NULL),
    ('Y000011060', 4, '', '前期', False, False, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'キャリア形成科目：進路選択支援科目（進路選択を支援する教育）です。
Y6000
○', '', '2025-05-19T02:21:17.930786', NULL),
    ('Y001001010', 4, '', '', True, True, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y1000
◎', '', '2025-05-19T02:21:17.953200', NULL),
    ('Y001002010', 4, '微積分や線形代数、情報系科目の基礎を身につけよう。', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y1000
□', '', '2025-05-19T02:21:17.968194', NULL),
    ('Y001003010', 4, '1変数関数の微積分法', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 3, '', '', '', '', '', 'Y1000
◎', '', '2025-05-19T02:21:17.997651', NULL),
    ('Y001004010', 4, '', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 3, '', '', '', '', '', 'Y1000
◎', '', '2025-05-19T02:21:18.024028', NULL),
    ('Y001005010', 4, '微積分及び演習II、線形代数及び演習II、データ分析、プログラミング及び実習Ⅱ、情報処理システムⅠを理解しよう', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y1000
□', '', '2025-05-19T02:21:18.038103', NULL),
    ('Y001006010', 4, '多変数関数の微積分法', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 3, '', '', '', '', '', 'Y1000
*', '', '2025-05-19T02:21:18.066140', NULL),
    ('Y001007010', 4, '', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 3, '', '', '', '', '', 'Y1000
*', '', '2025-05-19T02:21:18.103455', NULL),
    ('Y001008010', 4, '', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y1000
*', '', '2025-05-19T02:21:18.127459', NULL),
    ('Y001009010', 4, 'C言語プログラミング', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y1000
*', '', '2025-05-19T02:21:18.160790', NULL),
    ('Y001010010', 4, '情報処理の基礎について学ぶ', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y1000
*', '', '2025-05-19T02:21:18.180295', NULL),
    ('Y001011010', 4, '常微分方程式の解法', '前期', False, True, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y1000
*', '', '2025-05-19T02:21:18.222302', NULL),
    ('Y001012010', 4, '', '前期', False, True, True, True, False, False, False, False, False, '瀬田', 3, '', '', '', '', '', 'Y1000
*', '', '2025-05-19T02:21:18.243355', NULL),
    ('Y001013010', 4, '確率論と1群1変数の推測統計', '前期', False, True, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y1000
*', '', '2025-05-19T02:21:18.270876', NULL),
    ('Y001014010', 4, '', '前期', False, True, True, True, False, False, False, False, False, '瀬田', 3, '', '', '', '', '', 'Y1000
*', '', '2025-05-19T02:21:18.314993', NULL),
    ('Y001015010', 4, 'プログラミング言語Cの基本的事項の習得', '前期', False, True, True, True, False, False, False, False, False, '瀬田', 3, '', '', '', '', '', 'Y1000
*', '', '2025-05-19T02:21:18.346301', NULL),
    ('Y001016010', 4, 'オペレーティングシステム入門', '前期', False, True, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y1000
●', '', '2025-05-19T02:21:18.369824', NULL),
    ('Y001017010', 4, '数理と情報でピンポンチャレンジ', '前期', False, True, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y1000
◎', '', '2025-05-19T02:21:18.387293', NULL),
    ('Y001018010', 4, '', '', False, True, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y1000
●', '', '2025-05-19T02:21:18.407708', NULL),
    ('Y001019010', 4, '', '', False, True, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y1000
○', '', '2025-05-19T02:21:18.426226', NULL),
    ('Y001020010', 4, '', '', False, True, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y1000
○', '', '2025-05-19T02:21:18.447076', NULL),
    ('Y001021010', 4, '', '', False, True, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y1000
○', '', '2025-05-19T02:21:18.465526', NULL),
    ('Y001022010', 4, '常微分方程式の抽象理論への誘い', '後期', False, True, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y1000
○', '', '2025-05-19T02:21:18.487453', NULL),
    ('Y001023010', 4, '大学数学のすべての基礎「集合と論理」', '', False, True, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y1000
●', '', '2025-05-19T02:21:18.509425', NULL),
    ('Y001024010', 4, '質点・質点系・剛体の運動', '後期', False, True, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y1000
○', '', '2025-05-19T02:21:18.531912', NULL),
    ('Y001025010', 4, '', '後期', False, True, True, True, False, False, False, False, False, '瀬田', 3, '', '', '', '', '', 'Y1000
○', '', '2025-05-19T02:21:18.552373', NULL),
    ('Y001026010', 4, '数理と社会とキャリア', '', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y1000
◎', '', '2025-05-19T02:21:18.570973', NULL),
    ('Y001027010', 4, 'セミナー形式の専門的演習', '', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y1000
◎', '', '2025-05-19T02:21:18.607161', NULL),
    ('Y001028010', 4, '複素関数の微分と複素積分', '', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y1000
○', '', '2025-05-19T02:21:18.630051', NULL),
    ('Y001029010', 4, '抽象化の第一歩、ユークリッド空間と距離空間', '', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y1000
○', '', '2025-05-19T02:21:18.649065', NULL),
    ('Y001030010', 4, '', '', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y1000
○', '', '2025-05-19T02:21:18.668532', NULL),
    ('Y001031010', 4, '', '', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y1000
○', '', '2025-05-19T02:21:18.685559', NULL),
    ('Y001032010', 4, '', '', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y1000
○', '', '2025-05-19T02:21:18.703320', NULL),
    ('Y001033010', 4, '', '', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y1000
○', '', '2025-05-19T02:21:18.721813', NULL),
    ('Y001034010', 4, '', '', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y1000
○', '', '2025-05-19T02:21:18.740375', NULL),
    ('Y001035010', 4, 'オブジェクト指向プログラミング入門', '', False, False, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y1000
○', '', '2025-05-19T02:21:18.761010', NULL),
    ('Y001036010', 4, '', '', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y1000
○', '', '2025-05-19T02:21:18.779032', NULL),
    ('Y001037010', 4, '級数展開と留数定理', '', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y1000
○', '', '2025-05-19T02:21:18.798985', NULL),
    ('Y001038010', 4, 'さらなる抽象化、距離空間と位相空間', '', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y1000
○', '', '2025-05-19T02:21:18.817044', NULL),
    ('Y001039010', 4, '', '', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y1000
○', '', '2025-05-19T02:21:18.836506', NULL),
    ('Y001040010', 4, '', '', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y1000
○', '', '2025-05-19T02:21:18.870358', NULL),
    ('Y001041010', 4, '', '', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y1000
○', '', '2025-05-19T02:21:18.903391', NULL),
    ('Y001042010', 4, '', '', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y1000
○', '', '2025-05-19T02:21:18.924402', NULL),
    ('Y001043010', 4, '', '', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y1000
○', '', '2025-05-19T02:21:18.942007', NULL),
    ('Y001044010', 4, 'グラフィックスプログラミング入門', '', False, False, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y1000
○', '', '2025-05-19T02:21:18.963924', NULL),
    ('Y001045010', 4, '', '', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y1000
○', '', '2025-05-19T02:21:18.992268', NULL),
    ('Y001046010', 4, '曲面の微分幾何', '', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y1000
○', '', '2025-05-19T02:21:19.030972', NULL),
    ('Y001047010', 4, '', '', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y1000
○', '', '2025-05-19T02:21:19.054733', NULL),
    ('Y001048010', 4, '', '', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y1000
○', '', '2025-05-19T02:21:19.072744', NULL),
    ('Y001049010', 4, 'ネットワークプログラミング ＋ Python入門', '', False, False, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y1000
○', '', '2025-05-19T02:21:19.093258', NULL),
    ('Y001050010', 4, 'オートマトン理論と形式言語理論の基礎：有限オートマトンと正則言語', '', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y1000
○', '', '2025-05-19T02:21:19.114072', NULL),
    ('Y001051010', 4, '', '', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y1000
○', '', '2025-05-19T02:21:19.132711', NULL),
    ('Y001052010', 4, '', '', False, False, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y1000
○', '', '2025-05-19T02:21:19.157475', NULL),
    ('Y001053010', 4, '', '', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y1000
○', '', '2025-05-19T02:21:19.178586', NULL),
    ('Y001054010', 4, '', '', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y1000
○', '', '2025-05-19T02:21:19.197116', NULL),
    ('Y001055010', 4, 'オートマトン理論と形式言語理論の基礎: 文脈自由文法とプッシュダウンオートマトン', '', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y1000
○', '', '2025-05-19T02:21:19.214962', NULL),
    ('Y001056010', 4, '', '', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y1000
○', '', '2025-05-19T02:21:19.234515', NULL),
    ('Y001057010', 4, '特別研究の準備', '後期', False, False, True, True, False, False, False, False, False, '瀬田', 4, '', '', '', '', '', 'Y1000
◎', '', '2025-05-19T02:21:19.249584', NULL),
    ('Y001057020', 4, '特別研究の準備', '後期', False, False, True, True, False, False, False, False, False, '瀬田', 4, '', '', '', '', '', 'Y1000
◎', '', '2025-05-19T02:21:19.269115', NULL),
    ('Y001057030', 4, '特別研究の準備', '後期', False, False, True, True, False, False, False, False, False, '瀬田', 4, '', '', '', '', '', 'Y1000
◎', '', '2025-05-19T02:21:19.284673', NULL),
    ('Y001057040', 4, '特別研究の準備', '後期', False, False, True, True, False, False, False, False, False, '瀬田', 4, '', '', '', '', '', 'Y1000
◎', '', '2025-05-19T02:21:19.303048', NULL),
    ('Y001057050', 4, '特別研究の準備', '後期', False, False, True, True, False, False, False, False, False, '瀬田', 4, '', '', '', '', '', 'Y1000
◎', '', '2025-05-19T02:21:19.322060', NULL),
    ('Y001057060', 4, '特別研究の準備', '後期', False, False, True, True, False, False, False, False, False, '瀬田', 4, '', '', '', '', '', 'Y1000
◎', '', '2025-05-19T02:21:19.342677', NULL),
    ('Y001057070', 4, '特別研究の準備', '後期', False, False, True, True, False, False, False, False, False, '瀬田', 4, '', '', '', '', '', 'Y1000
◎', '', '2025-05-19T02:21:19.359401', NULL),
    ('Y001057080', 4, '特別研究の準備', '後期', False, False, True, True, False, False, False, False, False, '瀬田', 4, '', '', '', '', '', 'Y1000
◎', '', '2025-05-19T02:21:19.378137', NULL),
    ('Y001057090', 4, '特別研究の準備', '後期', False, False, True, True, False, False, False, False, False, '瀬田', 4, '', '', '', '', '', 'Y1000
◎', '', '2025-05-19T02:21:19.398650', NULL),
    ('Y001057100', 4, '特別研究の準備', '後期', False, False, True, True, False, False, False, False, False, '瀬田', 4, '', '', '', '', '', 'Y1000
◎', '', '2025-05-19T02:21:19.426764', NULL),
    ('Y001057110', 4, '特別研究の準備', '後期', False, False, True, True, False, False, False, False, False, '瀬田', 4, '', '', '', '', '', 'Y1000
◎', '', '2025-05-19T02:21:19.444112', NULL),
    ('Y001057120', 4, '特別研究の準備', '後期', False, False, True, True, False, False, False, False, False, '瀬田', 4, '', '', '', '', '', 'Y1000
◎', '', '2025-05-19T02:21:19.459636', NULL),
    ('Y001057130', 4, '特別研究の準備', '後期', False, False, True, True, False, False, False, False, False, '瀬田', 4, '', '', '', '', '', 'Y1000
◎', '', '2025-05-19T02:21:19.475014', NULL),
    ('Y001057140', 4, '特別研究の準備', '後期', False, False, True, True, False, False, False, False, False, '瀬田', 4, '', '', '', '', '', 'Y1000
◎', '', '2025-05-19T02:21:19.490552', NULL),
    ('Y001058300', 2025, '', '前期', False, False, False, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y1000
◎', '', '2025-05-19T02:21:19.506203', NULL),
    ('Y001058310', 2025, '', '前期', False, False, False, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y1000
◎', '', '2025-05-19T02:21:19.521741', NULL),
    ('Y001058320', 2025, '', '前期', False, False, False, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y1000
◎', '', '2025-05-19T02:21:19.537607', NULL),
    ('Y001058330', 2025, '', '前期', False, False, False, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y1000
◎', '', '2025-05-19T02:21:19.553778', NULL),
    ('Y001058340', 2025, '', '前期', False, False, False, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y1000
◎', '', '2025-05-19T02:21:19.572012', NULL),
    ('Y001058350', 2025, '', '前期', False, False, False, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y1000
◎', '', '2025-05-19T02:21:19.593446', NULL),
    ('Y001058360', 2025, '', '前期', False, False, False, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y1000
◎', '', '2025-05-19T02:21:19.609158', NULL),
    ('Y001058370', 2025, '', '前期', False, False, False, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y1000
◎', '', '2025-05-19T02:21:19.631948', NULL),
    ('Y001058390', 2025, '', '前期', False, False, False, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y1000
◎', '', '2025-05-19T02:21:19.647191', NULL),
    ('Y001058400', 2025, '', '前期', False, False, False, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y1000
◎', '', '2025-05-19T02:21:19.663176', NULL),
    ('Y001058410', 2025, '', '前期', False, False, False, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y1000
◎', '', '2025-05-19T02:21:19.693997', NULL),
    ('Y001058420', 2025, '', '前期', False, False, False, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y1000
◎', '', '2025-05-19T02:21:19.711123', NULL),
    ('Y001058430', 2025, '', '前期', False, False, False, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y1000
◎', '', '2025-05-19T02:21:19.726130', NULL),
    ('Y001059010', 2025, '', '前期', False, False, False, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y1000
◎', '', '2025-05-19T02:21:19.753543', NULL),
    ('Y001059020', 2025, '', '前期', False, False, False, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y1000
◎', '', '2025-05-19T02:21:19.771954', NULL),
    ('Y001059030', 2025, '', '前期', False, False, False, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y1000
◎', '', '2025-05-19T02:21:19.787653', NULL),
    ('Y001059040', 2025, '', '前期', False, False, False, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y1000
◎', '', '2025-05-19T02:21:19.805653', NULL),
    ('Y001059050', 2025, '', '前期', False, False, False, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y1000
◎', '', '2025-05-19T02:21:19.839274', NULL),
    ('Y001059060', 2025, '', '前期', False, False, False, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y1000
◎', '', '2025-05-19T02:21:19.855161', NULL),
    ('Y001059070', 2025, '', '前期', False, False, False, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y1000
◎', '', '2025-05-19T02:21:19.871561', NULL),
    ('Y001059080', 2025, '', '前期', False, False, False, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y1000
◎', '', '2025-05-19T02:21:19.893569', NULL),
    ('Y001059090', 2025, '', '前期', False, False, False, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y1000
◎', '', '2025-05-19T02:21:19.911006', NULL),
    ('Y001059100', 2025, '', '前期', False, False, False, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y1000
◎', '', '2025-05-19T02:21:19.930568', NULL),
    ('Y001059120', 2025, '', '前期', False, False, False, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y1000
◎', '', '2025-05-19T02:21:19.947055', NULL),
    ('Y001059130', 2025, '', '前期', False, False, False, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y1000
◎', '', '2025-05-19T02:21:19.964557', NULL),
    ('Y001059140', 2025, '', '前期', False, False, False, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y1000
◎', '', '2025-05-19T02:21:19.985153', NULL),
    ('Y001060010', 2025, '', '後期', False, False, False, True, False, False, False, False, False, '瀬田', 6, '', '', '', '', '', 'Y1000
◎', '', '2025-05-19T02:21:20.002153', NULL),
    ('Y001060020', 2025, '', '後期', False, False, False, True, False, False, False, False, False, '瀬田', 6, '', '', '', '', '', 'Y1000
◎', '', '2025-05-19T02:21:20.027793', NULL),
    ('Y001060030', 2025, '', '後期', False, False, False, True, False, False, False, False, False, '瀬田', 6, '', '', '', '', '', 'Y1000
◎', '', '2025-05-19T02:21:20.044544', NULL),
    ('Y001060040', 2025, '', '後期', False, False, False, True, False, False, False, False, False, '瀬田', 6, '', '', '', '', '', 'Y1000
◎', '', '2025-05-19T02:21:20.061601', NULL),
    ('Y001060050', 2025, '', '後期', False, False, False, True, False, False, False, False, False, '瀬田', 6, '', '', '', '', '', 'Y1000
◎', '', '2025-05-19T02:21:20.088318', NULL),
    ('Y001060060', 2025, '', '後期', False, False, False, True, False, False, False, False, False, '瀬田', 6, '', '', '', '', '', 'Y1000
◎', '', '2025-05-19T02:21:20.104878', NULL),
    ('Y001060070', 2025, '', '後期', False, False, False, True, False, False, False, False, False, '瀬田', 6, '', '', '', '', '', 'Y1000
◎', '', '2025-05-19T02:21:20.126316', NULL),
    ('Y001060080', 2025, '', '後期', False, False, False, True, False, False, False, False, False, '瀬田', 6, '', '', '', '', '', 'Y1000
◎', '', '2025-05-19T02:21:20.149857', NULL),
    ('Y001060090', 2025, '', '後期', False, False, False, True, False, False, False, False, False, '瀬田', 6, '', '', '', '', '', 'Y1000
◎', '', '2025-05-19T02:21:20.171604', NULL),
    ('Y001060100', 2025, '', '後期', False, False, False, True, False, False, False, False, False, '瀬田', 6, '', '', '', '', '', 'Y1000
◎', '', '2025-05-19T02:21:20.190399', NULL),
    ('Y001060120', 2025, '', '後期', False, False, False, True, False, False, False, False, False, '瀬田', 6, '', '', '', '', '', 'Y1000
◎', '', '2025-05-19T02:21:20.205682', NULL),
    ('Y001060130', 2025, '', '後期', False, False, False, True, False, False, False, False, False, '瀬田', 6, '', '', '', '', '', 'Y1000
◎', '', '2025-05-19T02:21:20.226718', NULL),
    ('Y001060140', 2025, '', '後期', False, False, False, True, False, False, False, False, False, '瀬田', 6, '', '', '', '', '', 'Y1000
◎', '', '2025-05-19T02:21:20.248339', NULL),
    ('Y002001010', 4, 'ノートPCを用いたメディア処理', '', True, True, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y2000
◎', '', '2025-05-19T02:21:20.283917', NULL),
    ('Y002002010', 4, '', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y2000
◎', '', '2025-05-19T02:21:20.307277', NULL),
    ('Y002003010', 4, '', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 4, '', '', '', '', '', 'Y2000
◎', '', '2025-05-19T02:21:20.326679', NULL),
    ('Y002004010', 4, '', '前期', False, True, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y2000
◎', '', '2025-05-19T02:21:20.346577', NULL),
    ('Y002005010', 2, '', '', True, True, False, False, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y2000
◎', '', '2025-05-19T02:21:20.371139', NULL),
    ('Y002006010', 2, '', '', True, True, False, False, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y2000
◎', '', '2025-05-19T02:21:20.397881', NULL),
    ('Y002007010', 4, 'データの整理，推定，検定', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y2000
○', '', '2025-05-19T02:21:20.424195', NULL),
    ('Y002008010', 4, 'MIT OpenCourseWareを用いた「信号とシステム」に関する授業【オンライン授業】', '後期', False, True, True, True, False, False, False, False, False, 'オンライン', 2, '', '', '', '', '', 'Y2000
○', '', '2025-05-19T02:21:20.457299', NULL),
    ('Y002009010', 4, '', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y2000
◎', '', '2025-05-19T02:21:20.476469', NULL),
    ('Y002010010', 4, '', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y2000
○', '', '2025-05-19T02:21:20.502826', NULL),
    ('Y002011010', 4, '', '前期', False, True, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y2000
◎', '', '2025-05-19T02:21:20.526838', NULL),
    ('Y002012010', 4, 'メディア処理から体験化まで', '前期', False, True, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y2000
○', '', '2025-05-19T02:21:20.546439', NULL),
    ('Y002013010', 4, '', '前期', False, True, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y2000
○', '', '2025-05-19T02:21:20.571461', NULL),
    ('Y002014010', 4, '', '前期', False, True, True, True, False, False, False, False, False, '瀬田', 4, '', '', '', '', '', 'Y2000
◎', '', '2025-05-19T02:21:20.592373', NULL),
    ('Y002015010', 4, '', '前期', False, True, True, True, False, False, False, False, False, '瀬田', 4, '', '', '', '', '', 'Y2000
◎', '', '2025-05-19T02:21:20.613385', NULL),
    ('Y002016010', 4, '', '前期', False, True, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y2000
○', '', '2025-05-19T02:21:20.637521', NULL),
    ('Y002017010', 4, '', '前期', False, True, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y2000
○', '', '2025-05-19T02:21:20.676616', NULL),
    ('Y002018010', 4, '', '前期', False, True, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y2000
○', '', '2025-05-19T02:21:20.702306', NULL),
    ('Y002019010', 4, '2進数，フーリエ級数展開，フーリエ変換', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y2000
○', '', '2025-05-19T02:21:20.721890', NULL),
    ('Y002020010', 4, 'データベースの基本から設計・運用まで', '前期', False, True, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y2000
○', '', '2025-05-19T02:21:20.741874', NULL),
    ('Y002021010', 4, '', '前期', False, True, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y2000
○', '', '2025-05-19T02:21:20.759698', NULL),
    ('Y002022010', 4, '', '前期', False, True, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y2000
○', '', '2025-05-19T02:21:20.781744', NULL),
    ('Y002023010', 4, '', '前期', False, True, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y2000
○', '', '2025-05-19T02:21:20.803977', NULL),
    ('Y002024010', 4, '', '後期', False, True, True, True, False, False, False, False, False, '瀬田', 4, '', '', '', '', '', 'Y2000
◎', '', '2025-05-19T02:21:20.825903', NULL),
    ('Y002025010', 4, '', '後期', False, True, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y2000
○', '', '2025-05-19T02:21:20.851426', NULL),
    ('Y002026010', 4, '私たちをとりまく情報環境の今を知り、未来を考える', '前期', False, False, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y2000
○', '', '2025-05-19T02:21:20.876425', NULL),
    ('Y002027010', 4, '', '後期', False, True, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y2000
○', '', '2025-05-19T02:21:20.891243', NULL),
    ('Y002028010', 4, '', '後期', False, True, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y2000
○', '', '2025-05-19T02:21:20.911246', NULL),
    ('Y002029010', 4, '', '後期', False, True, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y2000
○', '', '2025-05-19T02:21:20.939251', NULL),
    ('Y002030010', 4, '', '後期', False, True, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y2000
○', '', '2025-05-19T02:21:20.962734', NULL),
    ('Y002031010', 4, '', '前期', False, False, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y2000
○', '', '2025-05-19T02:21:20.983735', NULL),
    ('Y002032010', 4, '', '', False, False, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y2000
○', '', '2025-05-19T02:21:21.005243', NULL),
    ('Y002033010', 4, '', '', False, False, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y2000
○', '', '2025-05-19T02:21:21.024254', NULL),
    ('Y002034010', 4, '画像処理と認識', '', False, False, True, True, False, False, False, False, False, 'オンライン', 2, '', '', '', '', '', 'Y2000
○', '', '2025-05-19T02:21:21.061523', NULL),
    ('Y002035010', 4, '', '後期', False, False, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y2000
○', '', '2025-05-19T02:21:21.082534', NULL),
    ('Y002036020', 4, '', '前期', False, False, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y2000
○', '', '2025-05-19T02:21:21.102055', NULL),
    ('Y002037010', 4, 'インターネットの実践的理解を目指して', '後期', False, False, True, True, False, False, False, False, False, '瀬田', 4, '', '', '', '', '', 'Y2000
◎', '', '2025-05-19T02:21:21.124058', NULL),
    ('Y002038010', 4, '', '後期', False, False, True, True, False, False, False, False, False, '瀬田', 4, '', '', '', '', '', 'Y2000
○', '', '2025-05-19T02:21:21.147584', NULL),
    ('Y002039010', 4, '', '後期', False, False, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y2000
◎', '', '2025-05-19T02:21:21.167614', NULL),
    ('Y002040510', 2025, '', '通年', False, False, False, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y2000
◎', '', '2025-05-19T02:21:21.183622', NULL),
    ('Y002041540', 2025, '', '通年', False, False, False, True, False, False, False, False, False, '瀬田', 6, '', '', '', '', '', 'Y2000
◎', '', '2025-05-19T02:21:21.200949', NULL),
    ('Y002041550', 2025, '', '通年', False, False, False, True, False, False, False, False, False, '瀬田', 6, '', '', '', '', '', 'Y2000
◎', '', '2025-05-19T02:21:21.221957', NULL),
    ('Y002041560', 2025, '', '通年', False, False, False, True, False, False, False, False, False, '瀬田', 6, '', '', '', '', '', 'Y2000
◎', '', '2025-05-19T02:21:21.236972', NULL),
    ('Y002041570', 2025, '', '通年', False, False, False, True, False, False, False, False, False, '瀬田', 6, '', '', '', '', '', 'Y2000
◎', '', '2025-05-19T02:21:21.256492', NULL),
    ('Y002041580', 2025, '', '通年', False, False, False, True, False, False, False, False, False, '瀬田', 6, '', '', '', '', '', 'Y2000
◎', '', '2025-05-19T02:21:21.273437', NULL),
    ('Y002041590', 2025, '', '通年', False, False, False, True, False, False, False, False, False, '瀬田', 6, '', '', '', '', '', 'Y2000
◎', '', '2025-05-19T02:21:21.299958', NULL),
    ('Y002041600', 2025, '', '通年', False, False, False, True, False, False, False, False, False, '瀬田', 6, '', '', '', '', '', 'Y2000
◎', '', '2025-05-19T02:21:21.317956', NULL),
    ('Y002041610', 2025, '', '通年', False, False, False, True, False, False, False, False, False, '瀬田', 6, '', '', '', '', '', 'Y2000
◎', '', '2025-05-19T02:21:21.335956', NULL),
    ('Y002041620', 2025, '', '通年', False, False, False, True, False, False, False, False, False, '瀬田', 6, '', '', '', '', '', 'Y2000
◎', '', '2025-05-19T02:21:21.351472', NULL),
    ('Y002041630', 2025, '', '通年', False, False, False, True, False, False, False, False, False, '瀬田', 6, '', '', '', '', '', 'Y2000
◎', '', '2025-05-19T02:21:21.370298', NULL),
    ('Y002041640', 2025, '', '通年', False, False, False, True, False, False, False, False, False, '瀬田', 6, '', '', '', '', '', 'Y2000
◎', '', '2025-05-19T02:21:21.387816', NULL),
    ('Y002041650', 2025, '', '通年', False, False, False, True, False, False, False, False, False, '瀬田', 6, '', '', '', '', '', 'Y2000
◎', '', '2025-05-19T02:21:21.404815', NULL),
    ('Y002041660', 2025, '', '通年', False, False, False, True, False, False, False, False, False, '瀬田', 6, '', '', '', '', '', 'Y2000
◎', '', '2025-05-19T02:21:21.432818', NULL),
    ('Y003001010', 4, '', '', True, True, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y3000
◎', '', '2025-05-19T02:21:21.455138', NULL),
    ('Y003002010', 4, '', '', True, True, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y3000
◎', '', '2025-05-19T02:21:21.476144', NULL),
    ('Y003003010', 4, '計算機入門', '', True, True, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y3000
●', '', '2025-05-19T02:21:21.498226', NULL),
    ('Y003004010', 4, '', '', True, True, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y3000
◎', '', '2025-05-19T02:21:21.517227', NULL),
    ('Y003005010', 2, '高等学校の「数学」「物理」の再確認し、大学への数学および物理学の基礎を学ぶ', '前期', True, True, False, False, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y3000
□', '', '2025-05-19T02:21:21.538228', NULL),
    ('Y003006010', 4, '', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y3000
◎
キャリア啓発科目：進路動機付け科目（キャリア意識を醸成する教育）です。', '', '2025-05-19T02:21:21.560714', NULL),
    ('Y003007010', 4, '', '', True, True, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y3000
●', '', '2025-05-19T02:21:21.580715', NULL),
    ('Y003008010', 4, '', '', True, True, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y3000
●', '', '2025-05-19T02:21:21.604232', NULL),
    ('Y003009010', 4, '電子情報通信分野の基礎としての電気回路', '', True, True, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y3000
◎', '', '2025-05-19T02:21:21.625238', NULL),
    ('Y003010010', 4, '', '', True, True, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y3000
◎', '', '2025-05-19T02:21:21.645621', NULL),
    ('Y003011010', 4, '', '', True, True, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y3000
○', '', '2025-05-19T02:21:21.663596', NULL),
    ('Y003012010', 4, '', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y3000
○', '', '2025-05-19T02:21:21.690118', NULL),
    ('Y003013010', 4, '高等学校の「数学」「物理」の再確認し、大学への数学および物理学の基礎を学ぶ', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y3000
□', '', '2025-05-19T02:21:21.711117', NULL),
    ('Y003014010', 4, '', '', False, True, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y3000
○', '', '2025-05-19T02:21:21.732125', NULL),
    ('Y003015010', 4, '', '', False, True, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y3000
○', '', '2025-05-19T02:21:21.764555', NULL),
    ('Y003016010', 4, '', '', False, True, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y3000
●', '', '2025-05-19T02:21:21.786075', NULL),
    ('Y003017010', 4, '', '', False, True, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y3000
●', '', '2025-05-19T02:21:21.825099', NULL),
    ('Y003018010', 4, '', '', False, True, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y3000
●', '', '2025-05-19T02:21:21.855999', NULL),
    ('Y003019010', 4, '', '', False, True, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y3000
○', '', '2025-05-19T02:21:21.877011', NULL),
    ('Y003020010', 4, '', '', False, True, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y3000
○', '', '2025-05-19T02:21:21.895341', NULL),
    ('Y003021010', 4, '情報科学・計算機工学のための数学', '後期', False, True, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y3000
○', '', '2025-05-19T02:21:21.917339', NULL),
    ('Y003022010', 4, '', '前期', False, True, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y3000
◎', '', '2025-05-19T02:21:21.938344', NULL),
    ('Y003022020', 4, '', '前期', False, True, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y3000
◎', '', '2025-05-19T02:21:21.959864', NULL),
    ('Y003023010', 4, '', '', False, True, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y3000
○', '', '2025-05-19T02:21:21.976874', NULL),
    ('Y003024010', 4, '', '', False, True, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y3000
●', '', '2025-05-19T02:21:22.005383', NULL),
    ('Y003025010', 4, '', '', False, True, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y3000
○', '', '2025-05-19T02:21:22.026390', NULL),
    ('Y003026010', 4, '', '', False, True, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y3000
○', '', '2025-05-19T02:21:22.046889', NULL),
    ('Y003027010', 4, '', '', False, True, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y3000
●', '', '2025-05-19T02:21:22.065443', NULL),
    ('Y003028010', 4, '電子情報通信分野の基礎としての電子回路', '', False, True, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y3000
○', '', '2025-05-19T02:21:22.100965', NULL),
    ('Y003029010', 4, '', '', False, True, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y3000
○', '', '2025-05-19T02:21:22.118961', NULL),
    ('Y003030010', 4, '', '', False, True, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y3000
●', '', '2025-05-19T02:21:22.143966', NULL),
    ('Y003031010', 4, '', '', False, True, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y3000
○', '', '2025-05-19T02:21:22.162094', NULL),
    ('Y003032010', 4, '', '', False, True, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y3000
○', '', '2025-05-19T02:21:22.181099', NULL),
    ('Y003033010', 4, '', '後期', False, True, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y3000
◎', '', '2025-05-19T02:21:22.207620', NULL),
    ('Y003033020', 4, '', '後期', False, True, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y3000
◎', '', '2025-05-19T02:21:22.242135', NULL),
    ('Y003034010', 4, '課程内教員の研究紹介と外部講師による講演', '後期', False, True, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y3000
◎
キャリア啓発科目：進路動機付け科目（キャリア意識を醸成する教育）です。', '', '2025-05-19T02:21:22.258163', NULL),
    ('Y003035010', 4, '薄膜材料・製造技術', '', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y3000
●', '', '2025-05-19T02:21:22.276170', NULL),
    ('Y003036010', 4, '', '', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y3000
●', '', '2025-05-19T02:21:22.295680', NULL),
    ('Y003037010', 4, '', '', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y3000
●', '', '2025-05-19T02:21:22.314679', NULL),
    ('Y003038010', 4, '', '', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y3000
●', '', '2025-05-19T02:21:22.333680', NULL),
    ('Y003039010', 4, '', '', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y3000
●', '', '2025-05-19T02:21:22.352531', NULL),
    ('Y003040010', 4, 'ナノテクノロジー', '', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y3000
●', '', '2025-05-19T02:21:22.383050', NULL),
    ('Y003041010', 4, '', '', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y3000
●', '', '2025-05-19T02:21:22.410565', NULL),
    ('Y003042010', 4, '', '', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y3000
●', '', '2025-05-19T02:21:22.429572', NULL),
    ('Y003043010', 4, '', '', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y3000
●', '', '2025-05-19T02:21:22.449899', NULL),
    ('Y003044010', 4, '', '', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y3000
●', '', '2025-05-19T02:21:22.472902', NULL),
    ('Y003045010', 4, '', '', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y3000
●', '', '2025-05-19T02:21:22.491542', NULL),
    ('Y003046010', 4, '', '', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y3000
●', '', '2025-05-19T02:21:22.520765', NULL),
    ('Y003047010', 4, '薄膜材料・製造技術', '', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y3000
○', '', '2025-05-19T02:21:22.543551', NULL),
    ('Y003048010', 4, '', '', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y3000
○', '', '2025-05-19T02:21:22.561386', NULL),
    ('Y003049010', 4, '人間と人工システムの比較', '', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y3000
○', '', '2025-05-19T02:21:22.580390', NULL),
    ('Y003051010', 4, 'ニューラルネットワークの構造と動作', '', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y3000
○', '', '2025-05-19T02:21:22.599909', NULL),
    ('Y003052010', 4, 'エレクトロニクスを用いたエネルギー制御', '', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y3000
○', '', '2025-05-19T02:21:22.636920', NULL),
    ('Y003053010', 4, '', '', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y3000
○', '', '2025-05-19T02:21:22.654580', NULL),
    ('Y003054010', 4, '', '', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y3000
○', '', '2025-05-19T02:21:22.672500', NULL),
    ('Y003055010', 4, '薄膜デバイスの物理と動作原理および製造方法とアプリケーション', '', False, False, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y3000
○', '', '2025-05-19T02:21:22.695015', NULL),
    ('Y003056010', 4, '半導体電子工学', '', False, False, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y3000
○', '', '2025-05-19T02:21:22.715010', NULL),
    ('Y003057010', 4, '', '', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y3000
○', '', '2025-05-19T02:21:22.736015', NULL),
    ('Y003058010', 4, '', '', False, False, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y3000
○', '', '2025-05-19T02:21:22.756210', NULL),
    ('Y003059010', 4, '', '', False, False, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y3000
○', '', '2025-05-19T02:21:22.778222', NULL),
    ('Y003060010', 4, '', '', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y3000
○', '', '2025-05-19T02:21:22.794752', NULL),
    ('Y003061010', 4, '', '', False, False, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y3000
○', '', '2025-05-19T02:21:22.816750', NULL),
    ('Y003062010', 4, '材料/デバイスおよび回路評価に用いる計測原理と技術 (Physics of Thin Films)', '', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y3000
○', '', '2025-05-19T02:21:22.837758', NULL),
    ('Y003063010', 4, '', '', False, False, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y3000
○', '', '2025-05-19T02:21:22.857820', NULL),
    ('Y003064010', 4, '電子回路の基礎と回路シミュレーション', '', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y3000
○', '', '2025-05-19T02:21:22.875005', NULL),
    ('Y003065010', 4, '', '', False, False, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y3000
○', '', '2025-05-19T02:21:22.897559', NULL),
    ('Y003067010', 4, '', '', False, False, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y3000
○', '', '2025-05-19T02:21:22.921598', NULL),
    ('Y003069020', 4, '', '後期', False, False, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y3000
●', '', '2025-05-19T02:21:22.935607', NULL),
    ('Y003069030', 4, '', '後期', False, False, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y3000
●', '', '2025-05-19T02:21:22.954298', NULL),
    ('Y003069040', 4, '', '後期', False, False, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y3000
●', '', '2025-05-19T02:21:22.970038', NULL),
    ('Y003069050', 4, '', '後期', False, False, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y3000
●', '', '2025-05-19T02:21:22.986362', NULL),
    ('Y003069060', 4, '', '後期', False, False, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y3000
●', '', '2025-05-19T02:21:23.017849', NULL),
    ('Y003069070', 4, '', '後期', False, False, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y3000
●', '', '2025-05-19T02:21:23.033082', NULL),
    ('Y003069080', 4, '', '後期', False, False, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y3000
●', '', '2025-05-19T02:21:23.047349', NULL),
    ('Y003069100', 4, '', '後期', False, False, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y3000
●', '', '2025-05-19T02:21:23.061768', NULL),
    ('Y003069110', 4, '', '後期', False, False, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y3000
●', '', '2025-05-19T02:21:23.080125', NULL),
    ('Y003069140', 4, '', '後期', False, False, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y3000
●', '', '2025-05-19T02:21:23.095930', NULL),
    ('Y003069150', 4, '', '後期', False, False, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y3000
●', '', '2025-05-19T02:21:23.111152', NULL),
    ('Y003069160', 4, '', '後期', False, False, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y3000
●', '', '2025-05-19T02:21:23.130418', NULL),
    ('Y003069170', 4, '', '後期', False, False, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y3000
●', '', '2025-05-19T02:21:23.144426', NULL),
    ('Y003070150', 4, '', '後期', False, False, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y3000
◎', '', '2025-05-19T02:21:23.161105', NULL),
    ('Y003070170', 4, '', '後期', False, False, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y3000
◎', '', '2025-05-19T02:21:23.177704', NULL),
    ('Y003070180', 4, '', '後期', False, False, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y3000
◎', '', '2025-05-19T02:21:23.194779', NULL),
    ('Y003070190', 4, '', '後期', False, False, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y3000
◎', '', '2025-05-19T02:21:23.210408', NULL),
    ('Y003070200', 4, '', '後期', False, False, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y3000
◎', '', '2025-05-19T02:21:23.225403', NULL),
    ('Y003070210', 4, '', '後期', False, False, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y3000
◎', '', '2025-05-19T02:21:23.241419', NULL),
    ('Y003070220', 4, '', '後期', False, False, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y3000
◎', '', '2025-05-19T02:21:23.258689', NULL),
    ('Y003070230', 4, '', '後期', False, False, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y3000
◎', '', '2025-05-19T02:21:23.273179', NULL),
    ('Y003070240', 4, '', '後期', False, False, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y3000
◎', '', '2025-05-19T02:21:23.289697', NULL),
    ('Y003070260', 4, '', '後期', False, False, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y3000
◎', '', '2025-05-19T02:21:23.305854', NULL),
    ('Y003070280', 4, '', '後期', False, False, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y3000
◎', '', '2025-05-19T02:21:23.319853', NULL),
    ('Y003070290', 4, '', '後期', False, False, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y3000
◎', '', '2025-05-19T02:21:23.336712', NULL),
    ('Y003070300', 4, '', '後期', False, False, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y3000
◎', '', '2025-05-19T02:21:23.352044', NULL),
    ('Y003071140', 2025, '', '前期', False, False, False, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y3000
◎', '', '2025-05-19T02:21:23.381627', NULL),
    ('Y003071150', 2025, '', '前期', False, False, False, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y3000
◎', '', '2025-05-19T02:21:23.396148', NULL),
    ('Y003071170', 2025, '', '前期', False, False, False, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y3000
◎', '', '2025-05-19T02:21:23.412492', NULL),
    ('Y003071190', 2025, '', '前期', False, False, False, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y3000
◎', '', '2025-05-19T02:21:23.427951', NULL),
    ('Y003071200', 2025, '', '前期', False, False, False, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y3000
◎', '', '2025-05-19T02:21:23.446123', NULL),
    ('Y003071210', 2025, '', '前期', False, False, False, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y3000
◎', '', '2025-05-19T02:21:23.461353', NULL),
    ('Y003071220', 2025, '', '前期', False, False, False, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y3000
◎', '', '2025-05-19T02:21:23.478336', NULL),
    ('Y003071230', 2025, '', '前期', False, False, False, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y3000
◎', '', '2025-05-19T02:21:23.493606', NULL),
    ('Y003071240', 2025, '', '前期', False, False, False, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y3000
◎', '', '2025-05-19T02:21:23.509051', NULL),
    ('Y003071250', 2025, '', '前期', False, False, False, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y3000
◎', '', '2025-05-19T02:21:23.524370', NULL),
    ('Y003071520', 2025, '', '前期', False, False, False, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y3000
◎', '', '2025-05-19T02:21:23.538122', NULL),
    ('Y003071530', 2025, '', '前期', False, False, False, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y3000
◎', '', '2025-05-19T02:21:23.557810', NULL),
    ('Y003071550', 2025, '', '前期', False, False, False, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y3000
◎', '', '2025-05-19T02:21:23.573084', NULL),
    ('Y003072150', 2025, '', '通年', False, False, False, True, False, False, False, False, False, '瀬田', 6, '', '', '', '', '', 'Y3000
◎', '', '2025-05-19T02:21:23.588594', NULL),
    ('Y003072170', 2025, '', '通年', False, False, False, True, False, False, False, False, False, '瀬田', 6, '', '', '', '', '', 'Y3000
◎', '', '2025-05-19T02:21:23.604790', NULL),
    ('Y003072180', 2025, '', '通年', False, False, False, True, False, False, False, False, False, '瀬田', 6, '', '', '', '', '', 'Y3000
◎', '', '2025-05-19T02:21:23.619507', NULL),
    ('Y003072190', 2025, '', '通年', False, False, False, True, False, False, False, False, False, '瀬田', 6, '', '', '', '', '', 'Y3000
◎', '', '2025-05-19T02:21:23.635520', NULL),
    ('Y003072200', 2025, '', '通年', False, False, False, True, False, False, False, False, False, '瀬田', 6, '', '', '', '', '', 'Y3000
◎', '', '2025-05-19T02:21:23.650956', NULL),
    ('Y003072210', 2025, '', '通年', False, False, False, True, False, False, False, False, False, '瀬田', 6, '', '', '', '', '', 'Y3000
◎', '', '2025-05-19T02:21:23.665734', NULL),
    ('Y003072220', 2025, '', '通年', False, False, False, True, False, False, False, False, False, '瀬田', 6, '', '', '', '', '', 'Y3000
◎', '', '2025-05-19T02:21:23.683154', NULL),
    ('Y003072230', 2025, '', '通年', False, False, False, True, False, False, False, False, False, '瀬田', 6, '', '', '', '', '', 'Y3000
◎', '', '2025-05-19T02:21:23.698373', NULL),
    ('Y003072240', 2025, '', '通年', False, False, False, True, False, False, False, False, False, '瀬田', 6, '', '', '', '', '', 'Y3000
◎', '', '2025-05-19T02:21:23.719238', NULL),
    ('Y003072270', 2025, '', '通年', False, False, False, True, False, False, False, False, False, '瀬田', 6, '', '', '', '', '', 'Y3000
◎', '', '2025-05-19T02:21:23.734595', NULL),
    ('Y003072280', 2025, '', '通年', False, False, False, True, False, False, False, False, False, '瀬田', 6, '', '', '', '', '', 'Y3000
◎', '', '2025-05-19T02:21:23.764466', NULL),
    ('Y003072290', 2025, '', '通年', False, False, False, True, False, False, False, False, False, '瀬田', 6, '', '', '', '', '', 'Y3000
◎', '', '2025-05-19T02:21:23.779679', NULL),
    ('Y003072300', 2025, '', '通年', False, False, False, True, False, False, False, False, False, '瀬田', 6, '', '', '', '', '', 'Y3000
◎', '', '2025-05-19T02:21:23.796088', NULL),
    ('Y004001010', 4, '１変数の微分積分', '', True, True, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y4000
◎', '', '2025-05-19T02:21:23.816052', NULL),
    ('Y004002010', 4, '力学入門', '', True, True, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y4000
◎', '', '2025-05-19T02:21:23.833265', NULL),
    ('Y004003010', 4, '', '', True, True, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y4000
◎', '', '2025-05-19T02:21:23.854082', NULL),
    ('Y004004010', 4, '質点の力学', '', True, True, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y4000
◎', '', '2025-05-19T02:21:23.872055', NULL),
    ('Y004005010', 4, '', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y4000
◎', '', '2025-05-19T02:21:23.891955', NULL),
    ('Y004006010', 4, '', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y4000
◎', '', '2025-05-19T02:21:23.913310', NULL),
    ('Y004007010', 4, '偏微分と重積分', '', True, True, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y4000
◎', '', '2025-05-19T02:21:23.931966', NULL),
    ('Y004008010', 4, '', '', True, True, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y4000
◎', '', '2025-05-19T02:21:23.954721', NULL),
    ('Y004009010', 4, '質点の力学：運動量、仕事、エネルギー', '', True, True, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y4000
◎', '', '2025-05-19T02:21:23.974553', NULL),
    ('Y004010010', 4, '', '', True, True, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y4000
◎', '', '2025-05-19T02:21:23.994434', NULL),
    ('Y004011010', 4, '', '', True, True, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y4000
◎', '', '2025-05-19T02:21:24.014802', NULL),
    ('Y004012010', 4, '質点系・剛体の力学', '', True, True, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y4000
◎', '', '2025-05-19T02:21:24.031081', NULL),
    ('Y004013010', 4, '', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y4000
◎', '', '2025-05-19T02:21:24.053232', NULL),
    ('Y004014010', 4, '知っておくべきデータ分析の基礎となる考え方', '', False, True, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y4000
○', '', '2025-05-19T02:21:24.072375', NULL),
    ('Y004015010', 4, 'フーリエ級数展開，フーリエ変換', '', False, True, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y4000
○', '', '2025-05-19T02:21:24.090374', NULL),
    ('Y004016010', 4, '電磁気学I　electromagnetism I', '', False, True, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y4000
○', '', '2025-05-19T02:21:24.124565', NULL),
    ('Y004017010', 4, '', '', False, True, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y4000
◎', '', '2025-05-19T02:21:24.145244', NULL),
    ('Y004018010', 4, '', '', False, True, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y4000
◎', '', '2025-05-19T02:21:24.164494', NULL),
    ('Y004019010', 4, '', '', False, True, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y4000
◎', '', '2025-05-19T02:21:24.182261', NULL),
    ('Y004020010', 4, '', '', False, True, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y4000
◎', '', '2025-05-19T02:21:24.201781', NULL),
    ('Y004021010', 4, '知っておくべきデータ分析の基礎となる考え方', '', False, True, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y4000
○', '', '2025-05-19T02:21:24.220947', NULL),
    ('Y004022010', 4, 'ラプラス変換', '', False, True, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y4000
○', '', '2025-05-19T02:21:24.238163', NULL),
    ('Y004023010', 4, '電磁気学 II　electromagnetism II', '', False, True, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y4000
○', '', '2025-05-19T02:21:24.256862', NULL),
    ('Y004024010', 4, '', '', False, True, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y4000
◎', '', '2025-05-19T02:21:24.276342', NULL),
    ('Y004025010', 4, '', '', False, True, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y4000
◎', '', '2025-05-19T02:21:24.295267', NULL),
    ('Y004026010', 4, '', '', False, True, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y4000
◎', '', '2025-05-19T02:21:24.314032', NULL),
    ('Y004027010', 4, '', '', False, True, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y4000
◎', '', '2025-05-19T02:21:24.331259', NULL),
    ('Y004028010', 4, 'C言語によるコンピュータプログラミング入門', '前期', False, True, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y4000
◎', '', '2025-05-19T02:21:24.350445', NULL),
    ('Y004029010', 4, '', '前期', False, True, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y4000
◎', '', '2025-05-19T02:21:24.373953', NULL),
    ('Y004030010', 4, 'ベクトル解析', '', False, True, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y4000
○', '', '2025-05-19T02:21:24.391684', NULL),
    ('Y004031010', 4, '振動モード解析', '', False, True, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y4000
○', '', '2025-05-19T02:21:24.410433', NULL),
    ('Y004032010', 4, '', '', False, True, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y4000
○', '', '2025-05-19T02:21:24.428744', NULL),
    ('Y004033010', 4, '', '', False, True, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y4000
○', '', '2025-05-19T02:21:24.447620', NULL),
    ('Y004034010', 4, '', '', False, True, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y4000
◎', '', '2025-05-19T02:21:24.466152', NULL),
    ('Y004035010', 4, '', '', False, True, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y4000
○', '', '2025-05-19T02:21:24.504005', NULL),
    ('Y004036010', 4, '伝達関数と過渡応答', '', False, True, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y4000
◎', '', '2025-05-19T02:21:24.523523', NULL),
    ('Y004037010', 4, '機構学の基礎理論とリンク機構', '', False, True, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y4000
○', '', '2025-05-19T02:21:24.541946', NULL),
    ('Y004038010', 4, '', '', False, True, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y4000
○', '', '2025-05-19T02:21:24.561069', NULL),
    ('Y004039010', 4, '複素関数論', '', False, True, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y4000
○', '', '2025-05-19T02:21:24.578619', NULL),
    ('Y004040010', 4, '振動モード解析', '', False, True, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y4000
○', '', '2025-05-19T02:21:24.599077', NULL),
    ('Y004041010', 4, '', '', False, True, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y4000
○', '', '2025-05-19T02:21:24.621089', NULL),
    ('Y004042010', 4, '', '', False, True, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y4000
○', '', '2025-05-19T02:21:24.639519', NULL),
    ('Y004043010', 4, '', '', False, True, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y4000
◎', '', '2025-05-19T02:21:24.657720', NULL),
    ('Y004044010', 4, '', '', False, True, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y4000
○', '', '2025-05-19T02:21:24.676207', NULL),
    ('Y004045010', 4, '制御系の周波数応答と安定判別', '', False, True, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y4000
◎', '', '2025-05-19T02:21:24.695719', NULL),
    ('Y004046010', 4, '様々な運動変換機構', '', False, True, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y4000
○', '', '2025-05-19T02:21:24.716712', NULL),
    ('Y004047010', 4, '', '', False, True, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y4000
○', '', '2025-05-19T02:21:24.734223', NULL),
    ('Y004048010', 4, '', '後期', False, True, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y4000
○', '', '2025-05-19T02:21:24.756121', NULL),
    ('Y004049010', 4, '', '後期', False, True, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y4000
◎', '', '2025-05-19T02:21:24.776703', NULL),
    ('Y004050010', 4, '', '後期', False, True, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y4000
◎', '', '2025-05-19T02:21:24.797061', NULL),
    ('Y004051010', 4, '', '', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y4000
○', '', '2025-05-19T02:21:24.816240', NULL),
    ('Y004052010', 4, '連続体力学', '', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y4000
○', '', '2025-05-19T02:21:24.835092', NULL),
    ('Y004053010', 4, '', '', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y4000
○', '', '2025-05-19T02:21:24.867227', NULL),
    ('Y004054010', 4, '熱機関工学', '', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y4000
○', '', '2025-05-19T02:21:24.886950', NULL),
    ('Y004055010', 4, '', '', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y4000
○', '', '2025-05-19T02:21:24.906288', NULL),
    ('Y004056010', 4, '有限要素法、力学解析、数値シミュレーション', '', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y4000
○', '', '2025-05-19T02:21:24.925674', NULL),
    ('Y004057010', 4, '', '', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y4000
◎', '', '2025-05-19T02:21:24.944675', NULL),
    ('Y004057020', 4, '', '', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y4000
◎', '', '2025-05-19T02:21:24.964888', NULL),
    ('Y004058010', 4, '', '', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y4000
◎', '', '2025-05-19T02:21:24.985998', NULL),
    ('Y004059010', 4, 'メカトロニクスの基礎とアクチュエータ', '', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y4000
○', '', '2025-05-19T02:21:25.006767', NULL),
    ('Y004060010', 4, '', '', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y4000
○', '', '2025-05-19T02:21:25.027108', NULL),
    ('Y004061010', 4, '', '', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y4000
○', '', '2025-05-19T02:21:25.046713', NULL),
    ('Y004062010', 4, '', '', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y4000
○', '', '2025-05-19T02:21:25.066914', NULL),
    ('Y004063010', 4, '３自由度ロボットアームの製作とArduinoによる制御', '', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y4000
○', '', '2025-05-19T02:21:25.087605', NULL),
    ('Y004064010', 4, 'ヒートシンクの設計製作および性能評価', '', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y4000
○', '', '2025-05-19T02:21:25.108738', NULL),
    ('Y004065010', 4, '', '', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y4000
○', '', '2025-05-19T02:21:25.129343', NULL),
    ('Y004066010', 4, '連続体力学・有限要素法', '', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y4000
○', '', '2025-05-19T02:21:25.148566', NULL),
    ('Y004067010', 4, '熱機関工学', '', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y4000
○', '', '2025-05-19T02:21:25.169365', NULL),
    ('Y004068010', 4, '熱機関工学', '', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y4000
○', '', '2025-05-19T02:21:25.187852', NULL),
    ('Y004069010', 4, '', '', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y4000
○', '', '2025-05-19T02:21:25.205942', NULL),
    ('Y004070010', 4, '有限要素法、力学解析、数値シミュレーション', '', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y4000
○', '', '2025-05-19T02:21:25.240770', NULL),
    ('Y004071010', 4, '', '', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y4000
○', '', '2025-05-19T02:21:25.266594', NULL),
    ('Y004072010', 4, 'メカトロニクスにおけるセンサとコントローラ', '', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y4000
○', '', '2025-05-19T02:21:25.289989', NULL),
    ('Y004073010', 4, '', '', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y4000
○', '', '2025-05-19T02:21:25.307987', NULL),
    ('Y004074010', 4, '', '', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y4000
○', '', '2025-05-19T02:21:25.325504', NULL),
    ('Y004075010', 4, '', '', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y4000
◎', '', '2025-05-19T02:21:25.345240', NULL),
    ('Y004076010', 4, '', '', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y4000
◎', '', '2025-05-19T02:21:25.364399', NULL),
    ('Y004077010', 4, '生体力学・バイオエンジニアリング・生体医工学', '', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y4000
○', '', '2025-05-19T02:21:25.387180', NULL),
    ('Y004078010', 4, '', '', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y4000
○', '', '2025-05-19T02:21:25.405471', NULL),
    ('Y004079010', 4, '', '', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y4000
○', '', '2025-05-19T02:21:25.423210', NULL),
    ('Y004080010', 4, '', '', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y4000
○', '', '2025-05-19T02:21:25.440424', NULL),
    ('Y004081010', 4, '', '', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y4000
○', '', '2025-05-19T02:21:25.471352', NULL),
    ('Y004082010', 4, '', '', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y4000
◎', '', '2025-05-19T02:21:25.505870', NULL),
    ('Y004083010', 4, '', '', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y4000
○', '', '2025-05-19T02:21:25.526987', NULL),
    ('Y004084010', 4, '', '', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y4000
○', '', '2025-05-19T02:21:25.546988', NULL),
    ('Y004085010', 4, '', '', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y4000
○', '', '2025-05-19T02:21:25.568003', NULL),
    ('Y004086010', 4, '', '', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y4000
○', '', '2025-05-19T02:21:25.586396', NULL),
    ('Y004087010', 4, '', '', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y4000
○', '', '2025-05-19T02:21:25.607081', NULL),
    ('Y004088010', 4, '手巻きウインチの設計', '後期', False, False, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y4000
◎', '', '2025-05-19T02:21:25.646796', NULL),
    ('Y004089020', 4, '', '後期', False, False, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y4000
◎', '', '2025-05-19T02:21:25.662587', NULL),
    ('Y004089030', 4, '', '後期', False, False, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y4000
◎', '', '2025-05-19T02:21:25.678311', NULL),
    ('Y004089040', 4, '', '後期', False, False, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y4000
◎', '', '2025-05-19T02:21:25.694840', NULL),
    ('Y004089050', 4, '', '後期', False, False, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y4000
◎', '', '2025-05-19T02:21:25.710836', NULL),
    ('Y004089060', 4, '', '後期', False, False, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y4000
◎', '', '2025-05-19T02:21:25.726945', NULL),
    ('Y004089070', 4, '', '後期', False, False, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y4000
◎', '', '2025-05-19T02:21:25.743174', NULL),
    ('Y004089080', 4, '', '後期', False, False, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y4000
◎', '', '2025-05-19T02:21:25.758176', NULL),
    ('Y004089090', 4, '', '後期', False, False, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y4000
◎', '', '2025-05-19T02:21:25.774139', NULL),
    ('Y004089100', 4, '', '後期', False, False, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y4000
◎', '', '2025-05-19T02:21:25.791333', NULL),
    ('Y004089110', 4, '', '後期', False, False, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y4000
◎', '', '2025-05-19T02:21:25.809329', NULL),
    ('Y004089120', 4, '', '後期', False, False, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y4000
◎', '', '2025-05-19T02:21:25.825406', NULL),
    ('Y004089130', 4, '', '後期', False, False, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y4000
◎', '', '2025-05-19T02:21:25.839947', NULL),
    ('Y004089140', 4, '', '後期', False, False, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y4000
◎', '', '2025-05-19T02:21:25.856270', NULL),
    ('Y004090010', 2025, '', '前期', False, False, False, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y4000
◎', '', '2025-05-19T02:21:25.870943', NULL),
    ('Y004090260', 2025, '', '前期', False, False, False, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y4000
◎', '', '2025-05-19T02:21:25.887065', NULL),
    ('Y004090270', 2025, '', '前期', False, False, False, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y4000
◎', '', '2025-05-19T02:21:25.902052', NULL),
    ('Y004090290', 2025, '', '前期', False, False, False, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y4000
◎', '', '2025-05-19T02:21:25.918816', NULL),
    ('Y004090300', 2025, '', '前期', False, False, False, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y4000
◎', '', '2025-05-19T02:21:25.932845', NULL),
    ('Y004090310', 2025, '', '前期', False, False, False, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y4000
◎', '', '2025-05-19T02:21:25.949306', NULL),
    ('Y004090320', 2025, '', '前期', False, False, False, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y4000
◎', '', '2025-05-19T02:21:25.964880', NULL),
    ('Y004090330', 2025, '', '前期', False, False, False, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y4000
◎', '', '2025-05-19T02:21:25.980169', NULL),
    ('Y004090340', 2025, '', '前期', False, False, False, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y4000
◎', '', '2025-05-19T02:21:25.996016', NULL),
    ('Y004090350', 2025, '', '前期', False, False, False, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y4000
◎', '', '2025-05-19T02:21:26.024528', NULL),
    ('Y004090360', 2025, '', '前期', False, False, False, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y4000
◎', '', '2025-05-19T02:21:26.039154', NULL),
    ('Y004090370', 2025, '', '前期', False, False, False, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y4000
◎', '', '2025-05-19T02:21:26.055566', NULL),
    ('Y004090380', 2025, '', '前期', False, False, False, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y4000
◎', '', '2025-05-19T02:21:26.072831', NULL),
    ('Y004091110', 2025, '', '通年', False, False, False, True, False, False, False, False, False, '瀬田', 6, '', '', '', '', '', 'Y4000
◎', '', '2025-05-19T02:21:26.089316', NULL),
    ('Y004091260', 2025, '', '通年', False, False, False, True, False, False, False, False, False, '瀬田', 6, '', '', '', '', '', 'Y4000
◎', '', '2025-05-19T02:21:26.105878', NULL),
    ('Y004091300', 2025, '', '通年', False, False, False, True, False, False, False, False, False, '瀬田', 6, '', '', '', '', '', 'Y4000
◎', '', '2025-05-19T02:21:26.123591', NULL),
    ('Y004091320', 2025, '', '通年', False, False, False, True, False, False, False, False, False, '瀬田', 6, '', '', '', '', '', 'Y4000
◎', '', '2025-05-19T02:21:26.139100', NULL),
    ('Y004091330', 2025, '', '通年', False, False, False, True, False, False, False, False, False, '瀬田', 6, '', '', '', '', '', 'Y4000
◎', '', '2025-05-19T02:21:26.154611', NULL),
    ('Y004091340', 2025, '', '通年', False, False, False, True, False, False, False, False, False, '瀬田', 6, '', '', '', '', '', 'Y4000
◎', '', '2025-05-19T02:21:26.170637', NULL),
    ('Y004091350', 2025, '', '通年', False, False, False, True, False, False, False, False, False, '瀬田', 6, '', '', '', '', '', 'Y4000
◎', '', '2025-05-19T02:21:26.188131', NULL),
    ('Y004091360', 2025, '', '通年', False, False, False, True, False, False, False, False, False, '瀬田', 6, '', '', '', '', '', 'Y4000
◎', '', '2025-05-19T02:21:26.204151', NULL),
    ('Y004091370', 2025, '', '通年', False, False, False, True, False, False, False, False, False, '瀬田', 6, '', '', '', '', '', 'Y4000
◎', '', '2025-05-19T02:21:26.219478', NULL),
    ('Y004091380', 2025, '', '通年', False, False, False, True, False, False, False, False, False, '瀬田', 6, '', '', '', '', '', 'Y4000
◎', '', '2025-05-19T02:21:26.236698', NULL),
    ('Y004091390', 2025, '', '通年', False, False, False, True, False, False, False, False, False, '瀬田', 6, '', '', '', '', '', 'Y4000
◎', '', '2025-05-19T02:21:26.253216', NULL),
    ('Y004091400', 2025, '', '通年', False, False, False, True, False, False, False, False, False, '瀬田', 6, '', '', '', '', '', 'Y4000
◎', '', '2025-05-19T02:21:26.269288', NULL),
    ('Y004091410', 2025, '', '通年', False, False, False, True, False, False, False, False, False, '瀬田', 6, '', '', '', '', '', 'Y4000
◎', '', '2025-05-19T02:21:26.285612', NULL),
    ('Y004092010', 4, '１変数の微分積分', '', True, True, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y4000
再', '', '2025-05-19T02:21:26.304559', NULL),
    ('Y004093010', 4, '力学入門', '', True, True, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y4000
再', '', '2025-05-19T02:21:26.322258', NULL),
    ('Y005001010', 4, '', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y5000
◎', '', '2025-05-19T02:21:26.341319', NULL),
    ('Y005002010', 4, '微分積分法を中心として', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y5000
◎', '', '2025-05-19T02:21:26.361814', NULL),
    ('Y005003010', 4, '', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y5000
◎', '', '2025-05-19T02:21:26.392867', NULL),
    ('Y005004010', 2, '', '前期', True, True, False, False, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y5000
◎', '', '2025-05-19T02:21:26.412148', NULL),
    ('Y005005010', 4, '', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y5000
◎', '', '2025-05-19T02:21:26.436235', NULL),
    ('Y005006010', 4, '古典力学（ニュートン力学）入門', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y5000
◎', '', '2025-05-19T02:21:26.457295', NULL),
    ('Y005007010', 4, '', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y5000
◎', '', '2025-05-19T02:21:26.478515', NULL),
    ('Y005008010', 4, '物理化学入門', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y5000
◎', '', '2025-05-19T02:21:26.499905', NULL),
    ('Y005009010', 4, '基礎有機化学', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y5000
◎', '', '2025-05-19T02:21:26.519765', NULL),
    ('Y005010010', 4, '', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y5000
◎', '', '2025-05-19T02:21:26.541441', NULL),
    ('Y005011010', 4, '', '前期', False, True, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y5000
◎', '', '2025-05-19T02:21:26.561100', NULL),
    ('Y005012010', 4, '', '', False, True, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y5000
◎', '', '2025-05-19T02:21:26.582050', NULL),
    ('Y005013010', 4, '', '', False, True, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y5000
◎', '', '2025-05-19T02:21:26.602358', NULL),
    ('Y005014010', 4, '', '前期', False, True, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y5000
◎', '', '2025-05-19T02:21:26.624729', NULL),
    ('Y005015010', 4, '', '前期', False, True, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y5000
◎', '', '2025-05-19T02:21:26.645278', NULL),
    ('Y005016010', 4, '無機化合物とその結晶構造（旧無機化学IVの後継授業）', '前期', False, True, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y5000
◎', '', '2025-05-19T02:21:26.667755', NULL),
    ('Y005017010', 4, '', '前期', False, True, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y5000
◎', '', '2025-05-19T02:21:26.692567', NULL),
    ('Y005018010', 4, '', '前期', False, True, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y5000
◎', '', '2025-05-19T02:21:26.714422', NULL),
    ('Y005019010', 4, '', '前期', False, True, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y5000
○', '', '2025-05-19T02:21:26.736749', NULL),
    ('Y005020010', 4, '', '後期', False, True, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y5000
◎', '', '2025-05-19T02:21:26.774509', NULL),
    ('Y005021010', 4, '', '', False, False, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y5000
◎', '', '2025-05-19T02:21:26.798025', NULL),
    ('Y005022010', 4, '', '', False, False, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y5000
◎', '', '2025-05-19T02:21:26.818488', NULL),
    ('Y005023010', 4, '化学におけるベクトル演算の重要性', '', False, True, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y5000
○', '', '2025-05-19T02:21:26.838092', NULL),
    ('Y005024010', 4, '量子力学入門（前期量子論）', '', False, True, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y5000
○', '', '2025-05-19T02:21:26.857360', NULL),
    ('Y005025010', 4, '化学におけるベクトル演算の重要性', '', False, True, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y5000
○', '', '2025-05-19T02:21:26.875247', NULL),
    ('Y005026010', 4, '量子力学入門（シュレ－ディンガ－方程式）', '', False, True, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y5000
○', '', '2025-05-19T02:21:26.894994', NULL),
    ('Y005027010', 4, '化学において使用する数学、統計学', '', False, True, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y5000
○', '', '2025-05-19T02:21:26.913991', NULL),
    ('Y005028010', 4, '波動と光学入門', '', False, True, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y5000
○', '', '2025-05-19T02:21:26.934542', NULL),
    ('Y005029010', 4, '', '', False, True, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y5000
○', '', '2025-05-19T02:21:26.954799', NULL),
    ('Y005030010', 4, '', '', False, True, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y5000
○', '', '2025-05-19T02:21:26.972524', NULL),
    ('Y005031010', 4, '', '', False, True, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y5000
○', '', '2025-05-19T02:21:26.992019', NULL),
    ('Y005032010', 4, '', '', False, True, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y5000
○', '', '2025-05-19T02:21:27.010433', NULL),
    ('Y005033010', 4, '結晶構造と相図（状態図）', '', False, True, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y5000
○', '', '2025-05-19T02:21:27.028630', NULL),
    ('Y005034010', 4, '高分子科学の基礎', '', False, True, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y5000
○', '', '2025-05-19T02:21:27.050103', NULL),
    ('Y005035010', 4, '', '', False, True, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y5000
○', '', '2025-05-19T02:21:27.070560', NULL),
    ('Y005036010', 4, '化学において使用する数学', '', False, True, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y5000
○', '', '2025-05-19T02:21:27.094059', NULL),
    ('Y005037010', 4, '電磁気学入門', '', False, True, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y5000
○', '', '2025-05-19T02:21:27.111714', NULL),
    ('Y005038010', 4, '', '', False, True, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y5000
○', '', '2025-05-19T02:21:27.145317', NULL),
    ('Y005039010', 4, '分子軌道法入門', '', False, True, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y5000
○', '', '2025-05-19T02:21:27.162285', NULL),
    ('Y005040010', 4, '', '', False, True, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y5000
○', '', '2025-05-19T02:21:27.183188', NULL),
    ('Y005041010', 4, '', '', False, True, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y5000
○', '', '2025-05-19T02:21:27.206121', NULL),
    ('Y005042010', 4, '結晶構造と相図（状態図）', '', False, True, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y5000
○', '', '2025-05-19T02:21:27.225221', NULL),
    ('Y005043010', 4, '高分子科学の基礎', '', False, True, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y5000
○', '', '2025-05-19T02:21:27.243356', NULL),
    ('Y005044010', 4, '', '', False, True, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y5000
○', '', '2025-05-19T02:21:27.264177', NULL),
    ('Y005045010', 4, '', '後期', False, True, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y5000
○', '', '2025-05-19T02:21:27.291032', NULL),
    ('Y005046010', 4, '', '', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y5000
○', '', '2025-05-19T02:21:27.310037', NULL),
    ('Y005047010', 4, '統計熱力学とその応用、物性を支配する構造の特色とその評価方法', '', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y5000
○', '', '2025-05-19T02:21:27.329042', NULL),
    ('Y005048010', 4, '', '', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y5000
○', '', '2025-05-19T02:21:27.348518', NULL),
    ('Y005049010', 4, '医薬品プロセス化学業界への誘い', '', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y5000
○', '', '2025-05-19T02:21:27.368513', NULL),
    ('Y005050010', 4, '', '', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y5000
○', '', '2025-05-19T02:21:27.388998', NULL),
    ('Y005051010', 4, '有機化合物の構造を基礎レベルで判断する能力を養う', '', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y5000
○', '', '2025-05-19T02:21:27.407902', NULL),
    ('Y005052010', 4, '', '', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y5000
○', '', '2025-05-19T02:21:27.425903', NULL),
    ('Y005053010', 4, '', '', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y5000
○', '', '2025-05-19T02:21:27.445705', NULL),
    ('Y005054010', 4, '', '', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y5000
○', '', '2025-05-19T02:21:27.465228', NULL),
    ('Y005055010', 4, '', '', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y5000
○', '', '2025-05-19T02:21:27.485486', NULL),
    ('Y005056010', 4, '', '', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y5000
○', '', '2025-05-19T02:21:27.528012', NULL),
    ('Y005057010', 4, '', '', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y5000
○', '', '2025-05-19T02:21:27.546014', NULL),
    ('Y005058010', 4, '', '', False, False, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y5000
○', '', '2025-05-19T02:21:27.566832', NULL),
    ('Y005059010', 4, '', '', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y5000
○', '', '2025-05-19T02:21:27.586624', NULL),
    ('Y005060010', 4, '統計熱力学とその応用、物性を支配する構造の特色とその評価方法', '', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y5000
○', '', '2025-05-19T02:21:27.606483', NULL),
    ('Y005061010', 4, '', '', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y5000
○', '', '2025-05-19T02:21:27.627142', NULL),
    ('Y005062010', 4, '', '', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y5000
○', '', '2025-05-19T02:21:27.645153', NULL),
    ('Y005063010', 4, '', '', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y5000
○', '', '2025-05-19T02:21:27.663818', NULL),
    ('Y005064010', 4, '', '', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y5000
○', '', '2025-05-19T02:21:27.686212', NULL),
    ('Y005065010', 4, '', '', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y5000
○', '', '2025-05-19T02:21:27.704206', NULL),
    ('Y005066010', 4, '物性を支配する構造の特色とその評価方法', '', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y5000
○', '', '2025-05-19T02:21:27.723292', NULL),
    ('Y005067010', 4, '', '', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y5000
○', '', '2025-05-19T02:21:27.742724', NULL),
    ('Y005068010', 4, '', '', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y5000
○', '', '2025-05-19T02:21:27.764238', NULL),
    ('Y005069010', 4, '有機電子論（矢印の使い方）と逆合成解析の基礎', '', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y5000
○', '', '2025-05-19T02:21:27.783092', NULL),
    ('Y005070010', 4, '', '', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y5000
○', '', '2025-05-19T02:21:27.804018', NULL),
    ('Y005071010', 4, '', '', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y5000
○', '', '2025-05-19T02:21:27.823019', NULL),
    ('Y005072010', 4, '', '', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y5000
○', '', '2025-05-19T02:21:27.840023', NULL),
    ('Y005073010', 4, '', '', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y5000
○', '', '2025-05-19T02:21:27.862034', NULL),
    ('Y005074010', 4, '', '', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y5000
○', '', '2025-05-19T02:21:27.884057', NULL),
    ('Y005075010', 4, '逆合成解析と官能基相互変換を用いる実際の医薬品合成', '', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y5000
○', '', '2025-05-19T02:21:27.920623', NULL),
    ('Y005076010', 4, '', '', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y5000
○', '', '2025-05-19T02:21:27.938129', NULL),
    ('Y005077010', 4, '', '', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y5000
○', '', '2025-05-19T02:21:27.956298', NULL),
    ('Y005078010', 4, '', '', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y5000
○', '', '2025-05-19T02:21:27.976302', NULL),
    ('Y005079010', 4, '', '後期', False, False, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y5000
◎', '', '2025-05-19T02:21:27.995791', NULL),
    ('Y005079020', 4, '', '後期', False, False, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y5000
◎', '', '2025-05-19T02:21:28.019804', NULL),
    ('Y005079040', 4, '研究の設計方法と実践', '後期', False, False, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y5000
◎', '', '2025-05-19T02:21:28.042836', NULL),
    ('Y005079050', 4, '', '後期', False, False, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y5000
◎', '', '2025-05-19T02:21:28.062482', NULL),
    ('Y005079060', 4, '', '後期', False, False, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y5000
◎', '', '2025-05-19T02:21:28.084865', NULL),
    ('Y005079070', 4, '研究発表に必要なプレゼンテーション', '後期', False, False, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y5000
◎', '', '2025-05-19T02:21:28.111383', NULL),
    ('Y005079080', 4, '', '後期', False, False, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y5000
◎', '', '2025-05-19T02:21:28.154353', NULL),
    ('Y005079090', 4, '', '後期', False, False, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y5000
◎', '', '2025-05-19T02:21:28.176998', NULL),
    ('Y005079100', 4, '', '後期', False, False, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y5000
◎', '', '2025-05-19T02:21:28.198542', NULL),
    ('Y005079110', 4, '', '後期', False, False, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y5000
◎', '', '2025-05-19T02:21:28.219042', NULL),
    ('Y005079120', 4, '研究の設計方法と実践', '後期', False, False, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y5000
◎', '', '2025-05-19T02:21:28.237840', NULL),
    ('Y005079130', 4, '', '後期', False, False, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y5000
◎', '', '2025-05-19T02:21:28.258563', NULL),
    ('Y005080390', 4, '', '後期', False, False, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y5000
◎', '', '2025-05-19T02:21:28.278361', NULL),
    ('Y005080400', 4, '', '後期', False, False, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y5000
◎', '', '2025-05-19T02:21:28.314275', NULL),
    ('Y005080420', 4, '科学技術論文の読み方を習得する', '後期', False, False, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y5000
◎', '', '2025-05-19T02:21:28.333668', NULL),
    ('Y005080430', 4, '', '後期', False, False, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y5000
◎', '', '2025-05-19T02:21:28.354211', NULL),
    ('Y005080440', 4, '', '後期', False, False, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y5000
◎', '', '2025-05-19T02:21:28.373947', NULL),
    ('Y005080450', 4, '研究活動に使用する技術用語を正確に把握する。', '後期', False, False, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y5000
◎', '', '2025-05-19T02:21:28.390449', NULL),
    ('Y005080460', 4, '', '後期', False, False, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y5000
◎', '', '2025-05-19T02:21:28.413482', NULL),
    ('Y005080470', 4, '', '後期', False, False, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y5000
◎', '', '2025-05-19T02:21:28.436130', NULL),
    ('Y005080480', 4, '', '後期', False, False, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y5000
◎', '', '2025-05-19T02:21:28.458359', NULL),
    ('Y005080490', 4, '', '後期', False, False, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y5000
◎', '', '2025-05-19T02:21:28.478745', NULL),
    ('Y005080500', 4, '', '後期', False, False, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y5000
◎', '', '2025-05-19T02:21:28.501816', NULL),
    ('Y005080700', 4, '', '後期', False, False, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y5000
◎', '', '2025-05-19T02:21:28.523588', NULL),
    ('Y005081010', 2025, '', '前期', False, False, False, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y5000
◎', '', '2025-05-19T02:21:28.538884', NULL),
    ('Y005081020', 2025, '', '前期', False, False, False, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y5000
◎', '', '2025-05-19T02:21:28.555388', NULL),
    ('Y005081040', 2025, '無機・金属系の英語セミナー', '前期', False, False, False, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y5000
◎', '', '2025-05-19T02:21:28.570899', NULL),
    ('Y005081050', 2025, '', '前期', False, False, False, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y5000
◎', '', '2025-05-19T02:21:28.586679', NULL),
    ('Y005081060', 2025, '', '前期', False, False, False, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y5000
◎', '', '2025-05-19T02:21:28.602658', NULL),
    ('Y005081070', 2025, '', '前期', False, False, False, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y5000
◎', '', '2025-05-19T02:21:28.618658', NULL),
    ('Y005081080', 2025, '', '前期', False, False, False, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y5000
◎', '', '2025-05-19T02:21:28.633104', NULL),
    ('Y005081090', 2025, '', '前期', False, False, False, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y5000
◎', '', '2025-05-19T02:21:28.649789', NULL),
    ('Y005081100', 2025, '', '前期', False, False, False, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y5000
◎', '', '2025-05-19T02:21:28.693329', NULL),
    ('Y005081110', 2025, '', '前期', False, False, False, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y5000
◎', '', '2025-05-19T02:21:28.714342', NULL),
    ('Y005081120', 2025, '', '前期', False, False, False, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y5000
◎', '', '2025-05-19T02:21:28.728792', NULL),
    ('Y005081130', 2025, '', '前期', False, False, False, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y5000
◎', '', '2025-05-19T02:21:28.749773', NULL),
    ('Y005082420', 2025, '', '通年', False, False, False, True, False, False, False, False, False, '瀬田', 10, '', '', '', '', '', 'Y5000
◎', '', '2025-05-19T02:21:28.764189', NULL),
    ('Y005082430', 2025, '', '通年', False, False, False, True, False, False, False, False, False, '瀬田', 10, '', '', '', '', '', 'Y5000
◎', '', '2025-05-19T02:21:28.788500', NULL),
    ('Y005082450', 2025, '', '通年', False, False, False, True, False, False, False, False, False, '瀬田', 10, '', '', '', '', '', 'Y5000
◎', '', '2025-05-19T02:21:28.808570', NULL),
    ('Y005082460', 2025, '', '通年', False, False, False, True, False, False, False, False, False, '瀬田', 10, '', '', '', '', '', 'Y5000
◎', '', '2025-05-19T02:21:28.826210', NULL),
    ('Y005082470', 2025, '', '通年', False, False, False, True, False, False, False, False, False, '瀬田', 10, '', '', '', '', '', 'Y5000
◎', '', '2025-05-19T02:21:28.843096', NULL),
    ('Y005082480', 2025, '', '通年', False, False, False, True, False, False, False, False, False, '瀬田', 10, '', '', '', '', '', 'Y5000
◎', '', '2025-05-19T02:21:28.862129', NULL),
    ('Y005082490', 2025, '', '通年', False, False, False, True, False, False, False, False, False, '瀬田', 10, '', '', '', '', '', 'Y5000
◎', '', '2025-05-19T02:21:28.883672', NULL),
    ('Y005082500', 2025, '', '通年', False, False, False, True, False, False, False, False, False, '瀬田', 10, '', '', '', '', '', 'Y5000
◎', '', '2025-05-19T02:21:28.899534', NULL),
    ('Y005082510', 2025, '', '通年', False, False, False, True, False, False, False, False, False, '瀬田', 10, '', '', '', '', '', 'Y5000
◎', '', '2025-05-19T02:21:28.916117', NULL),
    ('Y005082520', 2025, '', '通年', False, False, False, True, False, False, False, False, False, '瀬田', 10, '', '', '', '', '', 'Y5000
◎', '', '2025-05-19T02:21:28.935327', NULL),
    ('Y005082530', 2025, '', '通年', False, False, False, True, False, False, False, False, False, '瀬田', 10, '', '', '', '', '', 'Y5000
◎', '', '2025-05-19T02:21:28.951347', NULL),
    ('Y005082540', 2025, '', '通年', False, False, False, True, False, False, False, False, False, '瀬田', 10, '', '', '', '', '', 'Y5000
◎', '', '2025-05-19T02:21:28.972819', NULL),
    ('Y006001010', 4, '', '', True, True, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y6000
◎', '', '2025-05-19T02:21:28.997324', NULL),
    ('Y006002010', 4, '', '', True, True, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y6000
◎', '', '2025-05-19T02:21:29.019452', NULL),
    ('Y006003010', 4, '', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y6000
◎', '', '2025-05-19T02:21:29.037441', NULL),
    ('Y006004010', 4, '「集合と写像」，「順列・組合せ」から「差分・和分」へ', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y6000
◎', '', '2025-05-19T02:21:29.083944', NULL),
    ('Y006005010', 4, '', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y6000
◎', '', '2025-05-19T02:21:29.106767', NULL),
    ('Y006006010', 4, '', '', True, True, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y6000
◎', '', '2025-05-19T02:21:29.125767', NULL),
    ('Y006007010', 4, '', '', True, True, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y6000
◎', '', '2025-05-19T02:21:29.143830', NULL),
    ('Y006008010', 4, '', '', True, True, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y6000
◎', '', '2025-05-19T02:21:29.160624', NULL),
    ('Y006009010', 4, '', '', True, True, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y6000
◎', '', '2025-05-19T02:21:29.178407', NULL),
    ('Y006010010', 4, '', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y6000
●', '', '2025-05-19T02:21:29.200937', NULL),
    ('Y006011010', 4, '', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y6000
◎', '', '2025-05-19T02:21:29.219840', NULL),
    ('Y006012010', 4, '', '', True, True, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y6000
◎', '', '2025-05-19T02:21:29.238732', NULL),
    ('Y006013010', 4, '', '後期', False, True, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y6000
◎', '', '2025-05-19T02:21:29.261566', NULL),
    ('Y006014010', 4, '', '', True, True, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y6000
○', '', '2025-05-19T02:21:29.280360', NULL),
    ('Y006015010', 4, '', '', True, True, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y6000
○', '', '2025-05-19T02:21:29.299427', NULL),
    ('Y006016010', 4, '', '', True, True, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y6000
○', '', '2025-05-19T02:21:29.316766', NULL),
    ('Y006017010', 4, '大気科学に係わる基礎となる知見、技術', '', True, True, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y6000
◎', '', '2025-05-19T02:21:29.335170', NULL),
    ('Y006018010', 4, '', '', True, True, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y6000
◎', '', '2025-05-19T02:21:29.352971', NULL),
    ('Y006019010', 4, '', '', True, True, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y6000
○', '', '2025-05-19T02:21:29.370195', NULL),
    ('Y006020010', 4, '', '', False, True, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y6000
○', '', '2025-05-19T02:21:29.410578', NULL),
    ('Y006022010', 4, '', '', False, True, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y6000
○', '', '2025-05-19T02:21:29.434581', NULL),
    ('Y006023010', 4, '', '', False, True, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y6000
○', '', '2025-05-19T02:21:29.452596', NULL),
    ('Y006024010', 4, '環境倫理学入門', '', False, True, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y6000
○', '', '2025-05-19T02:21:29.482477', NULL),
    ('Y006025010', 4, '', '', False, True, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y6000
○', '', '2025-05-19T02:21:29.506637', NULL),
    ('Y006026010', 4, '', '', False, True, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y6000
○', '', '2025-05-19T02:21:29.525623', NULL),
    ('Y006027010', 4, '', '', False, True, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y6000
○', '', '2025-05-19T02:21:29.542622', NULL),
    ('Y006028010', 4, '', '', False, True, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y6000
○', '', '2025-05-19T02:21:29.562634', NULL),
    ('Y006029010', 4, '', '', False, True, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y6000
○', '', '2025-05-19T02:21:29.583194', NULL),
    ('Y006030010', 4, '', '', False, True, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y6000
○', '', '2025-05-19T02:21:29.603236', NULL),
    ('Y006031010', 4, '', '', False, True, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y6000
○', '', '2025-05-19T02:21:29.617755', NULL),
    ('Y006032010', 4, '自然水域での水質の項目の内容、および、浄化と汚染', '', False, True, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y6000
◎', '', '2025-05-19T02:21:29.639016', NULL),
    ('Y006033010', 4, '', '', False, True, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y6000
○', '', '2025-05-19T02:21:29.656221', NULL),
    ('Y006034010', 4, '', '', False, True, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y6000
○', '', '2025-05-19T02:21:29.678763', NULL),
    ('Y006036010', 4, 'この環境を次世代に引き継ぐために', '', False, True, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y6000
○', '', '2025-05-19T02:21:29.697088', NULL),
    ('Y006037010', 4, '', '', False, True, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y6000
○', '', '2025-05-19T02:21:29.716701', NULL),
    ('Y006038010', 4, '', '', False, True, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y6000
○', '', '2025-05-19T02:21:29.735913', NULL),
    ('Y006039010', 4, '', '', False, True, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y6000
○', '', '2025-05-19T02:21:29.754261', NULL),
    ('Y006040010', 4, '', '', False, True, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y6000
○', '', '2025-05-19T02:21:29.771273', NULL),
    ('Y006041010', 4, '', '', False, True, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y6000
○', '', '2025-05-19T02:21:29.788921', NULL),
    ('Y006042010', 4, 'モデリングを通じて学ぶ生態学理論', '', False, True, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y6000
○', '', '2025-05-19T02:21:29.807768', NULL),
    ('Y006044010', 4, '', '', False, True, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y6000
○', '', '2025-05-19T02:21:29.844057', NULL),
    ('Y006045010', 4, '', '', False, True, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y6000
○', '', '2025-05-19T02:21:29.861228', NULL),
    ('Y006046010', 4, 'データ解析を通じて観る世界', '', False, True, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y6000
○', '', '2025-05-19T02:21:29.880392', NULL),
    ('Y006047010', 4, '', '', False, True, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y6000
○', '', '2025-05-19T02:21:29.895923', NULL),
    ('Y006048010', 4, '', '', False, True, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y6000
◎', '', '2025-05-19T02:21:29.915038', NULL),
    ('Y006049010', 4, '', '', False, True, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y6000
○', '', '2025-05-19T02:21:29.933677', NULL),
    ('Y006050010', 4, '', '', False, True, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y6000
○', '', '2025-05-19T02:21:29.952097', NULL),
    ('Y006051010', 4, '', '', False, True, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y6000
◎', '', '2025-05-19T02:21:29.968726', NULL),
    ('Y006052010', 4, '', '', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y6000
○', '', '2025-05-19T02:21:29.986894', NULL),
    ('Y006053010', 4, '大気汚染に係わる基礎となる知見、技術', '', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y6000
○', '', '2025-05-19T02:21:30.006819', NULL),
    ('Y006054010', 4, '大気・気象に係わる基礎となる知見、技術', '', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y6000
○', '', '2025-05-19T02:21:30.024431', NULL),
    ('Y006055010', 4, '循環型社会の構築に向けて', '', False, True, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y6000
○', '', '2025-05-19T02:21:30.045243', NULL),
    ('Y006056010', 4, '地理空間情報をより的確に掴み利用する', '', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y6000
○', '', '2025-05-19T02:21:30.064239', NULL),
    ('Y006057010', 4, '生物資源の持続的利用と管理のむずかしさ', '', False, True, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y6000
○', '', '2025-05-19T02:21:30.082719', NULL),
    ('Y006058010', 4, '', '', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y6000
○', '', '2025-05-19T02:21:30.099854', NULL),
    ('Y006059010', 4, '', '', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y6000
○', '', '2025-05-19T02:21:30.118722', NULL),
    ('Y006060010', 4, '', '', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y6000
○', '', '2025-05-19T02:21:30.138477', NULL),
    ('Y006061010', 4, '', '', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y6000
○', '', '2025-05-19T02:21:30.156962', NULL),
    ('Y006062010', 4, '', '', False, True, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y6000
○', '', '2025-05-19T02:21:30.175788', NULL),
    ('Y006063011', 4, '安心・安全な水道とはどういったものかについて考える。', '', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y6000
○', '', '2025-05-19T02:21:30.215303', NULL),
    ('Y006064010', 4, '', '', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y6000
○', '', '2025-05-19T02:21:30.236924', NULL),
    ('Y006065010', 4, '', '', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y6000
○', '', '2025-05-19T02:21:30.260687', NULL),
    ('Y006066010', 4, '', '', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y6000
◎', '', '2025-05-19T02:21:30.282721', NULL),
    ('Y006067010', 4, '水環境の保全における下水道の役割について考える。', '', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y6000
○', '', '2025-05-19T02:21:30.303611', NULL),
    ('Y006069010', 4, '', '', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y6000
○', '', '2025-05-19T02:21:30.324578', NULL),
    ('Y006070010', 4, '', '', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y6000
○', '', '2025-05-19T02:21:30.347587', NULL),
    ('Y006072010', 4, '', '', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y6000
○', '', '2025-05-19T02:21:30.367911', NULL),
    ('Y006073010', 4, '', '', False, False, True, True, False, False, False, False, False, '瀬田', 1, '', '', '', '', '', 'Y6000
○', '', '2025-05-19T02:21:30.390131', NULL),
    ('Y006074010', 4, '', '後期', False, False, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y6000
◎', '', '2025-05-19T02:21:30.415782', NULL),
    ('Y006074020', 4, '', '後期', False, False, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y6000
◎', '', '2025-05-19T02:21:30.437560', NULL),
    ('Y006074030', 4, '', '後期', False, False, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y6000
◎', '', '2025-05-19T02:21:30.461540', NULL),
    ('Y006074050', 4, '', '後期', False, False, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y6000
◎', '', '2025-05-19T02:21:30.482445', NULL),
    ('Y006074060', 4, '', '後期', False, False, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y6000
◎', '', '2025-05-19T02:21:30.501970', NULL),
    ('Y006074090', 4, '', '後期', False, False, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y6000
◎', '', '2025-05-19T02:21:30.521964', NULL),
    ('Y006074110', 4, '', '後期', False, False, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y6000
◎', '', '2025-05-19T02:21:30.543260', NULL),
    ('Y006074120', 4, '', '後期', False, False, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y6000
◎', '', '2025-05-19T02:21:30.564399', NULL),
    ('Y006074140', 4, '', '後期', False, False, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y6000
◎', '', '2025-05-19T02:21:30.583952', NULL),
    ('Y006074150', 4, '', '後期', False, False, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y6000
◎', '', '2025-05-19T02:21:30.629035', NULL),
    ('Y006074160', 4, '', '後期', False, False, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y6000
◎', '', '2025-05-19T02:21:30.647047', NULL),
    ('Y006074170', 4, '', '後期', False, False, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y6000
◎', '', '2025-05-19T02:21:30.667473', NULL),
    ('Y006075010', 2025, '', '前期', False, False, False, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y6000
◎', '', '2025-05-19T02:21:30.686831', NULL),
    ('Y006075020', 2025, '', '前期', False, False, False, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y6000
◎', '', '2025-05-19T02:21:30.705840', NULL),
    ('Y006075030', 2025, '', '前期', False, False, False, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y6000
◎', '', '2025-05-19T02:21:30.727968', NULL),
    ('Y006075050', 2025, '', '前期', False, False, False, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y6000
◎', '', '2025-05-19T02:21:30.748096', NULL),
    ('Y006075060', 2025, '', '前期', False, False, False, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y6000
◎', '', '2025-05-19T02:21:30.767658', NULL),
    ('Y006075090', 2025, '', '前期', False, False, False, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y6000
◎', '', '2025-05-19T02:21:30.789606', NULL),
    ('Y006075130', 2025, '', '前期', False, False, False, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y6000
◎', '', '2025-05-19T02:21:30.813633', NULL),
    ('Y006075140', 2025, '', '前期', False, False, False, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y6000
◎', '', '2025-05-19T02:21:30.833720', NULL),
    ('Y006075150', 2025, '', '前期', False, False, False, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y6000
◎', '', '2025-05-19T02:21:30.854374', NULL),
    ('Y006075160', 2025, '', '前期', False, False, False, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y6000
◎', '', '2025-05-19T02:21:30.878267', NULL),
    ('Y006075170', 2025, '', '前期', False, False, False, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y6000
◎', '', '2025-05-19T02:21:30.898742', NULL),
    ('Y006076010', 2025, '', '後期', False, False, False, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y6000
◎', '', '2025-05-19T02:21:30.920724', NULL),
    ('Y006076020', 2025, '', '後期', False, False, False, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y6000
◎', '', '2025-05-19T02:21:30.945348', NULL),
    ('Y006076030', 2025, '', '後期', False, False, False, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y6000
◎', '', '2025-05-19T02:21:30.966018', NULL),
    ('Y006076050', 2025, '', '後期', False, False, False, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y6000
◎', '', '2025-05-19T02:21:31.004934', NULL),
    ('Y006076060', 2025, '', '後期', False, False, False, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y6000
◎', '', '2025-05-19T02:21:31.032196', NULL),
    ('Y006076090', 2025, '', '後期', False, False, False, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y6000
◎', '', '2025-05-19T02:21:31.054024', NULL),
    ('Y006076130', 2025, '', '後期', False, False, False, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y6000
◎', '', '2025-05-19T02:21:31.074898', NULL),
    ('Y006076140', 2025, '', '後期', False, False, False, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y6000
◎', '', '2025-05-19T02:21:31.094639', NULL),
    ('Y006076150', 2025, '', '後期', False, False, False, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y6000
◎', '', '2025-05-19T02:21:31.117721', NULL),
    ('Y006076160', 2025, '', '後期', False, False, False, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y6000
◎', '', '2025-05-19T02:21:31.144050', NULL),
    ('Y006076170', 2025, '', '後期', False, False, False, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y6000
◎', '', '2025-05-19T02:21:31.166800', NULL),
    ('Y006077660', 2025, '', '通年', False, False, False, True, False, False, False, False, False, '瀬田', 6, '', '', '', '', '', 'Y6000
◎', '', '2025-05-19T02:21:31.188853', NULL),
    ('Y006077670', 2025, '', '通年', False, False, False, True, False, False, False, False, False, '瀬田', 6, '', '', '', '', '', 'Y6000
◎', '', '2025-05-19T02:21:31.228577', NULL),
    ('Y006077680', 2025, '', '通年', False, False, False, True, False, False, False, False, False, '瀬田', 6, '', '', '', '', '', 'Y6000
◎', '', '2025-05-19T02:21:31.260530', NULL),
    ('Y006077700', 2025, '', '通年', False, False, False, True, False, False, False, False, False, '瀬田', 6, '', '', '', '', '', 'Y6000
◎', '', '2025-05-19T02:21:31.283251', NULL),
    ('Y006077710', 2025, '', '通年', False, False, False, True, False, False, False, False, False, '瀬田', 6, '', '', '', '', '', 'Y6000
◎', '', '2025-05-19T02:21:31.304770', NULL),
    ('Y006077740', 2025, '', '通年', False, False, False, True, False, False, False, False, False, '瀬田', 6, '', '', '', '', '', 'Y6000
◎', '', '2025-05-19T02:21:31.327922', NULL),
    ('Y006077780', 2025, '', '通年', False, False, False, True, False, False, False, False, False, '瀬田', 6, '', '', '', '', '', 'Y6000
◎', '', '2025-05-19T02:21:31.353532', NULL),
    ('Y006077790', 2025, '', '通年', False, False, False, True, False, False, False, False, False, '瀬田', 6, '', '', '', '', '', 'Y6000
◎', '', '2025-05-19T02:21:31.378924', NULL),
    ('Y006077800', 2025, '', '通年', False, False, False, True, False, False, False, False, False, '瀬田', 6, '', '', '', '', '', 'Y6000
◎', '', '2025-05-19T02:21:31.399987', NULL),
    ('Y006077810', 2025, '', '通年', False, False, False, True, False, False, False, False, False, '瀬田', 6, '', '', '', '', '', 'Y6000
◎', '', '2025-05-19T02:21:31.440457', NULL),
    ('Y006077820', 2025, '', '通年', False, False, False, True, False, False, False, False, False, '瀬田', 6, '', '', '', '', '', 'Y6000
◎', '', '2025-05-19T02:21:31.463037', NULL),
    ('Y009001010', 4, '情報化の進展が及ぼす社会生活の変容', '', False, True, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y
○', '', '2025-05-19T02:21:31.482341', NULL),
    ('Y009002010', 4, '', '通年', False, False, True, True, False, False, False, False, False, '瀬田', 4, '', '', '', '', '', 'Y
□', '', '2025-05-19T02:21:31.508115', NULL),
    ('Y009003010', 4, '理工学基礎実験', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y4000
◎', '', '2025-05-19T02:21:31.530636', NULL),
    ('Y009003020', 4, '', '前期', False, True, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y6000
○', '', '2025-05-19T02:21:31.552634', NULL),
    ('Y009004010', 4, '', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', '【配当年次】（環境）1～4年次、（応化）2～4年次
Y5000
●○', '', '2025-05-19T02:21:31.571595', NULL),
    ('Y009005010', 4, '', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', '【配当年次】（環境・数理・知能・電子・機械）1～4年次、（応化）2～4年次
Y6000
●○', '', '2025-05-19T02:21:31.592782', NULL),
    ('Y009006010', 4, '', '前期', True, True, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', '【配当年次】（環境）1～4年次、（応化）2～4年次
Y5000
○', '', '2025-05-19T02:21:31.613252', NULL),
    ('Y009007010', 4, '', '後期', True, True, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', '【配当年次】（環境）1～4年次、（応化）2～4年次
Y6000
○', '', '2025-05-19T02:21:31.633563', NULL),
    ('Y00Z001010', 2, '博物館や学芸員の社会的役割', '前期', True, True, False, False, False, False, False, False, False, '深草', 2, '', '', '', '', '', 'L
□', '', '2025-05-19T02:21:31.653314', NULL),
    ('Y00Z002010', 4, '博物館で取り扱う資料について', '後期', True, True, True, True, False, False, False, False, False, '深草', 2, '', '', '', '', '', 'L
□', '', '2025-05-19T02:21:31.675605', NULL),
    ('Y00Z003010', 4, '博物館施設の理念と管理・運営', '前期', False, True, True, True, False, False, False, False, False, '大宮', 2, '', '', '', '', '', 'L
□', '', '2025-05-19T02:21:31.698433', NULL),
    ('Y00Z004010', 4, '博物館情報の発信と活用', '後期', False, True, True, True, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y
□', '', '2025-05-19T02:21:31.721272', NULL),
    ('Y00Z005010', 4, '博物館資料の保存にむけた取り組み', '後期', False, True, True, True, False, False, False, False, False, '深草', 2, '', '', '', '', '', 'L
□', '', '2025-05-19T02:21:31.744750', NULL),
    ('Y00Z006010', 4, '展覧会ができるまで', '後期', False, True, True, True, False, False, False, False, False, '大宮', 2, '', '', '', '', '', 'L
□', '', '2025-05-19T02:21:31.765280', NULL),
    ('Y00Z007010', 2, '博物館における資料の、教育的活用とその実践例', '前期', True, True, False, False, False, False, False, False, False, '深草', 2, '', '', '', '', '', 'L
□', '', '2025-05-19T02:21:31.803709', NULL),
    ('Y00Z008010', 2, '生涯学習の理念と展開', '前期', True, True, False, False, False, False, False, False, False, '深草', 2, '', '', '', '', '', 'L
□', '', '2025-05-19T02:21:31.825652', NULL),
    ('Y00Z009010', 4, '', '通年', False, False, True, True, False, False, False, False, False, '瀬田', 3, '', '', '', '', '', 'Y6000
□', '', '2025-05-19T02:21:31.851042', NULL),
    ('YXXXXX0010', 3, '', '通年', True, True, True, False, False, False, False, False, False, '瀬田', 2, '', '', '', '', '', 'Y
-', '', '2025-05-19T02:21:31.872566', NULL)
ON CONFLICT (subject_code, year, semester) DO UPDATE SET
    subtitle = EXCLUDED.subtitle,
    term = EXCLUDED.term,
    grade_b1 = EXCLUDED.grade_b1,
    grade_b2 = EXCLUDED.grade_b2,
    grade_b3 = EXCLUDED.grade_b3,
    grade_b4 = EXCLUDED.grade_b4,
    grade_m1 = EXCLUDED.grade_m1,
    grade_m2 = EXCLUDED.grade_m2,
    grade_d1 = EXCLUDED.grade_d1,
    grade_d2 = EXCLUDED.grade_d2,
    grade_d3 = EXCLUDED.grade_d3,
    campus = EXCLUDED.campus,
    credits = EXCLUDED.credits,
    lecture_code = EXCLUDED.lecture_code,
    summary = EXCLUDED.summary,
    goals = EXCLUDED.goals,
    methods = EXCLUDED.methods,
    outside_study = EXCLUDED.outside_study,
    notes = EXCLUDED.notes,
    remarks = EXCLUDED.remarks,
    updated_at = EXCLUDED.updated_at,
    updated_at = CURRENT_TIMESTAMP;
