-- faculty テーブルへのデータ挿入
INSERT INTO faculty (
    created_at, faculty_name
) VALUES
    ('2025-06-25T15:52:48.576461', '先端理工学研究科'),
    ('2025-06-25T15:52:48.576461', '先端理工学部'),
    ('2025-06-25T15:52:48.576461', '応用化学課程'),
    ('2025-06-25T15:52:48.576461', '数理·情報科学課程'),
    ('2025-06-25T15:52:48.576461', '機械工学·ロボティクス課程'),
    ('2025-06-25T15:52:48.576461', '環境生態工学課程'),
    ('2025-06-25T15:52:48.576461', '環境科学課程'),
    ('2025-06-25T15:52:48.576461', '知能情報メディア課程'),
    ('2025-06-25T15:52:48.576461', '電子情報通信課程')
ON CONFLICT (faculty_name) DO UPDATE SET faculty_name = EXCLUDED.faculty_name;
