-- subclass テーブルへのデータ挿入
INSERT INTO subclass (
    subclass_name, created_at
) VALUES
    ('スポーツ科学系科目', '2025-06-20T15:35:41.711166'),
    ('人文科学系科目', '2025-06-20T15:35:41.711166'),
    ('仏教の思想', '2025-06-20T15:35:41.711166'),
    ('専門基礎科目', '2025-06-20T15:35:41.711166'),
    ('専門応用科目', '2025-06-20T15:35:41.711166'),
    ('教養教育科目特別講義', '2025-06-20T15:35:41.711166'),
    ('社会科学系科目', '2025-06-20T15:35:41.711166'),
    ('自然科学系科目', '2025-06-20T15:35:41.711166'),
    ('言語科目', '2025-06-20T15:35:41.711166')
ON CONFLICT (subclass_name) DO UPDATE SET subclass_name = EXCLUDED.subclass_name;
