-- faculty テーブルへのデータ挿入
INSERT INTO faculty (
    faculty_name, created_at
) VALUES
    ('先端理工学研究科', '2025-06-20T15:35:53.063248'),
    ('先端理工学部', '2025-06-20T15:35:53.063248'),
    ('応用化学課程', '2025-06-20T15:35:53.063248'),
    ('数理･情報科学課程', '2025-06-20T15:35:53.063248'),
    ('機械工学･ロボティクス課程', '2025-06-20T15:35:53.063248'),
    ('環境生態工学課程', '2025-06-20T15:35:53.063248'),
    ('環境科学課程', '2025-06-20T15:35:53.063248'),
    ('知能情報メディア課程', '2025-06-20T15:35:53.063248'),
    ('電子情報通信課程', '2025-06-20T15:35:53.063248')
ON CONFLICT (faculty_name) DO UPDATE SET faculty_name = EXCLUDED.faculty_name;
